(function(){const e=document.createElement("link").relList;if(e&&e.supports&&e.supports("modulepreload"))return;for(const t of document.querySelectorAll('link[rel="modulepreload"]'))a(t);new MutationObserver(t=>{for(const l of t)if(l.type==="childList")for(const s of l.addedNodes)s.tagName==="LINK"&&s.rel==="modulepreload"&&a(s)}).observe(document,{childList:!0,subtree:!0});function c(t){const l={};return t.integrity&&(l.integrity=t.integrity),t.referrerPolicy&&(l.referrerPolicy=t.referrerPolicy),t.crossOrigin==="use-credentials"?l.credentials="include":t.crossOrigin==="anonymous"?l.credentials="omit":l.credentials="same-origin",l}function a(t){if(t.ep)return;t.ep=!0;const l=c(t);fetch(t.href,l)}})();const f=[{id:"intro",category:"intro",shortTitle:"Кіріспе",title:"Кіріспе",pdfFile:"./assets/docs/kirispe.pdf",numPages:1,textHtml:"<p>Кіріспе Бүгінгі таңда әлеуметтік-экономикалық өзгерістерге байланысты қоғамды, оның салаларын, ұйымдарын, мекемелерін және т. б. басқарудың теориялық және қолданбалы аспектілерін зерттеу қажеттілігі артып келеді. Үнемі жетілдіріліп отыратын құзыретті басқарусыз біздің қоғамымызда болып жатқан өзгерістерді еңсеру мүмкін емес. Қазіргі жағдай басқарудың әлеуметтік-психологиялық түйткілдеріне көбірек назар аударуды талап етеді. Ұйымдастырушылық және әлеуметтік-психологиялық процестер мен құбылыстарды басқару, адамдарды нақты басқару, олардың іс-әрекеттері мен мінез-құлқы «Басқару психологиясы» курсында қарастырылатын түйткілдер жиынтығын құрайды. Басқаруды жетілдіру үшін психологиялық білімнің маңызы басқару процесінде адамдардың өзара әрекеттесу динамикасын анықтайтын заңдылықтардың болуымен байланысты, іс - әрекетке жиі әсер ететіндер де осылар. Адамдардың әрекеттері мен бағыныштылығы. Яғни, басқару процесінде тек экономикалық заңдылықтарды ғана емес, сонымен бірге әлеуметтік -психологиялық, сонымен қатар адам мен топтардың психологиясын да ескеру қажет. «Басқару психологиясы» курсы басқа салалардан айырмашылығы сол -зерттелетін, зерделенетін пәні бар. Ол психологиялық ғылымның жиналған ғылыми тәжірбиені басқару практикасында сынап көруге тырысатын саласы болып табылады. Психология адамның ішкі әлемін, оның рухани дамуын зерттейді. Психологиялық ғылым зерттеген құбылыстар әлемі күрделі және алуан түрлі. Оған психикалық рефлексияның формалары, механизмдері мен мазмұны, психикалық процестер, күйлер және жеке тұлғаның қалыптасуы (сезімдер, эмоциялар, әсерлену және т.б.) кіреді. Психологиялық ғылымның бір саласы ретінде – «Басқару психологиясы» - басқарушылық жұмыстың психологиялық мәселелерін, адамдар арасындағы басқарушылық өзара әрекеттесуді, басшының жеке басын, оның әр түрлі салалардағы және әртүрлі деңгейдегі қызметін қарастыруды мақсат етеді, сондай-ақ, тұлғааралық қақтығыстар неге пайда болады, адамдарды тапсырмаларды орындау үшін қалай ұйымдастыруға болады, қызметкерлерді бірлескен іс-әрекет процесіне ынталандырады, ұйымда салауатты әлеуметтік-психологиялық климат құру шарттары қандай және т. б. сияқты сұрақтарға жауап беруге тырысады. «Басқару психологиясы» курсының зерттеу мәні еңбек қызметі кезіндегі адамдардың тұлғааралық және топаралық өзара іс-қимылы процесінде жұмыс істейтін басқарушылық қатынастардың психологиялық аспектілері болып табылады. Басқарудың ұйымдастырушылық және әлеуметтік- психологиялық аспектілері дегеніміз-адамдармен қалай жұмыс істеу, оларға әсер ету, басқару туралы білім. Адамдарды басқару арқылы экономикалық және техникалық объектілерді басқару да жүзеге асырылады. Бұл тұрғыда ұйымдастырушылық-психологиялық процестерді басқару экономикалық және техникалық процестерге әсер етудің бастапқы нүктесі болып табылады. Жалпы психология бойынша белгілі бір білімі бар, бірақ басқару теориясымен таныс емес студенттерге бағдарлану-осы курстың ерекшелігі. Курстың мақсаты – білім алушыларға басқарушылық қызметтің әлеуметтік-психологиялық заңдылықтары туралы жүйелі идеяларды қалыптастыру, менеджер қызметінің құрылымында әлеуметтік-психологиялық білімді қолдану ерекшеліктерін ашу, тиімді басқарудың негізін құрайтын әлеуметтік -психологиялық қағидаттарды талдау дағдыларын дамыту.</p>",rawText:`Кіріспе 
 
Бүгінгі таңда әлеуметтік-экономикалық өзгерістерге байланысты қоғамды, оның 
салаларын, ұйымдарын, мекемелерін және т. б. басқарудың теориялық және қолданбалы 
аспектілерін зерттеу қажеттілігі артып келеді. Үнемі жетілдіріліп отыратын құзыретті басқарусыз 
біздің қоғамымызда болып жатқан өзгерістерді еңсеру мүмкін емес. Қазіргі жағдай басқарудың 
әлеуметтік-психологиялық түйткілдеріне көбірек назар аударуды талап етеді. 
Ұйымдастырушылық және әлеуметтік-психологиялық процестер мен құбылыстарды басқару, 
адамдарды нақты басқару, олардың іс-әрекеттері мен мінез-құлқы «Басқару психологиясы» 
курсында қарастырылатын түйткілдер жиынтығын құрайды. Басқаруды жетілдіру үшін 
психологиялық білімнің маңызы басқару процесінде адамдардың өзара әрекеттесу 
динамикасын анықтайтын заңдылықтардың болуымен байланысты, іс - әрекетке жиі әсер 
ететіндер де осылар. Адамдардың әрекеттері мен бағыныштылығы. Яғни, басқару процесінде 
тек экономикалық заңдылықтарды ғана емес, сонымен бірге әлеуметтік -психологиялық, 
сонымен қатар адам мен топтардың психологиясын да ескеру қажет. «Басқару психологиясы» 
курсы басқа салалардан айырмашылығы сол -зерттелетін, зерделенетін пәні бар. Ол 
психологиялық ғылымның жиналған ғылыми тәжірбиені басқару практикасында сынап көруге 
тырысатын саласы болып табылады. Психология адамның ішкі әлемін, оның рухани дамуын 
зерттейді. Психологиялық ғылым зерттеген құбылыстар әлемі күрделі және алуан түрлі. Оған 
психикалық рефлексияның формалары, механизмдері мен мазмұны, психикалық процестер, 
күйлер және жеке тұлғаның қалыптасуы (сезімдер, эмоциялар, әсерлену және т.б.) кіреді. 
Психологиялық ғылымның бір саласы ретінде – «Басқару психологиясы» - басқарушылық 
жұмыстың психологиялық мәселелерін, адамдар арасындағы басқарушылық өзара 
әрекеттесуді, басшының жеке басын, оның әр түрлі салалардағы және әртүрлі деңгейдегі 
қызметін қарастыруды мақсат етеді, сондай-ақ, тұлғааралық қақтығыстар неге пайда болады, 
адамдарды тапсырмаларды орындау үшін қалай ұйымдастыруға болады, қызметкерлерді 
бірлескен іс-әрекет процесіне  ынталандырады, ұйымда салауатты әлеуметтік-психологиялық 
климат құру шарттары қандай және т. б. сияқты сұрақтарға жауап беруге тырысады. «Басқару 
психологиясы» курсының зерттеу мәні еңбек қызметі кезіндегі адамдардың тұлғааралық және 
топаралық өзара іс-қимылы процесінде жұмыс істейтін басқарушылық қатынастардың 
психологиялық аспектілері болып табылады. Басқарудың ұйымдастырушылық және әлеуметтік-
психологиялық аспектілері дегеніміз-адамдармен қалай жұмыс істеу, оларға әсер ету, басқару 
туралы білім. Адамдарды басқару арқылы экономикалық және техникалық объектілерді 
басқару да жүзеге асырылады. Бұл тұрғыда ұйымдастырушылық-психологиялық процестерді 
басқару экономикалық және техникалық процестерге әсер етудің бастапқы нүктесі болып 
табылады. Жалпы психология бойынша белгілі бір білімі бар, бірақ басқару теориясымен таныс 
емес студенттерге бағдарлану-осы курстың ерекшелігі. Курстың мақсаты – білім алушыларға 
басқарушылық қызметтің әлеуметтік-психологиялық заңдылықтары туралы жүйелі идеяларды 
қалыптастыру, менеджер қызметінің құрылымында әлеуметтік-психологиялық білімді қолдану 
ерекшеліктерін ашу, тиімді басқарудың негізін құрайтын әлеуметтік -психологиялық 
қағидаттарды талдау дағдыларын дамыту.  
 

`},{id:"lecture-1",category:"lecture",shortTitle:"1-дәріс",title:"І Бөлім. Басқару психологиясының теориялық-әдіснамалық негіздері. § 1 Басқару психологиясының пәні мен міндеттері",pdfFile:"./assets/docs/1sabak.pdf",numPages:6,textHtml:`<p>І БӨЛІМ. Басқару психологиясының теориялық-əдіснамалық негіздері § 1 Басқару психологиясының пəні мен əдістері Адам əрекетінде адамдардың бірлескен күш -жігерімен қолданылмайтын сала жоқ. Бұл күш-жігерді реттеу, ұйымдастыру, яғни басқару қажет. Басқару бір уақытта өнер мен жаңа ғылым болып саналады. Ғылым ретінде, басқару өз кезегінде білімдердің жинақталған жиынтығы мен олардың əдістерінің болуын талап етеді. Басқару психологиясы адамдардың басқа адамдарға əсер ету табиғатын, топ жəне жалпы қоғамды түсіну мен олардың механизмдерінің əсер етуі мен оларды жетілдіру құралдарын қамтамасыз етеді. Басқару психологиясының тек өзіне тəн зерттеу пəні бар, ол - басқарушылық процесті ұйымдастыру заңдылықтарын жəне осы процесс кезіндегі адамдар арасындағы пайда болған қатынастарды зерттеп, басқару процесінің əдістемелік негізін анықтайды. Сонымен қатар зерттеу обьектісінің спецификасына сəйкес басқару обьектісіне белсенді əсер ету əдісі мен жүйесін құрастырады, жəне зерттелініп отырған болжауларды анықтайды. Басқару психологиясының ғылым ретіндегі негізгі міндеті - психологиялық құбылыстарды анықтап, оларды жүйеге келтіру, заңдылықтарын ашып,олардың арасындағы байланыс себептерін тəжірибелік қорытындылар мен ұсыныстарды жасауды анықтау. Сонымен қатар, психология ғылым ретінде, басқару жүйесінің жұмыс сапасын тиімді етіп көтеру мақсатында басқарушылық іс-əрекеттің ерекшеліктері мен психологиялық шарттарын талдайды. Басқару процесі мынадай жетекшілік іс-əрекеттің нəтижесінде іске асады, бұлардың негізгі бағыттарына: жүйелік басқарушылық ұйымның өзгеруі мен жағдайларды болжаулары жəне диагностикалау, басқарушылардың іс-əрекет бағдарламасын қалыптастыру, жетекшінің өз іс-əрекетін оңтайлы ету. Басқару психологиясы жетекшінің тұлғалық ерекшеліктерін: оның басқарушылық қажеттіліктері мен қабілеттерін, басқарушылық ойлары мен миссиялырның енуін, индивидуалды басқарушылық концепциясын, сонымен қатар, оның өз ішінде қабылдаған басқару ережелері мен принциптерін зерттейді. Басқарудағы лидерлілік мəселесін айқын анықтау үшін: «басқару», «басшылық», «лидерлілік» ұғымдарының ара-жігін ашып алған жөн. Басқару дегеніміз, көзделген мақсаттарға бағдарланған кез-келген ықпалдарды ұйымдастыру процесі. Кибернетика басқаруға жалпы анықтама береді. Басқару дегеніміз – жүйенің тұтастығын сақтауды қамтамасыз ететін жəне оның қызметінің белгілі бір режимін қолдайтын ұйымдасқан жүйелердің (биологиялық, техникалық, əлеуметтік)</p>
<p>функциясы. Бұдан əрі, басқарудың қағидаттарын, механизмдері мен функцияларын, сондай-ақ тиімді басқарудың ерекшеліктері мен əдістерін əзірлейтін жəне айқындайтын басқару теориясы (менеджмент). Əлеуметтік ғылымдар тобы: əлеуметтану, психология, экономика, құқықтану. Олар үшін басқару əлеуметтік құбылыс ретіндегі зерттеу объектісі болып қабылданады, бірақ осы ғылымдардың əрқайсысы басқаруды талдаудың өзіндік мəнін бөліп алуға тырысады. Ал, басшылық – басқару іс-əрекетінің бір бөлігі ғана. «Басшылық» жəне «лидерлілік» ұғымдарының айырмашылығы кез келген ұйымда ресми жəне бейресми қатынастардың кездесуіне байланысты. Лидерлілік – адамдарға бейресми қатынастардың жүйесі арқылы ықпал ету, ал басшылық ең алдымен ресми қатынастардың нақты құрылымын талап етеді. Басқару психологиясының ғылым ретіндегі негізгі міндеті – психологиялық құбылыстарды анықтап, оларды жүйеге келтіру, заңдылықтарын ашып,олардың арасындағы байланыс себептерін тəжірибелік қорытындылар мен ұсыныстарды жасауды анықтау. Бұл курстың да міндеті «Басқару психологиясы» пəнінің шекараларын белгілеу болып табылады. Ұйымды, персоналды басқарудағы негізгі құрамдауыштар - адамдар (немесе бүкіл бөлімшелер). Жеке тұлғалар басқарудың өзара əрекеттесуінің күрделі жүйесінде ұсынылған, басқару тұрғысынан олар басқарудың субъектісі немесе объект ісі ретінде қарастырыла алады. Жүйелерді, оның ішінде басқаруды зерттеу процесінде кибернетика анықтаған заңдылықтардың бірі- жүйе басқарылатын (басқару объектісі) болып жəне басқаратын (басқару субъектісі) деген ішкі жүйелерге бөлінеді. Егер мұндай бөлініс болмаса, басқару да болмайды. Тірі ағзадағы басқарудың ішкі жүйесі жүйке жүйесі, ал қоғамда басқару жүйесі, құрамына адамдар кіретін басқару аппараты, ұйымда басшы болып табылады. Осылайша, басқару субъектісі дегеніміз -белгілі бір басқару объектісіне, яғни жеке тұлғаға, топқа бағытталған басқарушылық əрекеттің, əсердің тасымалдаушысы. Басқару субъектісі ретінде жеке адам (басшы) да, топ (директорат) да əрекет ете алады. Басқару объектісі дегеніміз-басқару бағытталатын нəрсе, бұл жерде басқару объектісі тағы да жеке тұлға немесе əлеуметтік топ болып табылады. Субъект пен объект қағидаттардан, функциялардан, əдістерден, мақсаттардан тұратын жəне менеджмент сияқты пəннің мəні ретінде əрекет ететін басқару жүйесін құрайды. Басқару объектісі мен субъектісі арасында əдетте басқарушылық қатынастар деп аталатын белгілі бір қатынастар, өзара əрекеттесулер туындайды. Басқарудың өзара іс -қимылы негізінен адамдар (көшбасшы жəне бағынышты) арасында пайда болғандықтан, əлеуметтік басқару туралы сөз етуге болады. Əлеуметтік басқару дегеніміз-көшбасшының тек адамдар тобына (немесе бір адамға) ғана емес, мақсаттарға, нəтижелерге қол жеткізу үшін бірлескен күш-жігерін ұйымдастыру жəне үйлестіру мақсатында</p>
<p>олардың қызметіне əсер етудің үздіксіз процесі. Тағы бір заңдылық – «басқарушылық қызметтің алғашқы, қажетті жəне шешуші сəті» ретіндегі мақсат басқарудың негізі болып табылады. Мақсатты түсіну процесі, оның қажеттілігі мен оған жету мүмкіндігінің негіз демесі мақсат қою деп аталады. Бұл процесте қоғамды (топты) басқару жүйесі əлеуметтік мақсат қою əлеуметтік жүйенің даму процесіне белгілі бір бағдар беретінімен көрініс табатын парктикалық мəніне ие болады. Осыдан келіп басқару көбінесе мақсатты əсер ретінде анықталады. Басқару мазмұны басқару объектісіне мақсатты əсерлерді қолдану арқылы жүйені (ұйымды, қоғамды) реттеуді құрайды. Реттеу процесінде жүйенің белгілі бір мақсаттарға сəйкестігіне қол жеткізіледі. Реттеудің мəні, біріншіден, объектіні белгілі бір күйде ұстаудан тұрады; екіншіден, анықталған 8 мақсатқа сəйкес объектіні бағытталған өзгертуден тұрады. Реттеу сыртқы жəне ішкі реттеу деп бөлінеді. Сыртқы бақылау объектісіне сыртқы əсер ету арқылы жүзеге асырылады, ал ішкі реттеу дегеніміз – бұл жүйенің өзін-өзі басқаруы. Бұл тек əлеуметтік жəне биологиялық жүйелерге ғана тəн. Ол осы жүйенің дербес жұмысымен, ішкі мəселелер бойынша шешімдер қабылдаумен сипатталады. Басқарудың алуан түрлері бар. Ең алдымен, ол қандай жүйеде жүзеге асырылатынына байланысты: - биологиялық; - тірі ағзаларда жүретін процестерді басқару; - техникалық; - машиналар мен құрылғылардағы техникалық процестерді басқару; - əлеуметтік; - қоғамды, əлеуметтік процестерді, адамдардың қызметін басқару деп бөлінеді. Дəл осы соңғысы қоғамдық ғылымдардың зерттеу нысаны болып табылады. Өз кезегінде қоғамды басқару экономикалық басқару, саяси жəне əлеуметтік саланы басқару болып бөлінеді. Экономиканы басқару шеңберінде өнеркəсіпті, ауыл шаруашылығын, құрылысты, қаржыны жəне т. б. басқару көзделеді. Саяси басқару-бұл мемлекеттің ішкі жəне сыртқы саясатына əсер ету. Сайып келгенде, əлеуметтік саланы басқару адам өмірінің еңбек пен өмір сүру, денсаулық пен білім, бос уақыт жəне т. б. жағдайлары жүзеге асырылатын салаларына мақсатты əсер етуді қамтиды. Басқарудың жеке түрлері де бар: ведомстволық -муниципалдық; орталықтандырылған-орталықтандырылмаған; алқалық – дара басшылық; стратегиялық – тактикалық; еріктілік – партисипативтік жəне т. б. Бұл түрлер «Менеджменттен» бастап «Мемлекеттік реттеудің құқықтық аспектілері» сияқты əртүрлі оқу пəндерінде сипатталады. Осылайша, басқару деп сөздің кең мағынасында мəні жүйені тұрақты 9 өзгеріс жағдайында тəртіпке келтіретін, реттейтін, оның тұтастығы мен тұрақтылығын сақтайтын, сондай-ақ оның дамуына ықпал ететін күрделі</p>
<p>ұйымдастырылған жүйелерге (қоғамға, ұйымға, топқа) тəн қасиет де п түсінуге болады. Басқару бір уақытта екі түрлі қызмет атқарады: өнер жəне ғылым. Г. Кунц пен С. О. Доннел зерттеушілердің пікірінше , егер барлық қоғамдағы топтық серіктестік тиімді əрі маңызды нəтижені көрсетсе, онда басқару- барлық өнерден де маңызды екендігін батыл айтуға болады. Басқару бұл ең алдымен өнер болып табылады. Олардың тұжырымдарына сəйкес: «барлық шынайы ситуацияда бұл ғылымды қолдану мəні болатын, басқару процесі өнер болып табылады». Дегенмен, бұл өнер мынадай ғылымға сүйенеді, яғни: «Басқару бойынша іс-əрекет өнер болғанымен де, оларды иегертін адамдар, бұл өнер ғылымының негізінде жатқандарды түсініп жəне қолданса ғана, жақсы нəтижеге жетеді». Тəжірибелік тұрғыда барлық адамдар іс-əрекетінің сферасында ғылым мен өнер бірін бірі толықтырып тұрады. Басқаруда, жекелей адамдардың ұсыныстарының жауабы, топтық іс -əрекетте барлық нəтижелердің шешімдері варианттарынан ерекшеленсе, жəне саналы компромиссті таба білсе, ол басқарушы өнерінің көрінісі болып табылады. Бұл өнерді кімде- кім иегере алмайтындығына қарамастан, оның негізгі басқару өнерін білу, маңызды принциптері мен əдістерін қабылдай білуге ұмтылу - барлық деңгейдегі мамандар мен жетекшілердің міндеті. Жетекші көндіру, сендіру, диалог, қарым-қатынас өнерінің мастері,ащы біркелкі емес ойлайтын жəне барлық білім сферасын жан-жақты білетін тұлға болу керек. Дегенмен, ол ең алдымен адамдармен жұмыс жасайтын болғандықтан, адами инженерияның барлық қыр-сырын біліп, кең ауқымды гуманитарлық жəне психологиялық білімді игеру керек. XX ғасырдың басына дейін басқару ғылыми зерттеу аймағында жекелей болып саналмады. 1911 жылы Ф.У.Тейлордың «Ғылыми менеджмент принциптері». XX ғасырдың 20- жылдарында атақты металлургия компаниясын басқарушы, француз инженері А.Фейолдың а рқасында басқаруды іс -əрекеттің ерекше спецификасы деп есептеді. 1885-1920жж. Ғылыми менеджмент мектебінің өкілі Фредерик Уинслоу Трейлор: «Өндірісті ғылым тұрғысынан басқаруға болады» - деген пікір айтты. Еңбек шығынының реттелуі мен бағалануын, өндірістік басқару принциптерін қалыптастырады. Жоғары еібекақы мен төмен өнім шығыны басқарудың ұтымды əдісі. Өз еңбектерінде «адами фактор» ұығымын енгізді. Ф.Тейлор теориясын Гаррингтон Эмирсон, Генри Форд, Френк Гилберт, Лилиан Гилберт жəне т.б. ғалымдар өз еңбектерінде жүзеге асырды. 1940 жылы «Адамдық қарым- қатынас» мектебі Мамандық пен кəсіби қабілеттілік аймағында көп үлес қосты жəне мамандықты меңгеру психологиясының бағдарламасын ұсынды. Бұл бағдарламада жетекшілер қызметі туралы, психолог - мамандардың жұмысын бақылау экспериментальды зерттеу, іскер жəне</p>
<p>қолынан келмейтін жұмысшылардың еңбектерін бақылау туралы көрсетілген. К.Арджайрис, У.Дискри,Р.Лайкерт ұйымдасу əрекетінің маңызын дəлелдеп берді. Басқарудың психологияға бірігуі нəтижесінде – «басқару психологиясы» деп аталатын қосалқы пəнаралық ғылым пайда болды. Сəйкесінше, басқару психологиясының пəні - еңбек іс-əрекетінің психофизиологиялық ерекшеліктері, ақпаратты өңдеудің психологиялық ерекшеліктер, адамның адамды қабылдауының механизмдері; - басқа адамдардың бір –біріне əсер ету механизмдерін, еңбек коллективінің қалыптасуының психологиялық ерекшеліктері; - олардың арасындағы тұлғааралық қатынастарды, басқарушылық шешімдерді қабылдаудың психологиялық ерекшеліктері; -жалпы басқарушылық іс-əрекеттің психологиялық факторлары жатады. Еңбек процесі кезіндегі тұлғаның өзіндік жетілуі мен өзіндік дамуы. Басқару психологиясының пəніне басқару жағдайы көзқарасымен адамдардың қарым-қатынас мəселесі мен өзара əрекеттері келесідей болып табылады: Еңбек ұжымындағы топтық процесі мен олардың реттелуі Психологиялық тиімділік көзқарасымен басқарушылық іс-əрекет пен оның ұйымдастырылуы. Басқару психологиясының негігі əдістері бақылау жəне эксперимент. Бақылау өз сипаты мен мəніне байланысты- шынайылылықты бейнелейтін қиын обьективті психологиялық процесс. Бақылауға ақпараттар жиынтығы ретінде əртүрлі жағдайлар қатысады. Біріншіден, жоспарланған зерттеуді нақтылау бағытында алдыңғы материалд ы алу. Зерттелініп отырған құбылысты нақтырақ кеңейту, іс-əрекет етуші тұлғаны анықтауда, маңызды жағдайлардың көрінуінде себеп болғанда, бақылаудың мақсаты іске асады. Екіншіден, басқа бөтен психологиялық ақпараттар жетіспегенде, бақылау шартардың өзіндік əдісі ретінде қолданылады. Бақылау кезінде көрінетін, мынадай маңызды элементтердің тізімдері кездеседі: а) бақыланушылар, б) жағдайлық, в) топтың іс-əрекет мақсаты, г) əлеуметтік мінез-құлық, д) жиілік пен ұзақтығы. Эксперимент ақпарат жинауда ең қиын меңгерілетін жəне өзіндік бейнелі қатарға жататын əдіс. Экспериментті іске асыру өте мардымды ақпараттарды алуға мүмкіндік береді. Мысалға, еңбек өнімін өндіруді жоғарлату мақсатында жаңа моралдық жəне материалдық стимулдардың түрлерін қолданды. Бастыққа эксперимент құнды ақпаратты алу мен белгілі бір ситуацияны ойнауға мүмкіндік алу үшін керек. Бұны өткізудің негізгі мақсаты болып- гипотезаларды тексеру, əртүрлі басқарушылық шешімдерді тəжірибеге нəтиже береді. Психологтардың ойынша, экспериментті жүр гізу мен дайындалу келесідей сұрақтардың шешімін табуға мүмкіндік береді: • эксперимент мақсатын анықтау;</p>
<p>• эксперименталды жəне бақылау тобына қатысатын обьектіні таңдау; • эксперимент пəнін анықтау; • бақылау, факторлық жəне нейтралды қасиеттерді таңдау; • эксперимен шарттарын анықтау жəне эксперименттік жағдайларды қалыптастыру; • міндеттерді анықтау жəне гипотезаларды қалыптастыру; • эксперимент ағымын бақылау тəсілі мен индикаторларды таңдау; • нəтижелерін бекіту əдісін анықтау. Басқару психологиясы практикалық психологияның бір саласы ретінде басқарушылық қызметті зерттейді. Басқару психологиясының заңдары тұлғааралық қатынастарда жəне топтық қарым -қатынаста өзара əрекеттесуде көрінеді жəне біз оларды білетінімізге немесе білмейтінімізге байланысты кез-келген заң сияқты əрекет етеді. И. П. Чередниченко, Н. В. Тельный басқару психологиясының жəне тұтастай басқару қызметінің негізгі заңдылықтарын тұжырымдады. Басқару жəне басқару қызметінің психологиясының негізгі заңдары: • Рекреациялық белгісіздік заңы • Өзара қабылдаудың адекватсыздық заңы • Өзін-өзі бағалаудың адекватсыздық заңы • Ақпаратты бұрмалау заңы • Өзін-өзі сақтап қалу заңы • Өтемақы заңы Осыған сəйкес, басқару процесінде еңбек коллективінің психологиялық заңдылықтар мен əлеуметтік даму есібін ескере отырып, адамдарға индивидуалды амал табатын, басқару процесін орната білетін біліктілігі болғанда басшының іс-əрекет нəтижесі анықталады, ал бұл қазіргі басқару психологиясынның жетістігіне негізделеді. Бақылау сұрақтары: 1. Басқару жүйесінде барлық обьектілер өзінің жұмыс бағытын, мақсатын, ұйымдастыру формаларын анықтаңыз 2. Басқару жүйесі өзіндік сипатына қарай неше топқа бөлінеді? 3. «Менеджер», «өнер», «басқару» сөздерінің мазмұнын ашып көрсет.</p>`,rawText:`І БӨЛІМ. Басқару психологиясының теориялық-əдіснамалық 
негіздері 
§ 1 Басқару психологиясының пəні мен əдістері  
 
Адам əрекетінде адамдардың бірлескен күш -жігерімен 
қолданылмайтын сала жоқ. Бұл күш-жігерді реттеу, ұйымдастыру, яғни 
басқару қажет. Басқару бір уақытта өнер мен жаңа ғылым болып саналады. 
Ғылым ретінде, басқару өз кезегінде білімдердің жинақталған жиынтығы 
мен олардың əдістерінің болуын талап етеді. Басқару психологиясы 
адамдардың басқа адамдарға əсер ету табиғатын, топ жəне жалпы қоғамды 
түсіну мен олардың механизмдерінің əсер етуі мен оларды жетілдіру 
құралдарын қамтамасыз етеді.  
Басқару психологиясының тек өзіне тəн зерттеу пəні бар, ол - 
басқарушылық процесті ұйымдастыру заңдылықтарын жəне осы процесс 
кезіндегі адамдар арасындағы пайда болған қатынастарды  зерттеп, басқару 
процесінің əдістемелік негізін анықтайды. Сонымен қатар зерттеу 
обьектісінің спецификасына сəйкес басқару обьектісіне белсенді əсер ету 
əдісі мен жүйесін құрастырады, жəне зерттелініп отырған болжауларды 
анықтайды.  
Басқару психологиясының ғылым ретіндегі негізгі міндеті - 
психологиялық құбылыстарды анықтап, оларды жүйеге келтіру, 
заңдылықтарын ашып,олардың арасындағы байланыс себептерін 
тəжірибелік қорытындылар мен ұсыныстарды жасауды анықтау. Сонымен 
қатар, психология ғылым ретінде, басқару жүйесінің жұмыс сапасын тиімді  
етіп көтеру мақсатында басқарушылық іс-əрекеттің ерекшеліктері мен 
психологиялық шарттарын талдайды.  
Басқару процесі мынадай жетекшілік іс-əрекеттің нəтижесінде іске 
асады, бұлардың негізгі бағыттарына: жүйелік басқарушылық ұйымның 
өзгеруі мен жағдайларды болжаулары жəне диагностикалау, 
басқарушылардың іс-əрекет бағдарламасын қалыптастыру, жетекшінің өз 
іс-əрекетін оңтайлы ету. 
Басқару психологиясы жетекшінің тұлғалық ерекшеліктерін: оның 
басқарушылық қажеттіліктері мен қабілеттерін, басқарушылық ойлары мен 
миссиялырның енуін, индивидуалды басқарушылық концепциясын, 
сонымен қатар, оның өз ішінде қабылдаған басқару ережелері мен 
принциптерін зерттейді.  
Басқарудағы лидерлілік мəселесін айқын анықтау үшін: «басқару», 
«басшылық», «лидерлілік» ұғымдарының ара-жігін ашып алған жөн.  
Басқару дегеніміз, көзделген мақсаттарға бағдарланған кез-келген 
ықпалдарды ұйымдастыру процесі. Кибернетика басқаруға жалпы 
анықтама береді. Басқару дегеніміз – жүйенің тұтастығын сақтауды 
қамтамасыз ететін жəне оның қызметінің белгілі бір режимін қолдайтын 
ұйымдасқан жүйелердің (биологиялық, техникалық, əлеуметтік) 

функциясы. Бұдан əрі, басқарудың қағидаттарын, механизмдері мен 
функцияларын, сондай-ақ тиімді басқарудың ерекшеліктері мен əдістерін 
əзірлейтін жəне айқындайтын басқару теориясы (менеджмент). Əлеуметтік 
ғылымдар тобы: əлеуметтану, психология, экономика, құқықтану. Олар 
үшін басқару əлеуметтік құбылыс ретіндегі зерттеу объектісі болып 
қабылданады, бірақ осы ғылымдардың əрқайсысы басқаруды талдаудың 
өзіндік мəнін бөліп алуға тырысады. 
Ал, басшылық – басқару іс-əрекетінің бір бөлігі ғана. «Басшылық» 
жəне «лидерлілік» ұғымдарының айырмашылығы кез келген ұйымда ресми 
жəне бейресми қатынастардың кездесуіне байланысты.  
Лидерлілік – адамдарға бейресми қатынастардың жүйесі арқылы 
ықпал ету, ал басшылық ең алдымен ресми қатынастардың нақты 
құрылымын талап етеді. 
Басқару психологиясының ғылым ретіндегі негізгі міндеті – 
психологиялық құбылыстарды анықтап, оларды жүйеге келтіру, 
заңдылықтарын ашып,олардың арасындағы байланыс себептерін 
тəжірибелік қорытындылар мен ұсыныстарды жасауды анықтау.  Бұл 
курстың да міндеті «Басқару психологиясы» пəнінің шекараларын белгілеу 
болып табылады. Ұйымды, персоналды басқарудағы негізгі 
құрамдауыштар - адамдар (немесе бүкіл бөлімшелер). Жеке тұлғалар 
басқарудың өзара əрекеттесуінің күрделі жүйесінде ұсынылған, басқару 
тұрғысынан олар басқарудың субъектісі немесе объект ісі ретінде 
қарастырыла алады. Жүйелерді, оның ішінде басқаруды зерттеу процесінде 
кибернетика анықтаған заңдылықтардың бірі- жүйе басқарылатын (басқару 
объектісі) болып жəне басқаратын (басқару субъектісі) деген ішкі 
жүйелерге бөлінеді. Егер мұндай бөлініс болмаса, басқару да болмайды. 
Тірі ағзадағы басқарудың ішкі жүйесі жүйке жүйесі, ал қоғамда басқару 
жүйесі, құрамына адамдар кіретін басқару аппараты, ұйымда басшы болып 
табылады. Осылайша, басқару субъектісі дегеніміз -белгілі бір басқару 
объектісіне, яғни жеке тұлғаға, топқа бағытталған басқарушылық əрекеттің, 
əсердің тасымалдаушысы. Басқару субъектісі ретінде жеке адам (басшы) да, 
топ (директорат) да əрекет ете алады. Басқару объектісі дегеніміз-басқару 
бағытталатын нəрсе, бұл жерде басқару объектісі тағы да жеке тұлға немесе 
əлеуметтік топ болып табылады.  Субъект пен объект қағидаттардан, 
функциялардан, əдістерден, мақсаттардан тұратын жəне менеджмент 
сияқты пəннің мəні ретінде əрекет ететін басқару жүйесін құрайды. Басқару 
объектісі мен субъектісі арасында əдетте басқарушылық қатынастар деп 
аталатын белгілі бір қатынастар, өзара əрекеттесулер туындайды. 
Басқарудың өзара іс -қимылы негізінен адамдар (көшбасшы жəне 
бағынышты) арасында пайда болғандықтан, əлеуметтік басқару туралы сөз 
етуге болады. Əлеуметтік басқару дегеніміз-көшбасшының тек адамдар 
тобына (немесе бір адамға) ғана емес, мақсаттарға, нəтижелерге қол жеткізу 
үшін бірлескен күш-жігерін ұйымдастыру жəне үйлестіру мақсатында 

олардың қызметіне əсер етудің үздіксіз процесі. Тағы бір заңдылық – 
«басқарушылық қызметтің алғашқы, қажетті жəне шешуші сəті» ретіндегі 
мақсат басқарудың негізі болып табылады. Мақсатты түсіну процесі, оның 
қажеттілігі мен оған жету мүмкіндігінің негіз демесі мақсат қою деп 
аталады. Бұл процесте қоғамды (топты) басқару жүйесі əлеуметтік мақсат 
қою əлеуметтік жүйенің даму процесіне белгілі бір бағдар беретінімен 
көрініс табатын парктикалық мəніне ие болады. Осыдан  келіп басқару 
көбінесе мақсатты əсер ретінде анықталады. Басқару мазмұны басқару 
объектісіне мақсатты əсерлерді қолдану арқылы жүйені (ұйымды, қоғамды) 
реттеуді құрайды. Реттеу процесінде жүйенің белгілі бір мақсаттарға 
сəйкестігіне қол жеткізіледі. Реттеудің мəні, біріншіден, объектіні белгілі 
бір күйде ұстаудан тұрады; екіншіден, анықталған 8 мақсатқа сəйкес 
объектіні бағытталған өзгертуден тұрады. Реттеу сыртқы жəне ішкі реттеу 
деп бөлінеді. Сыртқы бақылау объектісіне сыртқы əсер ету арқылы жүзеге 
асырылады, ал ішкі реттеу дегеніміз – бұл жүйенің өзін-өзі басқаруы. Бұл 
тек əлеуметтік жəне биологиялық жүйелерге ғана тəн. Ол осы жүйенің 
дербес жұмысымен, ішкі мəселелер бойынша шешімдер қабылдаумен 
сипатталады. Басқарудың алуан түрлері бар. Ең алдымен, ол қандай жүйеде 
жүзеге асырылатынына байланысты: 
- биологиялық;  
- тірі ағзаларда жүретін процестерді басқару;  
- техникалық;  
- машиналар мен құрылғылардағы техникалық процестерді басқару;  
- əлеуметтік;  
- қоғамды, əлеуметтік процестерді, адамдардың қызметін басқару деп 
бөлінеді.   
Дəл осы соңғысы қоғамдық ғылымдардың зерттеу нысаны болып 
табылады. Өз кезегінде қоғамды басқару экономикалық басқару, саяси жəне 
əлеуметтік саланы басқару болып бөлінеді. Экономиканы басқару 
шеңберінде өнеркəсіпті, ауыл шаруашылығын, құрылысты, қаржыны жəне 
т. б. басқару көзделеді. Саяси басқару-бұл мемлекеттің ішкі жəне сыртқы 
саясатына əсер ету. Сайып келгенде, əлеуметтік саланы басқару адам 
өмірінің еңбек пен өмір сүру, денсаулық пен білім, бос уақыт жəне т. б. 
жағдайлары жүзеге асырылатын  салаларына мақсатты əсер етуді қамтиды. 
Басқарудың жеке түрлері де бар: ведомстволық -муниципалдық; 
орталықтандырылған-орталықтандырылмаған; алқалық – дара басшылық; 
стратегиялық – тактикалық; еріктілік – партисипативтік жəне т. б. Бұл 
түрлер «Менеджменттен» бастап «Мемлекеттік реттеудің құқықтық 
аспектілері» сияқты əртүрлі оқу пəндерінде сипатталады. Осылайша, 
басқару деп сөздің кең мағынасында мəні жүйені тұрақты 9 өзгеріс 
жағдайында тəртіпке келтіретін, реттейтін, оның тұтастығы мен 
тұрақтылығын сақтайтын, сондай-ақ оның дамуына ықпал ететін күрделі 

ұйымдастырылған жүйелерге (қоғамға, ұйымға, топқа) тəн қасиет де п 
түсінуге болады. 
Басқару бір уақытта екі түрлі қызмет атқарады: өнер жəне ғылым. 
Г. Кунц пен С. О. Доннел зерттеушілердің пікірінше , егер барлық 
қоғамдағы топтық серіктестік тиімді əрі маңызды нəтижені көрсетсе, онда 
басқару- барлық өнерден де маңызды екендігін батыл айтуға болады. 
Басқару бұл ең алдымен өнер болып табылады. Олардың тұжырымдарына 
сəйкес: «барлық шынайы ситуацияда бұл ғылымды қолдану мəні болатын, 
басқару процесі өнер болып табылады». Дегенмен, бұл өнер мынадай 
ғылымға сүйенеді, яғни: «Басқару бойынша іс-əрекет өнер болғанымен де, 
оларды иегертін адамдар, бұл өнер ғылымының негізінде жатқандарды 
түсініп  жəне қолданса ғана, жақсы нəтижеге жетеді».  
Тəжірибелік тұрғыда барлық адамдар іс-əрекетінің сферасында  ғылым 
мен өнер бірін бірі толықтырып тұрады. Басқаруда, жекелей адамдардың 
ұсыныстарының жауабы, топтық іс -əрекетте барлық нəтижелердің 
шешімдері варианттарынан  ерекшеленсе, жəне саналы компромиссті таба 
білсе, ол басқарушы өнерінің көрінісі болып табылады. Бұл өнерді кімде-
кім иегере алмайтындығына қарамастан, оның негізгі басқару өнерін білу, 
маңызды принциптері мен əдістерін қабылдай білуге ұмтылу - барлық 
деңгейдегі мамандар мен жетекшілердің міндеті. Жетекші көндіру, сендіру, 
диалог, қарым-қатынас өнерінің мастері,ащы біркелкі емес ойлайтын жəне 
барлық білім  сферасын жан-жақты білетін тұлға болу керек. Дегенмен, ол 
ең алдымен адамдармен жұмыс жасайтын болғандықтан,  адами 
инженерияның барлық қыр-сырын біліп, кең ауқымды гуманитарлық жəне 
психологиялық білімді игеру керек. XX ғасырдың басына дейін басқару 
ғылыми зерттеу аймағында жекелей болып саналмады.  1911 жылы 
Ф.У.Тейлордың «Ғылыми менеджмент принциптері». XX ғасырдың 20-
жылдарында атақты металлургия компаниясын басқарушы, француз 
инженері А.Фейолдың а рқасында басқаруды іс -əрекеттің ерекше 
спецификасы деп есептеді. 1885-1920жж. Ғылыми менеджмент мектебінің 
өкілі Фредерик Уинслоу Трейлор: «Өндірісті ғылым тұрғысынан басқаруға 
болады» - деген пікір айтты. Еңбек шығынының реттелуі мен бағалануын, 
өндірістік басқару принциптерін қалыптастырады. Жоғары еібекақы мен 
төмен өнім шығыны басқарудың ұтымды əдісі. Өз еңбектерінде «адами 
фактор» ұығымын енгізді. Ф.Тейлор теориясын Гаррингтон Эмирсон, 
Генри  Форд, Френк Гилберт, Лилиан Гилберт жəне т.б. ғалымдар өз 
еңбектерінде жүзеге асырды. 1940 жылы «Адамдық қарым- қатынас» 
мектебі 
 Мамандық пен кəсіби қабілеттілік аймағында көп үлес қосты жəне 
мамандықты меңгеру психологиясының бағдарламасын ұсынды. 
Бұл бағдарламада жетекшілер қызметі туралы, психолог - 
мамандардың жұмысын бақылау экспериментальды зерттеу, іскер жəне 

қолынан келмейтін жұмысшылардың еңбектерін бақылау туралы 
көрсетілген. 
К.Арджайрис, У.Дискри,Р.Лайкерт ұйымдасу əрекетінің маңызын 
дəлелдеп берді. Басқарудың психологияға бірігуі нəтижесінде – «басқару 
психологиясы» деп аталатын қосалқы пəнаралық ғылым пайда болды. 
Сəйкесінше, басқару психологиясының пəні  - еңбек іс-əрекетінің 
психофизиологиялық ерекшеліктері, ақпаратты өңдеудің психологиялық 
ерекшеліктер, адамның адамды қабылдауының механизмдері; - басқа 
адамдардың бір –біріне əсер ету механизмдерін, еңбек коллективінің 
қалыптасуының психологиялық ерекшеліктері; - олардың арасындағы 
тұлғааралық қатынастарды, басқарушылық шешімдерді қабылдаудың 
психологиялық ерекшеліктері;  -жалпы басқарушылық іс-əрекеттің 
психологиялық факторлары жатады. Еңбек процесі кезіндегі тұлғаның 
өзіндік жетілуі мен өзіндік дамуы. Басқару психологиясының пəніне 
басқару жағдайы көзқарасымен адамдардың қарым-қатынас мəселесі мен 
өзара əрекеттері келесідей болып табылады:  
Еңбек ұжымындағы топтық процесі мен олардың реттелуі 
Психологиялық тиімділік көзқарасымен басқарушылық іс-əрекет пен 
оның ұйымдастырылуы.  
Басқару психологиясының негігі əдістері бақылау жəне эксперимент. 
Бақылау өз сипаты мен мəніне байланысты- шынайылылықты бейнелейтін 
қиын обьективті психологиялық процесс. Бақылауға ақпараттар жиынтығы 
ретінде əртүрлі жағдайлар қатысады. Біріншіден, жоспарланған зерттеуді 
нақтылау бағытында алдыңғы материалд ы алу. Зерттелініп отырған 
құбылысты нақтырақ кеңейту, іс-əрекет етуші тұлғаны анықтауда, маңызды 
жағдайлардың көрінуінде себеп болғанда, бақылаудың мақсаты іске асады. 
Екіншіден, басқа бөтен психологиялық ақпараттар жетіспегенде, бақылау 
шартардың өзіндік əдісі ретінде қолданылады. Бақылау кезінде көрінетін, 
мынадай маңызды элементтердің тізімдері кездеседі: а) бақыланушылар, б)  
жағдайлық, в) топтың іс-əрекет мақсаты, г) əлеуметтік мінез-құлық, д) 
жиілік пен ұзақтығы.  
Эксперимент ақпарат жинауда ең қиын меңгерілетін жəне өзіндік 
бейнелі қатарға жататын əдіс. Экспериментті іске асыру өте мардымды 
ақпараттарды алуға мүмкіндік береді. Мысалға, еңбек өнімін өндіруді 
жоғарлату мақсатында жаңа моралдық жəне материалдық стимулдардың 
түрлерін қолданды. Бастыққа эксперимент құнды ақпаратты алу мен белгілі 
бір ситуацияны ойнауға мүмкіндік алу үшін керек. Бұны өткізудің негізгі 
мақсаты болып- гипотезаларды тексеру, əртүрлі басқарушылық 
шешімдерді тəжірибеге нəтиже береді. 
Психологтардың ойынша, экспериментті жүр гізу мен дайындалу 
келесідей сұрақтардың шешімін табуға мүмкіндік береді:  
• эксперимент мақсатын анықтау;  

• эксперименталды жəне бақылау тобына қатысатын обьектіні 
таңдау; 
• эксперимент пəнін анықтау; 
• бақылау, факторлық жəне нейтралды қасиеттерді таңдау; 
• эксперимен шарттарын анықтау жəне эксперименттік 
жағдайларды қалыптастыру;  
• міндеттерді анықтау жəне гипотезаларды қалыптастыру; 
• эксперимент ағымын бақылау тəсілі мен индикаторларды 
таңдау;  
• нəтижелерін бекіту əдісін анықтау. 
Басқару психологиясы практикалық психологияның бір саласы ретінде 
басқарушылық қызметті зерттейді. Басқару психологиясының заңдары 
тұлғааралық қатынастарда жəне топтық қарым -қатынаста өзара 
əрекеттесуде көрінеді жəне біз оларды білетінімізге немесе білмейтінімізге 
байланысты кез-келген заң сияқты əрекет етеді. 
И. П. Чередниченко, Н. В. Тельный басқару психологиясының жəне 
тұтастай басқару қызметінің негізгі заңдылықтарын тұжырымдады. 
Басқару жəне басқару қызметінің психологиясының негізгі заңдары: 
• Рекреациялық белгісіздік заңы 
• Өзара қабылдаудың адекватсыздық заңы 
• Өзін-өзі бағалаудың адекватсыздық заңы 
• Ақпаратты бұрмалау заңы 
• Өзін-өзі сақтап қалу заңы 
• Өтемақы заңы 
Осыған сəйкес, басқару процесінде еңбек коллективінің 
психологиялық заңдылықтар мен əлеуметтік даму есібін ескере отырып, 
адамдарға индивидуалды амал табатын, басқару процесін орната білетін 
біліктілігі болғанда басшының іс-əрекет нəтижесі анықталады, ал бұл 
қазіргі басқару психологиясынның жетістігіне негізделеді. 
Бақылау сұрақтары:  
1. Басқару жүйесінде барлық обьектілер өзінің жұмыс бағытын, 
мақсатын, ұйымдастыру формаларын анықтаңыз 
2. Басқару жүйесі өзіндік сипатына қарай неше топқа бөлінеді? 
3. «Менеджер», «өнер», «басқару» сөздерінің мазмұнын ашып көрсет. 
 

`},{id:"lecture-2",category:"lecture",shortTitle:"2-дәріс",title:"§ 2 Басқарудың психологиялық теориясы",pdfFile:"./assets/docs/2sabak.pdf",numPages:22,textHtml:`<h3 class="chapter-subheading">§ 2 Басқарудың психологиялық теориясы Адамзат қызметінінің көптеген саласында ғылым мен өнер бірінен-бірі оңашаланбай, керісінше бірін-бірі толықтырады. Басқару бір мезетте көне өнер болыпта, жаңа ғылым болып та есептеледі. Басқару ұйымның мақсаттарына қол жеткізуге бағытталған, үйлестірілген шаралардың жиынтығы деп саналады. Кейде «басқару» түсінігінің синонимдері ретінде «менеджмент» жəне «жетекшілік» ұғымдары қолданылады, алайда олардың мазмұнында əлдебір айырмашылық бар. Менеджемент ұғымының кең етек алған түсініктемелері келесілерде көрсетілген: менеджмент – алуан-түрлі ұйымдардағы адамдарға жетекшілік ету бойынша қызмет, іс-əрекет түрі. Менеджмент – бұл осы қызметті жүзеге асыруға көмек беретін, адам білімінің саласы. Соңғысы, менеджмент – менеджерлерден жинақталған ретінде – бұл белгілі бір адамдар санаты, басқару бойынша жұмысты іске асыратындардың əлеуметтік қабаты. Жапониядағы менеджмент жүйесінің қалыптасуы: 1) Жапондықтардың психологиясы олардың мəдениетімен байланысты. Жапония менеджменті əлеуметтік құндылықта р мен мəдени дəстүрлерге негізделген. 2) Жапон менеджерлері өндірісті басқарудың өз құрылымын америка жəне де басқа əлем менеджментінен алған теория мен практикасы жүзінде жасап шығарды. 3) Қазіргі əлемде ең жақсы менеджерлер жапондықтар болып есептеледі. Жапон мəдениеті міндет, қызметтестік жəне топшылдық құндылықтарын басты деп санайды. 4) Жапон тілінде ағылшын баламасы «эмэ» сөзі көбінесе адамдардың өзі қарайтын тобынан тəуелді екенін түсіндіреді. Əрбір жапондық өзін сыйлап құрметтегенді, жақсы көргенді қалайды. Америка ғалымы И. Олстол жапон компанияларын зерттеп менеджменттің бес басты ұстанымын бөліп көрсетті: Бірінші ұстаным жапон жұмысшылары өз міндеттерін орындаумен қатар оны жетілдіруге тиіс деп есептейді. Екінші ұстаным бойынша жұмысшы жұмысын жақсы атқаруға талпынуы. Ол жұмысын атқара отырып оны дамытуға үлес қосып материалды жəне рухани рахаттанады. Жапон менеджерлары жұмысшы еркін шектемеді. Үшінші ұстаным жұмыс орынын отбасына айналдыру. Жапондықтар жалдаушылар мен жалданушылар бір тұтас деп есептейді. Ол ұстаным «эмэ» түсінігін қанағаттандырып, адамдар арасындағы қолдау мен көмекті нығайтады.</h3>
<p>Төртінші ұстаным бойынша топ жеке адамнан құнды. Олардың ойынша адам эгоист болмауы керек, өзі өмір сүретін топқа ри зашылық білдіреді. Бұл Конфуций ілімінің ұстанымы. Бесінші ұстаным бойынша өндірістік серіктестік басты қағида. Жапон менеджерлері жұмысшыларды өздерінің жетістікке жету себепкері деп санайды. Серіктестікке бағытталу «учива» терминімен сипатталады. Ресейде менеджмент жүйесінің қалыптасуы. Ресейде менеджмент термині тек ХХ ғасырдың 60 жылдары ғана енді. Бұл жағдай нарықтық экономиканың қайта құрылуы кезеңінде болды. Менеджменттің Ресейде етек жаюына А. К. Гастев пен Л. М. Керженцев көп үлес қосты. 20 жылы Гастевтің қолдауымен психологиялық зертхана Ресейде алғаш ашылды. 50- жылдары академик А. И. Бергтың арқасында кибернетика саласы дамып, адам еңбегін көтеруге жағдай жасалды. 60 жылдары басқару ғылымы түсінігі пайда болып кеңінен зерттелді. Экономиканы басқару дамыды. 90- жылдары Ресейде экономика тағы өзгеріске ұшырады. Олар жекеше басқарудан нарықтық экономикаға көшті. «Басқару» түсінігі «менеджмент» ұғымына қарағанда едəуір кең ауқымды болып табылады. Ағылшын тілінің оксфордтық сөздігінен төмендегі анықтамаларын көруге болады: 1) Адамдарға жүгіну тəсілі, мəнері. 2) Басқару билігі мен өнері. 3) Айрықша қабілеттілік жəне əкімшілік машықтар. 4) Басқару органы, əкімшілік бірлік. Психоанализ теориясы. Ең бірінші адам ынтасына ғылыми зерттеу жүргізген, психоанализ ғылымының негізін салушы австриялық психиатр – дəрігер Зигмунд Фреид болды. Ол адамның əрбір психикалық құбылысы арнайы себепке негізделген жəне оның ессіз үрдістерінен адамның өзін ұстауы тəуелді деп есептеген. Эростың энергиясы «либидо», ал танатос энергиясы «мортидо» деп аталады. Осы күштер адамның белсенділігін анықтайды. Адамның тəртібі екі инстинктті ұмтылушылықтармен түсіндіріледі: өмірге ұмтылыс (эрос) жəне жəне өлімге ұмтылыс (танатос). Олардың əрбірі жойқын күшке ие. Үйрету теориясы. И. П. Павлов, Д. Б. Уотсон, Б. Ф. Скиннер жұмыстары мадақтау мен жазалау жүйелеріне негізделіп (үйрету теориясы) орындаушының əрекеттерді ақылмен шешу қабілеті жəне басшы мен бағынушы арасындағы кері байл анысқа құрылу қажеттілігімен анықталады. Үйрету теориясы негізінде рефлекс ұғымы, яғни тұлғаның сыртқы құбылыстарға жауап беруі жатады. Рефлекстер туылған (шартсыз) жəне тəжірибеден жинақталатын шартсыз рефлекстер болып бөлінеді. Туылған рефлекстер ессіз а кты кезінде сезімнің, эмоциялардың, қалаулардың қиын толқынымен байқалып, шешім қабылдау мен еріктілік көрсететін кезде байқалады . Шартты рефлекс осы теорияны жақтаушылардың көзқарасы бойынша ойлау мен өзін ұстаудың</p>
<p>стереотипын құрап, адамның алға ұмтылушылық жүйесінің бөлігі болып табылады. Белгілі тұлға теориясымен айналысушы неміс – америка психологы К. Левин басқару үлгісінің концепциясын құрастыры п сипаттады. Ол тəжірибе жүзіндегі зерттеулері бойынша 3 негізгі үлгіні бөліп көрсетті: -Авторитарлық ( директивті) -Демократиялық ( əріптестік) - Нейтралды (босəурелік) Э.Берн бойынша транзакциялық талдау теориясы. Эрик Берн бойынша транзакциялық талдаудың мəні. Психологиядағы транзакциялық талдау (ТА) – бұл жеке адамның немесе топтың мінез- құлқын сипаттауға жəне талдауға мүмкіндік беретін əдіс. Басқаша айтқанда, транзакциялық немесе трансакттық талдау деп аталады. Ол күрделі психологиялық проблемаларды емдеу үшін қолданылады. Оның авторы- психотерапевт Эрик Берн. Эрик Леннард Берн (шын аты: Леонард Бернштейн) - американдық психолог жəне психиатр. Эрик Берн 1910 ж. 10 мамырда Монреальда (Канада) дүниеге келді. Оның əкесі тəжірибелі терапевт болды, ол науқастарын емдеу барысында ұлын жиі алып жүрді. Берннің анасы кəсіби жазушы жəне редактор болған. Кішкентай бала Берн əкесінің өлімінен кейін жарақат алады. Əрине, əкесі Бернге қатты əсер етті, оның мақсаты əрқашан пациенттерді емдеу болды. Бұл əсер Берн жазған «Психотерапиядағы транзакциялық талдау» («Transactional Analysis in Psychotherapy») кітабының бірінші бетіндегі латын бастамасында көрінеді, ол «менің əкем Дэвидті, м.ғ.д., хирургия шебері жəне кедейлерге арналған дəрігерді еске алу үшін» деп аударылады. Берн 1970 жылдың 15 шілдесінде АҚШ -та инфаркттан қайтыс болды. Берн бастаған жұмысты Сан-Францискода өткен семинарларға қатысқан көптеген бұрынғы əріптестері жалғастырды. Олардың қатарына сценарийді талдауды (сценарийді талдау) жетілдірген Клод Штайнер кірді. Э.Берн ең алдымен транзакциялық талдау мен сценарийлік талдауды жасаушы ретінде танымал. Психоанализ, жүйке жəне психикалық ауруларды емдеудің жалпы теориясы мен əдісі идеяларын дамыта отырып, Берн «транзакцияларға» назар аударды (ағылшын тілінен. «trans» - «бір нəрседен бір нəрсеге көшу» жəне ағылш. «action» - «əрекет» деген мағынада) тұлғааралық қарым-қатынастың негізін құрайды. Жасырын мақсаты бар транзакциялардың кейбір түрлерін ол ойындар деп атайды. Берн үш эго жағдайын қарастырады: ересек, ата-ана жəне бала. Қоршаған ортамен байланыс жасай отырып, Берннің пікірінше, адам əрқашан осы мемлекеттердің бірінде болады.</p>
<p>Э. Берннің транзакциялық талдауы өткен ғасырдың 60-жылдарында пайда болды жəне бірден танымал болды. Ішінара оның қарапайымдылығына, қол жетімділігіне байланысты. Ол бірнеше мақсатқа ұмтылады: 1. Мінез-құлықтағы стереотиптерді табу, оларды жою. 2. Құндылықтарды анықтау, олардың мүмкіндіктері мен қажеттіліктерін ескере отырып, шешім қабылдауға үйрену. 3. Əр адам өзінің ішкі əлемін түсіну. 4. Айналадағы адамдармен қарым-қатынасты түсіну. 5. Сезімдерді жасырмауға үйрену. 6. Өз-өзіне сену. Бір қызығы, Эрик Бернге транзакциялық талдауды кез-келген жерде жүргізуге болады: үйде, мектепте, жұмыста. Ол бизнесте жəне қарым - қатынаста қолданылады. Бірақ көптеген психологтар мамандардан кеңес алған дұрыс деп санайды. Олардың көмегінсіз айтарлықтай жақсы нəтижеге қол жеткізу мүмкін емес. Эго-күй немесе эго-мемлекеттің 3 күйі: ата-ана, бала, ересек. Транзакциялық талдауға сəйкес, адам өмір бойы 3 жағдайдың бірінде болады: ата-ана, бала, ересек. Олардың əрқайсысын толығыра қ қарастырайық. Ата-ана. Жаңа туған нəресте əлем туралы əлі ештеңе білмейді. Кішкентай немесе саналы жасқа дейін, ол ақпарат алып, тəжірибе қалыптастыра алады (3 жыл), қасындағы жақын ересектер адамдар оған білім береді. Оларға үлкен жауапкершілік жүктелге н. Балаларға қауіпсіздікті үйрету керек, сезімдер мен эмоциялар туралы айту керек, ненің жақсы, ненің жаман екенін түсіндіру керек. Сонымен қатар, ересектер бұл білімнің бір бөлігін саналы түрде, бір бөлігін бейсаналық түрде жеткізеді. Сонымен қатар, бұл процеске ым-ишара, бет-əлпет, эмоционалды күй қатысады. Ата-ананы бақылай отырып, бала өз ішінде олардың бейнесін жасайды. Психологияда бұл кіріспе деп аталады. Əр адамның санасында осындай қатынас көп. Олардың ішінде тек ата-аналар ғана емес, сонымен қатар əжелер, аталар, үлкен ағалар немесе əпкелер, отбасылық достар болуы мүмкін. Ата-ананың эго күйі – бұл ересектердің ішкі бейнелері. Олар 2 түрде келеді: 1. Бақылаушы. Бұл үнемі сынға алатын ішкі "Мен" болып табылады. Ол сіздің барлық əрекеттеріңізді құнсыздандырады, үнемі қорлайды. бұл мұнымен бітіп ғана қоймайды. "Бақылаушы ата -ана" жағдайында сіз айналаңыздағы адамдардың кез-келген кемшіліктерін байқайсыз, олар үшін ашуланасыз. Осындай жағдайларға тыйым салулар, шектеулер, нұсқаулар тəн. Тəртіпсіз іс-əрекеттер үшін де жазалау жүйесі де бар. 2. Қамқор. Махаббат, мейірімділік, қамқорлық көрсететін - ата-ана. Алдыңғы жағдайдағыдай, бұл біреудің бала кезіндегі бейнесі. Бұл жағдайда адам еркін сезінеді, демалады, басқаларға қамқорлық жасайды. Бұл</p>
<p>жағдайлар жұмыстағы қиындықтарға немесе басқа да проблемаларға қарамастан болуы мүмкін. Сондай-ақ, дұрыс емес əрекет үшін жазалар бар. Бірақ "қамқор ата-ана" аз категориялы, дипломатиясымен танымал. Ата-ананың эго күйі жеке тұлғаның маңызды бөлігі болып табылады. Бұл айналадағы адамдармен ортақ тіл табуға, олармен өзара əрекеттесуге көмектеседі. Бірақ кейде «ата-ана» жағынан басымдылық болады. Сонда ішкі жанжал тууы мүмкін. Адам өз өмірімен өмір сүрмейді. Ол ересектердің тəжірибесін басшылыққа алады, оның бейнесі оның с анасында қалады. Бірақ бұл дұрыс емес пікір. Əрине, біреудің тəжірибесі пайдалы. Бірақ бұған көз жұма қараған жөн болмайды. Ата-ана эго-күйі - ұстаным ата-аналардың мінез-құлқына негізделген. Мұндай эго күйінде адам ата-анасы сияқты ойлайды, сондай əрекет етеді. Ата-ананың ұстанымы - бұл ересектердің ұстанымы. Оны жағымсыз жəне жағымды тəсілдермен көрсетуге болады. Бұл қамқорлық пен қорғау, сонымен бірге бақылау, мəжбүрлеу жəне жоғарыдан үйрету. Бұл өзіне де, өзгеге де қатысты «керек» жəне «міндет» позици ясы. Осы күйден біз өзімізді жəне басқаларды бірдеңе «алуға жəне жасауға» мəжбүр етеміз, үйретеміз жəне түсіндіреміз, осыдан біз қамқорлық жасаймыз, қоректенеміз, қорғаймыз. Ата-ана эго ұстанымы - бұл біздің нақты ата- анамыздың бейнесі, ол психикада көрініп, бізбен бірге мəңгі болады. Əрине, бұл эго күйінің қасиеттері біздің нақты анамыз бен əкеміздің бізбен қандай қарым қатынаста болғанына байланысты. Э.Берн «Адамдар ойнайтын ойындар» кітабында ата-ананың типтік сөз тіркестерін келтіреді: «Мен жақсы білемін», «мен саған түсіндіремін», «мен саған көмектесемін», «мұны кім жасайды?», «болмайды», «Сен міндеттісін» т.б. Бала. Берннің транзакциялық талдауында «бала» эго -күйі эмоционалды тəжірибе болып табылады. Бала оны құрсағында жатқанда алады. Туылғаннан кейін оны ата-анасы береді. Мұны олар қалай жасайтыны маңызды емес. Ең бастысы, олар осы сəтте қандай сезімдер мен эмоцияларды бастан өткереді жəне көрсетеді. Балалар рационалды ойлауды білмейді. Бірақ олар анамның немесе əкемнің эмоционалды жағдайының өзгеруін сезінеді.Нұсқаулар мен тыйымдармен сипатталатын «ата-анадан» айырмашылығы, «балаға» сезім, эмоция жəне қажеттіліктерді қанағаттандыру тəн. Бұған армандар, тілектер, фобиялар жатады. Берннің транзакциялық талдауында «бала» эго -күйі эмоционалды тəжірибе болып табылады. Бала оны құрсағында жатқанда алады. Туылғаннан кейін оны ата-анасы береді. Мұны олар қалай жасайтыны маңызды емес. Ең бастысы, олар осы сəтте қандай сезімдер мен эмоцияларды бастан өткереді жəне көрсетеді. Балалар рационалды ойлауды білмейді. Бірақ олар анамның немесе əкемнің эмоционалды жағдайының өзгеруін нəзік сезінеді.Нұсқаулар мен тыйымдармен сипатталатын «ата- анадан» айырмашылығы, «балаға» сезім, эмоция жəне қажеттіліктерді</p>
<p>қанағаттандыру тəн. Бұған армандар, тілектер, фобиялар жатады. «Ата-ана» - бұл ересектердің бейнелері. «Бала» эго күйі - бұл əр түрлі уақыттағы балалар. «Бала» эго күйі 3 түрден тұрады: 1. Бейімделгіш. Сізге «бақылаушы ата-ана» əсер еткен кезден бастап эмоционалды тəжірибе. Бұл жағдайда сіз қорқыныш, депрессияны сезінесіз, өзіңізбен дауласуға жол бермейсіз, кез -келген жауапкершілік пен міндеттемеге келісесіз. Негізгі фобия қабылданбайды. Бұл сіздің өзіңіздің бағалауыңыз күрт төмендейтін жағдай. Сізді ұят, қорқыныш, реніш мазалайды. 2. Бүлікшіл. «Адаптивті баланың» бір түрі. Бұл бəрінен жалыққан адам. Мысалы - бейресми жасөспірім. Көбінесе, бейресми - бұл тым қатал ата- аналардың ықпалынан құтылу əрекеті. 13-14 жасқа дейін мұндай балалар өздерін мүлтіксіз ұстайды. Бірақ бір сəтте олар ата-аналардың бақылауынан шығып, «жамандықты» бастайды. Ашу, қорқыныш олардың ішінде өмір сүреді. Олар наразылыққа айналады. Əдетте бұл 3 жасында, бала шамадан тыс тəуелсіздікке жеткенде, жасөспірім кезінде жəне əрбір 10 жылдан кейін болады. 3. Кедергісіз. Бұл эго жағдайы рұқсат етілген жағдайда өмір сүрген балаларда дамиды. Бірақ бұл сөздің тікелей мағынасында емес. Олар қауіпті емес кез келген нəрсені істей алатын. Бұл күйге шығармашылық ойлау, шығармашылық, көңілділік тəн. «Еркін бала» кез келген уақытта орнынан секіріп, басқа қалаға серуендей алады. Немесе кенеттен қытай тілін үйренуді бастайды. Оның бойында жаңа идеялар қызу жүріп жатыр. «Баланың» басты артықшылығы - эмоционалдылық пен еркіндік. Бірақ оның кемшілігі де бар: «ата-анаға» қатысты сияқты, ол шындықтан алыс. Бір кездері онымен болған жағдайларға ғана жауап береді. Ересек адам. Транзакциялық талдаудағы бұл жағдай «бала» мен «ересек» арасындағы нəрсе болып саналады. Адам балалар сияқты эмоционалды емес, бірақ сонымен бірге ол ата -аналық бейнелердің көзқарасы мен шектеулеріне бағынбайды. «Ересектер» қоршаған əлемді барабар түрде қабылдай алады, ақылға қонымды басшылыққа ала отырып, саналы шешімдер қабылдай алады. Зейін бірінші рет 3 жасында пайда болады. Бала өзін тұлға ретінде түсінеді, оның анам мен əкем е ұқсамайтынын түсінеді. Оны, əрине, толыққанды «ересек» деп атауға болмайды, бірақ оны жасау қазірдің өзінде бар. Транзакциялық талдау теориясы бойынша адам өмірінің көп бөлігін осы күйде өткізеді. Бірақ анда-санда ол басқа біреу бола алады. Көбінесе бұл стресстік жағдайларда болады. Сіз қандай күйде екеніңізді қалай анықтауға болады? Мінез-құлықты аздап байқау жеткілікті. Əрбір эго күйінің өзіне тəн ерекшеліктері бар:</p>
<p>1. «Бала» мұндай тіркестерді жиі айтады: «Мен қалаймын», «Бұл мені қатты ашуландырады», «Маған бұл маңызды емес». Оның бетінде эмоциялар көрінеді. Бұл сіздің аяғыңыздың астындағы көрініс, дірілдейтін ерніңіз жəне қуаныштың көрінісі болуы мүмкін. 2. «Ата-аналар» үнемі бір нəрсеге тыйым салады, назар аударады, парыз сезімін еске салады. Олар бастарын шайқайды, керемет түрге енеді, қолдарын кеудесіне айқастырады. 3. «Ересектер», олар кез -келген нəрседен пайда іздейді, артықшылықты есептеуді ұсынады, сол немесе басқа əрекеттің, шешімнің орындылығын талқылайды. Олар үнемі бір нəрсе туралы ойланады. Біздің вербалды немесе вербальды емес қарым-қатынасымызды талдау үшін, адамдардың өзара əрекеттесуінің барлық процесі Эрик Берн қарапайым бөлшектерге - трансакцияға бөлуді ұсынды. Трансакция, байланыс бірлігі ретінде, үш эго компонентті ескере отырып, ад амдар арасындағы жеке қарым-қатынасты сипаттайды. Берннің құрылымдық талдауы бойынша, екі адам арасындағы байланыс əрқашан олардың күйлерінің байланысы болып табылады, егер диалогке қатысушылардың бірі екіншісіне ынталандыру жіберсе, ал екіншісі осы ынталандыруға өзінің күйлерінің кем дегенде біреуімен жауап берсе, байланыс дұрыс деп санауға болады. Егер сұхбаттасушылар арасындағы байланыс үшін əрқайсысынан бір күйі жеткілікті болса, мұндай транзакция қарапайым деп аталады. Біздің қандай күйде болатындығымызды жəне олардың өзара əрекеттесуін ескере отырып, транзакцияны үш түрдің біріне жатқызуға болады: 1. Параллель 2. Қиылысу 3. Жасырын Параллель операциялар. Бұл бір адамның ынталандыруы екінші адамның жауабымен тікелей толықтырылатын мəмілелер. Мысалы, ынталандыру: «Қазір сағат нешеде?», Реакция: «Тоқсан алтыға дейін». Бұл жағдайда өзара əрекеттесу əңгімелесушілердің ересек Эго күйлері арасында жүреді. Қиылысу. Ынталандыру мен жауап беру бағыттары қиылысады, бұл мəмілелер жанжалдарға негіз болады. Мысалы, күйеуі: «Менің галстугім қайда?» Деп сұрайды, əйелі тітіркеніп жауап береді: «Мен бəріне əрқашан кінəлімін !!!». Бұл жағдайда ынталандыру Ересек ерден əйелдің Ересек адамына бағытталады, ал реакция Баладан Ата-анаға дейін болады. Жасырын трансакция. Адам бір нəрсені айтқан кезде орын алады, бірақ сонымен бірге мүлде басқаша білдіреді. Бұл жағдайда айтылған сөздер, дауыс ырғағы, мимика, қимылдар мен көзқарастар бір -біріне сəйкес келмейді. Жасырын транзакциялар психологиялық ойындардың дамуына негіз болады. Ойындар теориясын Эрик Берн «Адамдар ойнайтын</p>
<p>ойындар» кітабында сипаттаған. Ойынды талдау - бұл транзакциялық талдаушылар қолданатын əдістердің бірі. «Өмір сценарийі» ұғымы. Трансакт анализінің əдістемесінде, «өмір сценарийі» деген ұғым бар. Ол туралы Берн өзінің «Ойын ойнайтын адамдар» деген кітабында көрсеткен. Автордың ойынша, адамдардың өмірлік программасы мектепке дейінгі уақытта қалыптасады. Бұл қағиданы ортағасыр заманында, мұғалімдер мен шіркеу қызметкерлері ұстанған. Олар баланы ата-анасынан алып кетіп оқытып, 6 жастан кейін ата-анасына қайтаруды ұсынған. Берннің айтуынша, сценарий адамның түпкі санасында жататын өмірлік программа. Оның қалыптасуына ата-анасы əсер етеді. Оның сөзінше адамның іс - əрекетке итермелейтін , ішкі күші. Адам қанша тырысып, жеңуге ұмтылса да, соңғы қорытынды қалағанындай болмауы мүмкін. Мысалы, адамдар көп ақша табуға қанша ұмтылғанымен, оны жаратуды жалғастыра береді. Басқалары бұл уақытта, жетістікке жетуі мүмкін. Ең қызығы, бала өмір жолының алғашқы 2 жылында анасына тəуелді. Оның санасында қалыптасқан психотерапиялық бағдарлама оның өмірлік жолын айқындайды. Туылған уақыттан бастап бірінші жылда, баланың санасында қоршаған ортаға деген сенімділігі немесе сенімсіздігі қалыптасады. Оның өзіне немесе өзін қоршаған адамдарға деген пікірі пайда болады. Ол өзінің жақсы екенін, барлығының дұрыс екенін түсінеді немесе керісінше. Дəл сол секілді, басқа адамдармен қарым қатынысы да сондай. Оларда барлығы дұрыс, немесе олар жақсы, оларда барлығы дұрыс емес, немесе олар нашар адамдар. Бұл өмірлік ұстаным. Бұны Мен жəне Сен деп алып қарастырамыз. Барлығы дұрыс «+», барлығы дұрыс емес «-». Бұл ұстанымдардың бірігуі əр адамның өмірлік сценарийін құрайды. Тереңірек тоқталайық: 1. Мен +, Сен + Бұл шынайы табыс. Парасатты адамның белгісі, жеңіске сенімді келе жатқан адамның белгісі. Бұл ұстанымды ерте кезде сіңіруге болады, немесе ынтамен жұмыс істеу нəтжесінде қалыптастыруға болады. 2. Мен +, Сен - . Шынайы несе аңдаусыз «Сен кінəлі» деген ойын ойнайды. Өзін қоршаған адамдарды жау көреді. Сонымен қатар, олардан құтылуға асығады. Ол тек бөгде адамдар емес, сонымен қатар туыстары, достары несесе балалары болуы да мүмкін. Өте қатал жағдайларда ,осы ұстанымды ұстанғандар, адам өлтіруші болып шығуы ғажап емес. 3. Мен -, Сен + - Тоқырау ұстанымы. Адам өзін өзі жоюмен айналысады. Ең қорқыныштысы, оны əрі қарай балаларына береді. Көбінесе, мұндай адамдар, меланхолик, жолы болмайтындар. Бар өмірін жалғыздықта өткізетіндер. 4. Мен-, Сен -. Толықтай үмітсіздік, жолы болмағыш адамның сценариі. Мұндай өмірлік сценарийден бас тарту немесе өзгерту өте қиын.</p>
<p>Бұл дегеніміз, үйді бұзбай тұрып, астындағы фундаментін суырып алумен тең. Бірақ мүмкіндік əрқашан да бар. Көмекті психолог, психотерапевт көрсете алады. Басқа адамдармен қарым -қатынас адамның өмірлік ұстанымына тəуелді. Адамның ұстанымын, бағдарын ең бірінші кездесуде айқындауға болады. Егер сіз ақкөңіл, ақжарқын болсаңыз , демек айналаңыздағы адамдар да сондай деген сөз. Трансакциялық талдау - бұл əркім өзіне сенуге, өздігінен ойлауға, тəуелсіз шешім қабылдауға жəне өз сезімдерін ашық білдіруге үйренеді деген тұжырымға негізделген мінез-құлықты түсінудің ұтымды əдісі. Оның қағидаларын жұмыста, үйде, мектепте, көршілермен - адамдар адамдармен қарым-қатынас жасайтын кез келген жерде қолдануға болады. Трансакциялық талдау мыналарды қамтиды: • Құрылымдық талдау - жеке тұлғаның құрылымын талдау. • Мəмілелерді талдау - адамдар арасындағы вербальды жəне вербальды емес өзара қатынастар. • Психологиялық ойындарды талдау, қажетті нəтижеге əкелетін жасырын транзакциялар - жеңіске жету. • Адам еріксіз ұстанатын жеке өмір сценарийінің сценарийін талдау.(Скрипт анализ) Қысқа мерзімді психокоррекциялық жұмыстарға арналған топтық жұмыста транзакциялық талдау тиімді. Трансакциялық талдау клиентке бейсаналық мінез-құлық үлгілері мен қалыптарының шеңберінен шығуға, мінез-құлықтың басқа когнитивті құрылымын қабылдау арқылы ерікті еркін мінез-құлық мүмкіндігін алуға жағдай жасайды. Маманның басшылығымен транзакциялық немесе транзакциялық талдау сіздің өміріңіздің қалай дамитынын түсінуге көмектеседі. Оның жасаушысы Эрик Берннің айтуынша, əр адамның балалық шағындағы санасында оның өмірлік сценарийі қалыптасады. Оны адам көптеген жылдар бойы ұстанады. Бұл көптеген проблемалардың тамыры. Егер сізге бірдеңе дұрыс емес болып көрінсе, психологқа жүгінуден қорықпаңыз. Мүмкін транзакциялық талдау сессиясы сізге жағдайды түзетуге көмектеседі. Р. Блейко мен Д. Мутонның басқару теориясы . Америкалық зерттеушілер Р. Блейк пен Д. Мутон кез – келген басқарушы əрекетті екі өлшеммен өлшеуді ұсынды – өндіріске көңіл бөлу мен адамдарға қамқор болу. Өндіріске көңіл бөлу - ол басшының көптеген сұрақтар жүйесіне қатынасы, яғни кадрлар таңдауда, адамдарды ұйымдастыруда, өндірістік үрдістерде жəне шығаратын өнімнің көлемі мен сапасына қатысты шешім қабылдауда тиімдісін таңдау болып саналады. Адамдарға қамқор болу жұмысшылардың мақсаттарына жетуіне, өзіне құрметпен қарауда, жауаптылықты дамытуда, жақсы еңбек жағдайын туғызуда, тұлға аралық жақсы қатынастарда болуды меңзейді.</p>
<p>Т. Кононың ойынша басқарудың жаңашыл – талдаушы типі ұйымға нарықтық бəсекелестіктің ең қатты кезінде де дамуына үлес қосатын тиімді үлгісі болып саналады. Ол өзіне келесі менеджерлік тəртіп элементтерін қамтиды: - ұйымға берілгендік; - қуаттылық жəне жаңашылдық; - жаңа ақпараттармен идеялардағы шапшаңдық: - көптеген идеялар мен жаңалықтарды жалпыландыру; - шешімді тез қабылдау; - топтық əрекеттерді сəйкестендір; - мақсаттарды таңдаудағы нақтылық; - басқалардың пікірімен санасушылық: - сəтсіздіктерге шыдамдылық. Басқарудың негізгі функциялары: Жоспарлау - ұйымның мақсаты қандай болу керек жəне алға қойған мақсатқа қол жеткізу үшін ұйым мүшелері не істеу керек, соны анықтайды. Ұйымдастыру - ұйымның барлық бөлімшелері арасында тұрақты жəне уақытша өзара қарым-қатынастарды орнатуға, ішкі тəртіпті жəне оның шарттарын анықтауға негізделген. Мотивация - ұйым мақсаты мен жеке мақсаттарына қол жеткізуі үшін өзін жəне басқаларды қызмет етуге ұйытқы болу процесі. Бақылау - жалпы алғанда нақты қол жеткізген нəтижелерді жоспарланған көрсеткіштермен салыстыру. Басқарудың бастапқы нүктесі ұйымдастырушылық мақсаттардың айқындалуы болып табылады. Мақсат – бұл топқа біріктірілген, қызметкерлердің ортақ күштері арқылы қол жеткізілетін нақты жай-күй немесе нəтиже. Басқару психологиясының көздері: а) басқару тəжірибесі; б) психологиялықғылымның дамуы; в) ұйым əлеуметінің дамуы. Басқарудың дəстүрлі моделі басқарушының назарын тек экономикалық мақсаттарға көздеген еді. Жаңа модель экономикалық жəне əлеуметтік салалардың бірорталықтануын көрсете келе, назарды басқарушының мақсаттар шеңбері мен əлеуметтік мақсат -міндеттерге аударады – жұмысбастылықты қамтамасыз ету, еңбек жағдайын ізгілендіру, басқаруға қатысуды кеңейту жəне т.б. Қызметкерлермен жұмыс жүргізу барысында басқарудың стратегиялық тұжырымдамасының орталығында ұйым үшін ең басты құндылық болып саналатын адам тұрады. Мазмұны бойынша қызметкерлерді басқарудың жаңа стратегиялық тұжырымдамасы төмендегі қағидаларға негізделген: - əлеуметтік инновациялар да психологиялық сияқты маңызды;</p>
<p>- қызметкерлердің үйлестірілген белсенділігі өзара түсінушілік негізінде туындайды; - ортақ мəселелер қызметкерлердің бірлескен күш салуы арқылы шешіледі; - жұмыстың кооперативті стилі басым болуы қажет. Басқарудың дəстүрлі моделі басқарушының назарын тек экономикалық мақсаттарға көздеген еді. Жаңа модель экономикалық жəне əлеуметтік салалардың бірорталықтануын көрсете келе, назарды басқарушының мақсаттар шеңбері мен əлеуметтік мақсат-міндеттерге аударады – жұмысбастылықты қамтамасыз ету, еңбек жағдайын ізгілендіру, басқаруға қатысуды кеңейту жəне т.б. Қызметкерлермен жұмыс жүргізу барысында басқарудың стратегиялық тұжырымдамасының орталығында ұйым үшін ең баст ы құндылық болып саналатын адам тұрады. Мазмұны бойынша қызметкерлерді басқарудың жаңа стратегиялық тұжырымдамасы төмендегі қағидаларға негізделген: - əлеуметтік инновациялар да психологиялық сияқты маңызды; - қызметкерлердің үйлестірілген белсенділігі өзара түсінушілік негізінде туындайды; - ортақ мəселелер қызметкерлердің бірлескен күш салуы арқылы шешіледі; - жұмыстың кооперативті стилі басым болуы қажет. Басқарушылық қызметтің синтетикалық табиғаты жеке-біріккен ретінде қызметтіңайрықша, спецификалық түріне жататындығын ғана анықтамайды, сонымен бірге оның негізгі психологиялық ерекшеліктердің қатарының болуын белгілейді. А.В.Карпов оларға келесілерді жатқызады: 1. Басқарушылық қызмет тікелей емес, белгілі бір ұйымның қызмет етуінің соңғы нəтижелерімен байланысты салдарлы байланысымен сипатталады. Аталмыш белгі бойынша басқарушылық қызмет атқаруышыл қызметтен ерекшеленеді. 2. Басқарушылық қызмет өз заты бойынша өте айрықшаланған. Оның пəні ретінде адамдар, тұлғалар сияқты өте ерекше заттар болып табылады. Басқарушылық қызметтің ерекше болуы оның пəні (ықпал ету объектісі) субъектілер болып табылатындығында. Осыған байланысты басқарушылық қызметтің қызықты ерекшелігін атап өткен жөн. Ондағы еңбек объектісі мен субъектісі өз ұйымының күрделіл ігі бойынша бірдей ғана емес, сонымен қатар өздерінің негізгі, яғни психологиялық ерекшеліктері бойынша да ұқсас болып табылады. 1. Менеджмент - бұл нарықтық экономика жағдайында өндірісті тиімді басқарудың теориясы мен практикасы. Менеджмент ағылшын сөзі, оның түпкі түбірі гректің «Манус» сөзінен шығып «қол, күш» деген мағынаны білдіреді. Алғашында мал бағу саласында оны ұстау, меңгеру шеберлігін білдіреді. Ол адам қызмет саласына ауысып, адамдарды басқарудың жəне</p>
<p>ұйымдастырудың ғылыми практикалық мəнін білдіретін болды. Ағылшын тілінде Ocsford сөздігінде бұл ұғымға мынадай түсініктер беріледі: А) Адамдармен қарым- қатынас жасау əдісі. Ə) Билік жəне басқару өнері. Б) Шеберліктің ерекше түрі жəне əкімшілік дағды. В) Басқару органы əкімшілік бөлігі. Менеджмент бұл нақты мақсатты жүзеге асыру үшін кəсіпорын жұмысын басқаруға жəне ұйымдастыруға байланысты адамдар қызметінің түрі. Американ экономисті Леотивтің анықтамасы бойынша менеджмент бұл - өнім, технология ,өндірісті ұйымдастыру басқару еңбегі, əлеуметтік қатынас саласында жаңарту, иновациялау, жаңалық мақсатында фирмаларды, компанияларды тиімді басқару принцптерін тəсілдер мен формалардың жиынтығы. Сонымен менеджменттің бастапқы ұғымы бұл басшылық. Іскер кəсіпорындар тек менеджер арқылы əрекет ете алады. Жеке кəсіпорын өзінің құқықтық формаларына қарамастан басшылығы болу тиіс. Менеджер деген сөздің өзі ағылшын тілінен шыққан ол бір нəрсені реттеу, бір нəрсені меңгеру, басшылық ету деген сөз. Менеджер ең кең тараған түрі. Ол басқару түрі эконом икамен шұғылданатын заң жəне басқада мəселелерді жақсы білетін адам. Барлық менеджмент үшін олардың қызмет орнына қарамастан ортақ қызмет болады. А) Менеджер іскер кəсіпорын мақсатын орындайды.Сол мақсатын орындау үшін не істеу керектігін ойластырады. Ə) Менеджер ұйымдастырушы болуы қажет. Б) Менеджер көтермелу шараларын қамтамасыз ететін тығыз байланыс орнатады. В) Менеджер ұйым іс- əрекетін талдайды, нормалауды белгілейді. Г) Менеджер адамның қызмет жағынан кемелденіп, жоғарлатуын қамтамасыз етеді. Шаруашылықтың түйінді орнында жұмыс істейтін кез келген адам да менеджер. Менеджер адамдарды жұмысқа ынталандырады, бағыттайды, ұйымдастырады. Оның бірден-бір құралы-жазбаша немесе ауызша сөзі; немесе цифр тілі. Менеджердің жұмысы техникаға, есептеу операцияларына немесе өнім сатуға қатысты болғанына қарамастан, оның жұмысының тиімділігі тыңдау жəне оқу, айту жəне жазу қабілеттеріне байланысты. Ол өз ойын басқа біреулердің санасына жеткізе білуі, сондай- ақ басқа адамдардың да пікірін айқындай алуы тиіс. Менеджерлік шеберліктің маңызды жақтарының бірі-келіссөз жүргізе білуі-əріптесінің мүддесін өз мүддесіне сəйкестендіре білетін өнері болуы тиіс. Мұның өзі əсіресе қарамағындағы адамдарға əкімшілік билік жүргізе алмайтын басшылар үшін де, сондай-ақ сырттан шикізат жеткізушілермен</p>
<p>қарым-қатынас орнату үшін де аса қажетті жағдай. Басқару типі ретінде менеджменттің негізгі белгілеріне мыналарды жатқызуға болады: 1.Адам, оның қажеттіліктері, мүдделері, уəждері (мотивы), құндылықтары, нұсқамалары басқаруды ұйымдастырудың бастапқы сəті мен оны жүзеге асырушы болып табылады. 2.Басқарудың тəсілдемесінде, принциптерінде жəн е əдістерінде экономикалық құралдар мен басқару əдістеріне артықшылықтар беріледі. Бұл əсіресе маркетингте – тұтынушылардың мүддесін алдыңғы орынға қоятын басқаруда жиі білінеді. 3.Менеджермен қызметкерге қойылатын басты талап ретінде көрінетін кəсіби тұрғыдан басқару менеджментке тəн. Менеджер экономикалық жəне əлеуметтік – психологиялық білімдерді игеріп оқуы керек. 4.Ұйымдастыру ісінде менеджментке жағдайдың өзгеруіне қарай жəне инновациялық типті ұйымдастыруда, яғни жаңашылдыққа жылдам бейімделе алатындай басқаруды икемді ұйымдастыру тəн. 5.Менеджмент менеджердің жеке басына қойылатын талаптардың кешенін танытуы керек. Олардың ішіндегі не гізгілері-тапқырлық, байланысқа бейімділік (коммуникабельность), сенімділік. 2. Америкадағы менеджмент ерекшеліктері Американдық менеджменттің негізгі ерекшеліктері XIX-XX ғасырлар аралығында қалыптасты, ол кезде ірі иерархиялық құрылымдарды құру кезінде орындаушылық жəне басқару еңбегінің бөлінуі болды. Осы кезеңде менеджердің кадрлармен басқарушы ретіндегі негізгі функциялары белгіленді, осындай маманның рөлінің маңыздылығы жəне оның əрбір ұйымның штатында қажеттілігі айқын болды. Американдық менеджмент п ен менеджерлердің негізгі ерекшеліктерінің бірі - іскерлік белсенділік, яғни жоғары іскерлік жəне іс жүргізе білу. Осыған байланысты персоналды таңдаудағы басты қағидаттар – табандылық, мақсаткерлік, басталған істі логикалық соңына дейін жеткізе білу. Қазіргі заманғы американдық менеджменттің барлық өкілдеріне тəн тағы бір маңызды ерекшелігі – табысқа ұмтылу. Америкалық менеджердің кез келген істің алдында қоятын қисынды мəселесі: «ал бұл кəсіпорын маған қандай да бір табыс əкеле ме?» Менеджменттің сипаттам асына айналған американдық іскерліктің тағы бір көрінісі -сандық бағалауды сауатты жүргізе білу, яғни барлығын санау. Егерде жаңа кəсіпорын ашу керек болса немесе оны дамыту қажет болса əрбір менеджер оның барлық теріс жəе оң жақтарын бағалап,шығындар мен тиімділікті дұрыс санай білу қажет. Америка менеджментінің ұлттық ерекшеліктеріне, сондай-ақ оның барлық өкілдерінің сөз мен істің бірлігі жатады. Америкалық басқарушылар үшін келісім-шарт пен қол қойылған міндеттемелер - бұл шын мəнінде қасиетті. Қазіргі заманғы американдық менеджменттің сөзсіз жетістігі кез - келген кəсіпорын үшін дұрыс ұйымдық құрылымды таба білу болып</p>
<p>табылады. Компаниядағы қызметкердің алдына тек қана ортақ мақсат қойылады, оның жеке мұқтаждықтары ескерілмейді. Басқарушылардың ұйымдастырушылық қабілеті тұрғысынан американдық менеджменттің тағы бір ерекшелігі – кəсіпорынның иелігінде бар мақсаттар мен ресурстар санын байланыстыру қабілеті. Осыған байланысты кəсіпқойлықтың басты белгісі - кадрлық, уақытша, материалдық жəне қаржы ресурстарының талап етілетін көлемін бағалай алмау. Мəселен, американдық іскерліктен бастайық. «Тиімділік» ұғымының өзі түсінікті жəне іскер тұлға ретінде сипатталады. Бірақ Америкада оның бірнеше ерекше белгілері бар. Бұл көріністі қызметк ерлердің мақсаты ретінде айтуға болады, яғни қызметкерлер əрдайым табандылықпен бастаған ісін аяқтайды. Осыдан кейін американдық менеджментте MBO (Management By Objectives) тұжырымдамасы өте дамыған. «Пайда ауамен дем алмаса да, ол іскери əлемде дем алады. Еңбекқор американдықтар кез- келген іс тиімді болуы керек деп санайды, яғни ақша уақыт жəне көңіл-күй арқылы келеді деп ойлайды». Осы сөздерден кейін американдықтардың істің егжей-тегжейін түсінуге, түрлі тəсілдерді табуға, түрлі елдердің тəжірибесін зерттеуге деген ықыласы түсінікті. Сондай-ақ «үш іскерлік ереже» бар: 1) өзін ақтап, не табыс əкелетінін анықтау; 2) қойылған мақсатқа жетудің ең тиімді тəсілдерін таңдау; 3) қажетті ресурстарды табу жəне барынша тиімді пайдалану. Сонымен қатар америкалық менеджерлер санау жəне бағалауды алдыңғы орынға қойған. Олар əрқашан өз ісінің оң жəне теріс жақтарын, шығындары мен табыстарын табуға тырысады. Американдық іскерліктің басқа белгісі - сөз мен істің бірлігі. Американдықтар ешқашан өз сөзін бұзбайды. Егер ол уəдесін орындамаса, онда мұндай менеджерге сенім жоғалады, яғни бұл американдықтар үшін киын мəселелердің бірі. Персоналдың құзыреттілігін қамтамасыз ету дегеніміз менеджментті жетілдіру индустриясының дамуын көрсетеді. Бұл белгіні персоналды даярлау жəне біліктілігін арттыру, сондай -ақ оқыту технологияларын дамыту жүйесінде табуға болады. Институттардың 4 түрін бөліп көрсету керек: 1. Менеджмент мектебі; 2. Жоғары оқу орындарындағы менеджмент факультеттері; 3. Кəсіби қоғамдар; 4. Консультативтік фирмалар. Европадағы менеджмент ерекшеліктері Менеджменттің пайда болуы мен дамуына Макс Вебердің (1864-1920) «Шаруашылық тарихы» жəне «Протестанттық этика жəне капитализм рухы» кітаптарындағы капиталистік өндірістегі протестантизм этикасы бастауын талдауы негіз болды. Ол капиталистік өндіріс құрылымында</p>
<p>еңбек бөлінісін оңтайландыру идеясы жатыр деп есептеді. Ол «əрекеттің мінсіз типі» түсінігін енгізіп оның 4 түрін қарастырады: А) дəстүрлі; Б) аффективті; В) құндылықты – оңтайландырылған; Г) мақсаттандырылған. Менеджменттің негізін салушы еңбектерінің бірі ретінде француз инженері, оқымыстысы, кəсіпкері, əкімшілік басқару мектебінің негізін қалаушы Анри Файольдың (1841-1925) еңбектері саналады. Ол 20 жыл көлемінде тау – кен жəне металлургиялық компаниясының директоры болды. Ол « Жалпы жəне өндірістік əкімшілік» жəне « Менеджмент негізі» жұмыстары арқасында еуропадағы ғылыми менеджмент бағытындағы белгілі тұлға болды. Файол бірінші жəне толық менеджмент теориясының авторы. Файол басқаруды жоспарлау, ұйымдастыру, мотивациялау, бақылау сияқты бірнеше байланысқан функциялардан тұрады деп есептеген. Ол компанияның құрылуына себепші жоспары болуы керек деп есептеген: - Фирма қорлары (капитал, ғимарат, шикізат, болдыру жүйесі, даңқ) - Бітпеген өндірістің маңыздылығы жəне құрам есебі; - Техникалық, қаржылық, коммерциялық жəне басқа шарттарға тəуелді болашақ беталысы. Басқарушы əрекеттегі ұйым қарастырылады жорамалдайды: - Жоспардың тыңғылықты өңделуі жəне орындалуын қатаң қадағалау; - Өндірістің кадрлық жəне материалдық құрамдас бөлігі фирма мақсаттарына, қорлары мен қажеттіліктеріне сəйкестігін бақылау. Файоль басшының жұмыс бастылығы негізінде бір бастықтың бақылауындағы қызметкерлер санымен көрсеті летін тиімді «бақылау диапазоны» сияқты белгіні ұсынды. Ол бірінші болып өндірістегі менеджмент психолгияға негізделгенін, өндірісте жұмысшы мен басшы арасында психологиялық қатынас барын анықтап, басшы өкілеттілігіне «бұйрық беру жəне қоластындағылардың бағыныштылығы» мен менеджердің тікелей кіретінін қарастырды. Ол Тейлорға қарағанда шешім қабылдау басшылықтың артықшылығы ретінде санамады. Оның бұл көзқарасы «өкілеттілікті табыстау» принципінің таралуына себеп болды. Ол оқу орындарында менеджментті үйретуге, оны зерттеуге ұсынды. Ол бірінші болып ұйымның сəтті жұмыс істеуіне менеджерлердің жеке – психологиялық ерекшелігі көп əсер ететініне көңіл аударды. Еуропалықтардың түснігінше, менеджер қазіргі тəсілдерді басшылыққа ала отырып, нақты жұмысты ұйымдастыратын адамдар. Жапониядағы менеджмент ерекшеліктері Жапонияда сол жапондықтардың өздері айтпақшы бір-ақ байлық бар- ол адамдар. Тек соларға ғана сүйеніп, елдің билеуші топтары «кедергілер жарысында» жеңіске жете алады. Басқарудың жапондық стилі – бірегей.</p>
<p>Жапондық стильге тəн нəрсе – басқарудың Коноске Масуцити принципі. Оның ең бастысы қызметшілерді басқара білу принципі. Жапонияда тек Масуцити ғана экономикалық механизмнің түйінді элементі ретінде адамдармен қарым-қатынас жасаудың барлық нəзік жақтарын терең, жан- жақты зерттеу қажеттігін мойындады. Бірақ мұнда басқаруды бақылаудың сенімді, жолға қойылған жүйесі қалыптасқан.Масуцити идеясы бойынша жапондық басқару жүйесінің үш түрі қалыптасқан: адам -қаржы- технология. Технология тəуелділік жағдайда, ал бірінші орында қызметшілер.«Масуцити дэнки» компаниясында жұмыскерлерді даярлау жүйесі, біріншіден, кəсіптік білімді оқытудан, екіншіден, фирмалық мінез- құлық кодексін игеруден тұрады. Фирмалық мінез -құлық кодексін менгергеннен кейін, жаңадан қабылданған жұмыскерлер арнайы сабаққа қатысып, онда оларға былайша сендіреді: «Егер сен кездейсоқ қателік жіберсең, фирма сені кешіреді. Егер сен фирманың моральдық кодексінен тайсаң, саған кешірім жоқ». Жапонияда қызметшілерді басқару нақтылы, көбінесе дəстүрлі тəсілдермен жүзеге асырылады. Оның ең бастылары: жұмыскерлерді ұзақ мерзімге, өмір бойы жалдау, жасына қарай еңбек ақы төлеу жəне қызметін жоғарылату болып саналады. Осының арқасында жапондықтар ұзақ уақыт бойы жұмыссыздықты барынша азайтып отыр. Кандидаттарда қателікке жол бермес үшін таңдау мұ қият жүргізіледі. «Масуцити — дэнка» концернінде кондедатураларды іріктегенде өлшемдік куəліктермен жəне өмірбаяндық деректермен танысып қана қоймайды. Концернге алынатын кадрлардың оқу орнын бітірген дипломымен жəне ондағы емтихан бағасымен танысып қоюы жеткіліксіз – олар дауысқа түсуге құқысы бар құжаттармен, салықтарды төлегені туралы куəліктермен семясын тексерген актімен мұқият танысып шығады. Мұндағы мақсат кандидаттың жеке сапасын, оның мінез құлқын, бейімділігін, ынта жігерін білу. Əсіресе кандидаттардың кəсіпорын ұжымына психологиялық үйлесімділігіне ерекше зор көңіл бөлінеді. Жұмысшылар кондидатурасын іріктеген, олардың жұмысқа төзімділігін, көз өлшемінің дұрыстығын тексереді.Кадрлар бəрін шешеді – Бұл жапондық корпорациялар үшін ұран емес, кəсіпорынның табысты болуын қамтамасыз ететін алғы шарт. Шешім əзірлеу жəне қабылдау. Қазіргі Жапонияда шешім əзірлеу мен қабылдау менеджментін маңызды саласы болып саналады. Шешім қабылдаудың жапондық жүйесі ұлттық дəстүрлерге жапондардың этнопсихологиялық ерекшеліктеріне олардың əлеуметтік құндылығына негізделген.Жапонияда шешім қабылдаудың елеулі ерекшелігі – келісу принципі. Европалықтардың шешім қабылдау тəсілінен айырмашылығы – жапондықтар əуелі мəжілістер мен ресми емес келіссөздерге түйінді мəселелерді көпшілік дауыспен шешіп алады. Олардың пікірінше, мұндай процедура бірауыздылыққа келісіп əрекет жасауға ықпал етеді.</p>
<p>Еңбекақы жəне жасына қарай қызметінің жоғарылауы. Жапонияда жасының үлкендігіне қарай ақы төлеу қабылданған оны «нэнко сэйдо» деп атайды.Жұмысқа орналасқан жұмысшы немесе қызметші фирмамен келісім жасайды. Жұмысқа жаңадан орналасушының міндеті: «Барлық күш - қайратын еңбекке жұмсау». Фирма қауымдық құрылысқа негізделген бала ата-анасының борышын қалай өтесе, жұмыскерлер де табан ет маңдай термен фирмаға өз борышын солай өтеуі тиіс.Жапон менеджменттеріне тəн сипат фирманың корпоративті рухы мұның өзі өмірлік жалданатын жұмыскерлердің, олардың еңбекақысының, жасының ұлғаюына қарай қызметінің жоғарылауына қарай, шағын топтар психологиясын сіңірудің тегеурінді күші болып саналады. Қазақстандағы менеджмент ерекшеліктері Менеджмент туралы сөз болғанда біз ең бірінші Əбу Нəсір Əл - Фарабиді еске аламыз. Əбу Нəсір Əл-Фараби (870-950 жж.) ғылымның əр алуан саласында аса маңызды, құнды пікірлер, тұжырымдар қалдырған кемеңгер ғалым, данышпан ойшыл, энциклопедист адам болған. Қазақстанда менеджмент негіздеріне арналған оқу құралын ең бірінші 1992 жылы ағылшын ғалымдарының теориясын негізге ала отырып, Орал ауыл шаруашылығы институтының профессоры К.Ғ.Ахметов жазып шығарды. Осыдан кейін басқару академиясының профессоры К.Б.Бердалиевтің басшылығымен «Басқару негіздері» оқулығы баспадан шықты. Қазіргі жағдайда республиканың мектептерінен бастап, барлық жоғары жəне орта білім беретін оқу орындарында менеджмент негіздерін оқытып, үйрету бағдарламаға енгізілді. Оның себебі нарықтық экономикада өндірістің тиімділігін арттырып, өнім өндіріп, оны сатып, пайда келтіру үшін, тұтынушылардың сұранысынан шығатындай тауар жəне қызмет ұсыну тек қана кəсіпорынды басқарудың барлық қыр-сырын толық білген жағдайда ғана мүмкін. Сондықтан да елімізде менеджмент теорияларын жан-жақты меңгеріп, оны өмірде қолдана білу кездескен жағдайларға байланысты шешім қабылдауға бейімделіп, менеджментті дамыта түсу əрбір басшының міндеті. Республикамыздың нарықтық экономикаға өтуіне байланысты барлық кəсіпорындарда «менеджер» қызметі пайда болып, қазіргі менеджерлер, бұрынғы жоғарыдан бұйрық арқылы ғана өз міндетін орындайтын басшы емес, əр істің басы-қасында болып, ұйымның барлық деңгейіндегі іс- əрекеттерге қанық, іс жүзінде болып жатқан жағдайларды талдау арқылы шешім қабылдап, оны жүзеге асырушы маман, қызметкерлер. Ондай қызметкерлер менеджмент негідерін толық меңгерген, менеджерге қойылатын талаптарды нақты білетін, басқаруда бар теориялармен ғана шектелмей, ой-өрісі жоғары, жаңашыл, кез-келген тұйықтан шығатын, тапқырлық қасиеті мол, жедел шешім қабылдауға қабілетті адамдар болуы тиіс.</p>
<p>Əлемнің түрлі елдеріндегі менеджменттің тарихи дамуымен ұлттық басқару модельдері пайда болды. Қазіргі уақытта басқарудың 2 басты полюсі бар: жеке жауапкершілікпен жəне қызметкерлердің тар мамандануымен ерекшеленетін американдық менеджмент жəне иерархиялық басқару жəне əрекеттер мен бақылауды үйлестіретін жапондық менеджмент. Кейбір елдер американдық менеджерлердің тəжірибесін пайдаланды, ал олардың кейбіреуі жапон менеджерлерінікін қолданды, бірақ барлық елдерде өзіндік ерекшеліктері, жағымды жəне жағымсыз жақтары бар өздерінің менеджмент моделін құра бастады. Бұл үдеріс қазақстандық менеджментке де əсер етті. Қазіргі қазақстандық менеджмент моделін қалыптастыруға нақты өңірдегі тарихи процестер мен оның халқының мəдениеті əсер етті. Тəуелсіздік күнінен бері 20 жылдан астам уақыт өтті жəне осы қысқа мерзім ішінде қазақстандық менеджмент моделінің ерекшеліктері қалыптасты. Қазақстанның басқару ойлары тарихының тамырлары ғасырлар қойнауынан бастау алады. Жүздеген жылдар бойы басқару ойы біртіндеп жетілдірілді. Менеджментке деген қажеттілік адамның жəне оның біріккен қызметінің пайда болуына байланысты туды. Мемлекетті басқару жөнінде біздің еліміздің дамуының əрқилы кезеңіндегі əртүрлі міндеттер өткенімізге үлкен əсер етті жəне бүгінгі күні де Қазақстанның басқару ойының қалыптасуы мен дамуына ықпалын тигізуде. Қазіргі заманғы менеджменттің қалыптасу тарихы мен дамуын ХХ ғасырдың 50-ші жылдарынан бастап қарауға болады. Алғашқы қазақ инженер-менеджері, өндірісті ұйымдастырушысы Қ.И. Сəтпаев (1889-1964) болды. Ол бірінші кеншілердің еңбек өнімділігі мен адамдардың еңбекке деген мотивация мəселеле рін, жұмысшылардың, кəсіподақтардың кəсіпорындармен жəне Балқаш пен Жезқазғанның тау -кен байыту комбинаттарындағы еңбек процестерімен байланысты сұрақтарын шешті. Оның басқару стиліне тəн ең маңызды ерекшелік, ол зерттелінетін нақтылы материалдарды терең ғылыми жүйелеу мен жалпылау болатын. Бұл жерде нағыз білгірдің əдеттен тыс басқару ойы көрінеді. Мектептегі басқару жүйесі Педагогика ғылым мен тəжірибеде тұтас педагогикалық процесті басқару ғылыми тұрғыдан қарастырып, оған қатаң ғылыми негізделген сипат беруге деген ұмтылыс күшейе түсуде. Шындығында басқару тек техникалық жəне өндірістік процестердеғана емес, сонымен бірге педагогика сияқты күрделі əлеуметтік жүйе үшін де қажет. Мектеп жұмыстарының ішінде ең басты мəселелердің бірі – педагогикалық ұжымға ғылыми тұрғыдан сауатты басшылық жасау қажет. Мектеп жұмысын меңгкріп, зор жауапкершілікпен жүзеге асыратын тұлға директор жəне оның оқу-тəрбие жұмысы жөніндегі орынбасарлары. Олар өздерінің міндеттерін педагогикалық ұжыммен ынтымақтасып, демократиялық принцип негізінде іске асырады.</p>
<p>Мектепті басқарудың əдістемелік негіздері, заңдылықтары: 1. Талдау. Мектептің оқу-тəрбие үрдісінің нəтижесіне сараптама жасау. 2. Жоспарлау. Басқарудың мақсаттылығы, мектеп алдындағы басқарудың бағытты жұмысы. Мектеп ісіне тереңдей қанық болған сайын оның күнделікті қызметінің бағыты айқындалып, қорытынды нəтижесі ашылады. 3. Ұйымдастыру. Басқаруды демократиялық (жариялылық) негізде құру. 4. Бақылау. Басқарудың бұқарашылдығы. Басқару барысында мұғалімдерді қосу жəне оқушыларды өзін-өзі тəрбиелеуге дағдылау. Мектеп директоры, оның оқу-тəрбие, əдістемелік жəне ғылыми жұмыстарды басқаратын орынбасарлары ұжым пікірі жəне оның қорытындылары негізінде педагогикалық кеңестің мəжілісінде оқу, сабақтан тыс пəндік жəне тəрбие жұмыста ры бойынша жинақталған талдаулар жөнінде пікір алысады. Бұл, əрине барлық қатысқан сабақтар мен үйірме жұмыстарының тізбесі емес. Міндет күрделірек: оқу-тəрбие жұмысында болып жатқан жағымды, жағымсыз жəйттерді анықтай талдап, жағымдысын дамытып, жағымсыздарын жою жолдары белгілену керек. Бұл мектепте психологиялық ахуалды жасауға, педагогикалық ұжымды белгілі əдістемелік көзөараста тəрбиелеуге, оқытудың барасын жақсарту (қолайлы) жолдарын, əдістерін табудың дұрыс жолдарын таңдауда мүмкіндік береді. Республикада білім беру жүйесі қоғамдауымен байланысты дамып, жетіліп отыруы анық. Қазіргі уақытта мектеп рефрмасына көптеген біржақты өзгерістер енгізіліп, мектеп ісінің ішкі-сыртқы жүйесі түгелімен жаңаруда. Біз бүгінгі күні əлемдік білім беру жүйесіне негізделген басым бағыттарды ұстануда ең алдымен мұғалімдерді жаңаша оқытуға бағыттауымыз қажет. Дамыған елдерді білім беру жүйесіндгі тенденциялардың бірі – білім беруді басқарудың тиімді жолдарының қарастырылуы. Білім саласында еңбек ететін адамдар дың басқару мəдениеті, олардың кəсіптік-педагогикалық мəдениетінің құрамды бөлігі болып табылады. Білім беру реформасы мұғалімнің жаңа мəртебесін – шығармашылық ой-өрісі кең, жаңа жағдайдағы жұмысқа əзір мұғалім- зерттеушіні қалыптастыруды талап етіп отыр. Ол оқытуға бағытталған жеке басқа бағдарланған, өзіндік жəне білікті тəсілдерінің əдістемелік негіздері мен оны іске асыру тетіктерін, пəн бойынша білім беру мазмұнының базалық, кəсіби деңгейін, өткізетін сабақтар мен бейіндік, бейін алдындағы курстарды əзірлеу əдістемелерін білу керек. Адами қасиеттерді дамыту, бала бойына сіңіру мен қалыптастыруда мұғалімнің алатын орны ерекше десек, мектеп басқарушылары мұғалімнің қоғамдағы белсенділігін арттыру үшін кəсіптік мəрте бесі жəне əлеуметтік беделіне, шығармашылығына көңіл бөлу керек. Шығармашылықпен жұмыс істейтін мұғалімнің құзыреттілігін қалыптастыру жағын кеңіне қарастырған жөн.</p>
<p>Ұжымда əдістемелік жұмыстардың мазмұнын, жоспарын, іс - шараларды жүргізу əдістерінің тиімділігін үнемі талдап отыру əдістемелік көмек көрсету жұмысын ары қарай жақсартуға жəне оны дамытуға мүмкіндік береді. Сондықтан білім беруді басқару жүйесінде келсідегідей жұмыстар үнемі назарда болу қажет: -жүргізілген іс-шараларға нақтылы баға беру, қабылданған шешім дəлелді болу, жұмысты дұрыс жоспарлау; -ұжымның жағдайы мен қажеттілігін ескеру; -əдістемелік жұмыстың кезеңдерінің тығыз байланыста болуы; -ұжымдық жəне жекеше жұмыс түрлерінің өзара байланыста дамуы; -мұғалідерді мазмұны мен түрі жағынан бір-біріне жақын іс-шараларға қатыстыру. Яғни, əдістемелік жұмысты ретке келтіруде оның қалыпты жағдайын зерттеп, ұйымдастырушылық құрылымын, мақсат, міндеттерді дұрыс анықтау қажет. Мектепті басқарудың құрылымының негізгі мақсаты: мекептегі педкадрларды диагностикалау арқ ылы кəсіби шеберлігі мен шығармашылығын дамыту болып саналады. Тұлғалық қасетін талдау, кəсіби біліктілік пен шеберлігін жетідіру, инновацияларды меңгеруге үйрету сынды мазмұндық сипатқа ие болмақ. Мектепті басқару құрылымының ұстанымдары: ынтымақтастық, ізігілік, тұлғалық бағдар, даралау мен саралау, тиімділік пен нəтижелілік болып табылады. Басқару айқындалған мақсатқа жету үшін соған сəйкес міндеттерді жəне оларды орыдаудың тиімді жолын анықтап, жүзеге асыру қажет. Стратегиялық Тактикалық Оперативті Өзін-өзі басқару Педагогикалық кеңес: - Оқу жоспарын бекітеді; - Оқу жылының даму стратегиясы мен міндеттерін анықтайды; Ғылыми-əдістемелік кеңес: - Оқу-тəрбиеүрдісінде инновациялық ұжымдық жетекшілік ұйымдастырады; - Кешенді жобалар мен бағдарламалар жасайды; Директордың оқу- тәрбие жөніндегі орынбасары: - Оқу-тəрбие үрдісін ұйымдастырады; - Оқу-тəрбие үрдісін жетілдіреді; - Оқушылардың білім деңгейін бақылайды; - Ақпараттар жинайды; Директордың тəрбие жұмысы жөніндегі орынбасары: Пəнбірлестігі жетекшілері (кафедра жетекшілері, мұғалімдер, сынып жетекшілері) - Білім бағдарламалары мен мемлекеттік білім стандартының орындалуын қамтамасыз етеді; - Оқу- əдістемелік, кіріктірілген кешендерді Оқушылардың өзін-өзі басқару комитетінің қызметі. Оқушылар: - Мектептің өміріне тікелей атсалысады; - Мұғалімдер еңбегін бағалауда өз көзқарасын білдіреді.</p>
<p>Мектепті басқаруда басшыларға жəне мұғалімдерге басқару əдебін, педагогикалық менеджмент қағидаларын, қарым -қатынас өнерінің психологиялық негіздерін жетілдіріп, оң шешеім қабылдауға, қызметті ішкі мотивация негізінде ұйымдастыруға баулу мазмұнында жаңа си паттар керек. Сөйтіп, мектепті басқару жүйесінде төмендегі құралдарды негізге ала отырып жұмыс жүргізу керек: педагогикалық менеджмент, озат тəжірибелер, маркетинг, рейтинг пен мониторинг, білім беру технологиялары. Деңгейлі бағдарламаны басшылыққа ала оты рып, педагогикалық басқарудың негізгі функцияларын таңдап алуға болады: жобалау - жоспарлау, ұйымдастыру-үйлестіру, бақылау - сараптама жасау. Басқаруды ұйымдастыру басшы білігіне байланысты екенін ескере отырып, басқарудың барлық буынында менеджмент өнерін меңгеру, қазіргі педагогикалық инновацияның негізгі бағытынан хабардар болу қағидасын ұстану қажет. Мектеп қызметін жаңаша ұйымдастыру, əр мектеп басшысының өз деңгейіндегі басқару рөлін арттыру, оқушылардың, мұғалімдердің жəне мектептің қызметін бағалау тəсілдерін басқаша, тиімді негізде қайта құру, үрдіс пен нəтижеге сай қызметкерлердің кəсіби мəдениетіне, қызмет əдебіне, рухани-əлеуметтік жағдайына көңіл бөлу – мектепті басқару құрылымының негізгі қағидаларының бірі болып табылады. Қорыта келе айтарымыз мектепті қазіргі таңда жаңа талаптарға сай басқарғанда мектептің оқу-тəрбие үрдісінің сапасы артатыны сөзсіз. Демек,</p>
<p>ғылым мен техниканың жедел дамыған, мəліметтер ағыны күшейген ХХІ ғасырда жан-жақты дамыған шығармашыл жеке тұлғаны қалыптастыру мектептің басты міндеті болып отыр. Сондықтан да, мектепті басқару жүйесінде басқарудың мəні мен негізгі принципткрін жетік ə рі нақты меңгере білу қажет. Бақылау сұрақтары: 1. Менеджер қызметінің бес стилін сипаттап, «менеджмент торын» құрастырған теорияларды сипаттаңыз. 2. Басқару психологиясының зерттеу обьектісіне сипаттыңыз. 3. ХХғ. бас кезінде басқару ғылымына үлес қосқан өкілдердің еңбегін тоқталыңыз.</p>`,rawText:`§ 2 Басқарудың психологиялық теориясы  
 
Адамзат қызметінінің көптеген саласында ғылым мен өнер бірінен-бірі 
оңашаланбай, керісінше бірін-бірі толықтырады. Басқару бір мезетте  көне 
өнер болыпта, жаңа ғылым болып та есептеледі. 
Басқару ұйымның мақсаттарына қол жеткізуге бағытталған, 
үйлестірілген шаралардың жиынтығы деп саналады. Кейде «басқару» 
түсінігінің синонимдері ретінде «менеджмент» жəне «жетекшілік» 
ұғымдары қолданылады, алайда олардың мазмұнында əлдебір 
айырмашылық бар. 
Менеджемент ұғымының кең етек алған түсініктемелері келесілерде 
көрсетілген: менеджмент – алуан-түрлі ұйымдардағы адамдарға жетекшілік 
ету бойынша қызмет, іс-əрекет түрі. Менеджмент – бұл осы қызметті жүзеге 
асыруға көмек беретін, адам білімінің саласы. Соңғысы, менеджмент – 
менеджерлерден жинақталған ретінде – бұл белгілі бір адамдар санаты, 
басқару бойынша жұмысты іске асыратындардың əлеуметтік қабаты. 
Жапониядағы менеджмент жүйесінің қалыптасуы: 
1) Жапондықтардың психологиясы олардың мəдениетімен байланысты. 
Жапония менеджменті əлеуметтік құндылықта р мен мəдени 
дəстүрлерге негізделген. 
2) Жапон менеджерлері өндірісті басқарудың өз құрылымын америка 
жəне де басқа əлем менеджментінен алған теория мен практикасы 
жүзінде жасап шығарды. 
3) Қазіргі əлемде ең жақсы менеджерлер жапондықтар болып 
есептеледі. Жапон мəдениеті міндет, қызметтестік жəне топшылдық 
құндылықтарын басты деп санайды. 
4) Жапон тілінде ағылшын баламасы «эмэ» сөзі көбінесе адамдардың өзі 
қарайтын тобынан тəуелді екенін түсіндіреді. Əрбір жапондық өзін 
сыйлап құрметтегенді, жақсы көргенді қалайды.  
Америка ғалымы И. Олстол жапон компанияларын зерттеп 
менеджменттің бес басты ұстанымын бөліп көрсетті: 
Бірінші ұстаным жапон жұмысшылары  өз міндеттерін орындаумен 
қатар  
оны жетілдіруге тиіс деп есептейді. 
Екінші ұстаным бойынша жұмысшы жұмысын жақсы атқаруға 
талпынуы. Ол жұмысын атқара отырып оны дамытуға үлес қосып 
материалды жəне рухани рахаттанады. Жапон менеджерлары жұмысшы 
еркін шектемеді. 
Үшінші ұстаным жұмыс орынын отбасына айналдыру. Жапондықтар 
жалдаушылар мен жалданушылар бір тұтас деп есептейді. Ол ұстаным 
«эмэ» түсінігін қанағаттандырып,  адамдар арасындағы қолдау мен көмекті 
нығайтады.  

Төртінші ұстаным бойынша топ жеке адамнан құнды. Олардың 
ойынша адам эгоист болмауы керек, өзі өмір сүретін топқа ри зашылық 
білдіреді. Бұл Конфуций ілімінің ұстанымы.  
Бесінші ұстаным бойынша өндірістік серіктестік басты қағида. 
Жапон менеджерлері жұмысшыларды өздерінің жетістікке жету себепкері 
деп санайды. Серіктестікке бағытталу «учива» терминімен сипатталады.  
Ресейде менеджмент жүйесінің қалыптасуы. Ресейде менеджмент 
термині тек ХХ ғасырдың  60 жылдары ғана енді.  Бұл жағдай нарықтық 
экономиканың қайта құрылуы кезеңінде болды. Менеджменттің  Ресейде 
етек жаюына  А. К. Гастев пен Л. М. Керженцев көп үлес қосты. 20 жылы 
Гастевтің қолдауымен психологиялық  зертхана Ресейде алғаш ашылды. 50-
жылдары академик  А. И. Бергтың  арқасында кибернетика саласы дамып, 
адам еңбегін көтеруге жағдай жасалды. 60 жылдары басқару ғылымы 
түсінігі пайда болып кеңінен зерттелді. Экономиканы басқару дамыды. 90-
жылдары Ресейде экономика тағы өзгеріске ұшырады. Олар жекеше 
басқарудан нарықтық экономикаға көшті. 
«Басқару» түсінігі «менеджмент» ұғымына қарағанда едəуір кең 
ауқымды болып табылады. Ағылшын тілінің оксфордтық сөздігінен 
төмендегі анықтамаларын көруге болады: 
1) Адамдарға жүгіну тəсілі, мəнері. 
2) Басқару билігі мен өнері. 
3) Айрықша қабілеттілік жəне əкімшілік машықтар. 
4) Басқару органы, əкімшілік бірлік. 
Психоанализ теориясы. Ең бірінші адам ынтасына ғылыми зерттеу 
жүргізген, психоанализ ғылымының негізін салушы австриялық психиатр – 
дəрігер Зигмунд Фреид болды. Ол адамның əрбір психикалық құбылысы 
арнайы себепке негізделген жəне оның ессіз үрдістерінен адамның өзін 
ұстауы тəуелді деп есептеген. Эростың энергиясы «либидо», ал танатос 
энергиясы «мортидо» деп аталады. Осы күштер адамның белсенділігін 
анықтайды. Адамның тəртібі екі инстинктті ұмтылушылықтармен 
түсіндіріледі: өмірге ұмтылыс (эрос) жəне жəне өлімге ұмтылыс (танатос). 
Олардың əрбірі жойқын күшке ие. 
Үйрету теориясы. И. П. Павлов, Д. Б. Уотсон, Б. Ф. Скиннер 
жұмыстары мадақтау мен жазалау жүйелеріне негізделіп (үйрету теориясы)  
орындаушының əрекеттерді ақылмен шешу қабілеті жəне басшы мен 
бағынушы арасындағы кері байл анысқа құрылу қажеттілігімен 
анықталады. Үйрету теориясы негізінде рефлекс ұғымы, яғни тұлғаның 
сыртқы құбылыстарға жауап беруі жатады. Рефлекстер туылған (шартсыз) 
жəне тəжірибеден жинақталатын шартсыз рефлекстер болып бөлінеді. 
Туылған рефлекстер ессіз а кты кезінде сезімнің, эмоциялардың, 
қалаулардың қиын толқынымен байқалып, шешім қабылдау мен еріктілік 
көрсететін кезде байқалады . Шартты рефлекс осы теорияны 
жақтаушылардың көзқарасы бойынша ойлау мен өзін ұстаудың 

стереотипын құрап, адамның алға ұмтылушылық жүйесінің бөлігі болып 
табылады. 
Белгілі тұлға теориясымен айналысушы неміс – америка психологы К. 
Левин басқару үлгісінің концепциясын құрастыры п сипаттады.  Ол 
тəжірибе жүзіндегі зерттеулері бойынша  
3 негізгі үлгіні бөліп көрсетті: 
-Авторитарлық ( директивті) 
-Демократиялық ( əріптестік) 
- Нейтралды (босəурелік)  
Э.Берн бойынша транзакциялық талдау теориясы. 
Эрик Берн бойынша транзакциялық талдаудың мəні. Психологиядағы 
транзакциялық талдау (ТА) – бұл жеке адамның немесе топтың мінез-
құлқын сипаттауға жəне талдауға мүмкіндік беретін əдіс. Басқаша айтқанда, 
транзакциялық немесе трансакттық талдау деп аталады. Ол күрделі 
психологиялық проблемаларды емдеу үшін қолданылады. Оның авторы-
психотерапевт Эрик Берн. 
Эрик Леннард Берн (шын аты: Леонард Бернштейн) - американдық 
психолог жəне психиатр. Эрик Берн 1910 ж. 10 мамырда Монреальда 
(Канада) дүниеге келді. Оның əкесі тəжірибелі терапевт болды, ол 
науқастарын емдеу барысында ұлын жиі алып жүрді. Берннің анасы кəсіби 
жазушы жəне редактор болған. Кішкентай бала Берн əкесінің өлімінен кейін 
жарақат алады. Əрине, əкесі Бернге қатты əсер етті, оның мақсаты əрқашан 
пациенттерді емдеу болды. Бұл əсер Берн жазған «Психотерапиядағы 
транзакциялық талдау» («Transactional Analysis in Psychotherapy») 
кітабының бірінші бетіндегі латын бастамасында көрінеді, ол «менің əкем 
Дэвидті, м.ғ.д., хирургия шебері жəне кедейлерге арналған дəрігерді еске 
алу үшін» деп аударылады. Берн 1970 жылдың 15 шілдесінде АҚШ -та 
инфаркттан қайтыс болды. Берн бастаған жұмысты Сан-Францискода өткен 
семинарларға қатысқан көптеген бұрынғы əріптестері жалғастырды. 
Олардың қатарына сценарийді талдауды (сценарийді талдау) жетілдірген 
Клод Штайнер кірді.  
Э.Берн ең алдымен транзакциялық талдау мен сценарийлік талдауды 
жасаушы ретінде танымал. Психоанализ, жүйке жəне психикалық 
ауруларды емдеудің жалпы теориясы мен əдісі идеяларын дамыта отырып, 
Берн «транзакцияларға» назар аударды (ағылшын тілінен. «trans» - «бір 
нəрседен бір нəрсеге көшу» жəне ағылш. «action» - «əрекет» деген 
мағынада) тұлғааралық қарым-қатынастың негізін құрайды. Жасырын 
мақсаты бар транзакциялардың кейбір түрлерін ол ойындар деп атайды. 
Берн үш эго жағдайын қарастырады: ересек, ата-ана жəне бала. Қоршаған 
ортамен байланыс жасай отырып, Берннің пікірінше, адам əрқашан осы 
мемлекеттердің бірінде болады. 

Э. Берннің транзакциялық талдауы өткен ғасырдың 60-жылдарында 
пайда болды жəне бірден танымал болды. Ішінара оның 
қарапайымдылығына, қол жетімділігіне байланысты. 
Ол бірнеше мақсатқа ұмтылады: 
1. Мінез-құлықтағы стереотиптерді табу, оларды жою. 
2. Құндылықтарды анықтау, олардың мүмкіндіктері мен 
қажеттіліктерін ескере отырып, шешім қабылдауға үйрену. 
3. Əр адам өзінің ішкі əлемін түсіну. 
4. Айналадағы адамдармен қарым-қатынасты түсіну. 
5. Сезімдерді жасырмауға үйрену. 
6. Өз-өзіне сену. 
Бір қызығы, Эрик Бернге транзакциялық талдауды кез-келген жерде 
жүргізуге болады: үйде, мектепте, жұмыста. Ол бизнесте жəне қарым -
қатынаста қолданылады. Бірақ көптеген психологтар мамандардан кеңес 
алған дұрыс деп санайды. Олардың көмегінсіз айтарлықтай жақсы нəтижеге 
қол жеткізу мүмкін емес. 
Эго-күй немесе эго-мемлекеттің 3 күйі: ата-ана, бала, ересек.  
Транзакциялық талдауға сəйкес, адам өмір бойы 3 жағдайдың бірінде 
болады: ата-ана, бала, ересек. Олардың əрқайсысын толығыра қ 
қарастырайық. 
Ата-ана. Жаңа туған нəресте əлем туралы əлі ештеңе білмейді. 
Кішкентай немесе саналы жасқа дейін, ол ақпарат алып, тəжірибе 
қалыптастыра алады (3 жыл), қасындағы жақын ересектер адамдар оған 
білім береді. Оларға үлкен жауапкершілік жүктелге н. Балаларға 
қауіпсіздікті үйрету керек, сезімдер мен эмоциялар туралы айту керек, 
ненің жақсы, ненің жаман екенін түсіндіру керек. Сонымен қатар, ересектер 
бұл білімнің бір бөлігін саналы түрде, бір бөлігін бейсаналық түрде 
жеткізеді. Сонымен қатар, бұл процеске ым-ишара, бет-əлпет, эмоционалды 
күй қатысады. Ата-ананы бақылай отырып, бала өз ішінде олардың 
бейнесін жасайды. Психологияда бұл кіріспе деп аталады. Əр адамның 
санасында осындай қатынас көп. Олардың ішінде тек ата-аналар ғана емес, 
сонымен қатар əжелер, аталар, үлкен ағалар немесе əпкелер, отбасылық 
достар болуы мүмкін. Ата-ананың эго күйі – бұл ересектердің ішкі 
бейнелері. Олар 2 түрде келеді: 
1. Бақылаушы. Бұл үнемі сынға алатын ішкі "Мен" болып табылады. 
Ол сіздің барлық əрекеттеріңізді құнсыздандырады, үнемі қорлайды. бұл 
мұнымен бітіп ғана қоймайды. "Бақылаушы ата -ана" жағдайында сіз 
айналаңыздағы адамдардың кез-келген кемшіліктерін байқайсыз, олар үшін 
ашуланасыз. Осындай жағдайларға тыйым салулар, шектеулер, нұсқаулар 
тəн. Тəртіпсіз іс-əрекеттер үшін де жазалау жүйесі де бар. 
2. Қамқор. Махаббат, мейірімділік, қамқорлық көрсететін - ата-ана. 
Алдыңғы жағдайдағыдай, бұл біреудің бала кезіндегі бейнесі. Бұл жағдайда 
адам еркін сезінеді, демалады, басқаларға қамқорлық жасайды. Бұл 

жағдайлар жұмыстағы қиындықтарға немесе басқа да проблемаларға 
қарамастан болуы мүмкін. Сондай-ақ, дұрыс емес əрекет үшін жазалар бар. 
Бірақ "қамқор ата-ана" аз категориялы, дипломатиясымен танымал. 
 Ата-ананың эго күйі жеке тұлғаның маңызды бөлігі болып табылады. 
Бұл айналадағы адамдармен ортақ тіл табуға, олармен өзара əрекеттесуге 
көмектеседі. Бірақ кейде «ата-ана» жағынан басымдылық болады. Сонда 
ішкі жанжал тууы мүмкін. Адам өз өмірімен өмір сүрмейді. Ол ересектердің 
тəжірибесін басшылыққа алады, оның бейнесі оның с анасында қалады. 
Бірақ бұл дұрыс емес пікір. Əрине, біреудің тəжірибесі пайдалы. Бірақ 
бұған көз жұма қараған жөн болмайды.  
Ата-ана эго-күйі - ұстаным ата-аналардың мінез-құлқына негізделген. 
Мұндай эго күйінде адам ата-анасы сияқты ойлайды, сондай əрекет етеді. 
Ата-ананың ұстанымы - бұл ересектердің ұстанымы.  Оны жағымсыз жəне 
жағымды тəсілдермен көрсетуге болады. Бұл қамқорлық пен қорғау, 
сонымен бірге бақылау, мəжбүрлеу жəне жоғарыдан үйрету. Бұл өзіне де, 
өзгеге де қатысты «керек» жəне «міндет» позици ясы. Осы күйден біз 
өзімізді жəне басқаларды бірдеңе «алуға жəне жасауға» мəжбүр етеміз, 
үйретеміз жəне түсіндіреміз, осыдан біз қамқорлық жасаймыз, 
қоректенеміз, қорғаймыз. Ата-ана эго ұстанымы - бұл біздің нақты ата-
анамыздың бейнесі, ол психикада көрініп, бізбен бірге мəңгі болады. Əрине, 
бұл эго күйінің қасиеттері біздің нақты анамыз бен əкеміздің бізбен қандай 
қарым қатынаста болғанына байланысты. 
Э.Берн «Адамдар ойнайтын ойындар» кітабында ата-ананың типтік 
сөз тіркестерін келтіреді: «Мен жақсы білемін», «мен саған түсіндіремін», 
«мен саған көмектесемін», «мұны кім жасайды?», «болмайды», «Сен 
міндеттісін» т.б. 
Бала. Берннің транзакциялық талдауында «бала» эго -күйі 
эмоционалды тəжірибе болып табылады. Бала оны құрсағында жатқанда 
алады. Туылғаннан кейін оны ата-анасы береді. Мұны олар қалай 
жасайтыны маңызды емес. Ең бастысы, олар осы сəтте қандай сезімдер мен 
эмоцияларды бастан өткереді жəне көрсетеді. Балалар рационалды ойлауды 
білмейді. Бірақ олар анамның немесе əкемнің эмоционалды жағдайының 
өзгеруін  сезінеді.Нұсқаулар мен тыйымдармен сипатталатын «ата-анадан» 
айырмашылығы, «балаға» сезім, эмоция жəне қажеттіліктерді 
қанағаттандыру тəн. Бұған армандар, тілектер, фобиялар жатады.  
Берннің транзакциялық талдауында «бала» эго -күйі эмоционалды 
тəжірибе болып табылады. Бала оны құрсағында жатқанда алады. 
Туылғаннан кейін оны ата-анасы береді. Мұны олар қалай жасайтыны 
маңызды емес. Ең бастысы, олар осы сəтте қандай сезімдер мен 
эмоцияларды бастан өткереді жəне көрсетеді. Балалар рационалды ойлауды 
білмейді. Бірақ олар анамның немесе əкемнің эмоционалды жағдайының 
өзгеруін нəзік сезінеді.Нұсқаулар мен тыйымдармен сипатталатын «ата-
анадан» айырмашылығы, «балаға» сезім, эмоция жəне қажеттіліктерді 

қанағаттандыру тəн. Бұған армандар, тілектер, фобиялар жатады. «Ата-ана» 
- бұл ересектердің бейнелері. «Бала» эго күйі - бұл əр түрлі уақыттағы 
балалар. 
«Бала» эго күйі 3 түрден тұрады: 
1. Бейімделгіш. Сізге «бақылаушы ата-ана» əсер еткен кезден бастап 
эмоционалды тəжірибе. Бұл жағдайда сіз қорқыныш, депрессияны сезінесіз, 
өзіңізбен дауласуға жол бермейсіз, кез -келген жауапкершілік пен 
міндеттемеге келісесіз. Негізгі фобия қабылданбайды. Бұл сіздің өзіңіздің 
бағалауыңыз күрт төмендейтін жағдай. Сізді ұят, қорқыныш, реніш 
мазалайды. 
2. Бүлікшіл. «Адаптивті баланың» бір түрі. Бұл бəрінен жалыққан адам. 
Мысалы - бейресми жасөспірім. Көбінесе, бейресми - бұл тым қатал ата-
аналардың ықпалынан құтылу əрекеті. 13-14 жасқа дейін мұндай балалар 
өздерін мүлтіксіз ұстайды. Бірақ бір сəтте олар ата-аналардың бақылауынан 
шығып, «жамандықты» бастайды. Ашу, қорқыныш олардың ішінде өмір 
сүреді. Олар наразылыққа айналады. Əдетте бұл 3 жасында, бала шамадан 
тыс тəуелсіздікке жеткенде, жасөспірім кезінде жəне əрбір 10 жылдан кейін 
болады. 
3. Кедергісіз. Бұл эго жағдайы рұқсат етілген жағдайда өмір сүрген 
балаларда дамиды. Бірақ бұл сөздің тікелей мағынасында емес. Олар қауіпті 
емес кез келген нəрсені істей алатын. Бұл күйге шығармашылық ойлау, 
шығармашылық, көңілділік тəн. «Еркін бала» кез келген уақытта орнынан 
секіріп, басқа қалаға серуендей алады. Немесе кенеттен қытай тілін 
үйренуді бастайды. Оның бойында жаңа идеялар қызу жүріп жатыр. 
«Баланың» басты артықшылығы - эмоционалдылық пен еркіндік. Бірақ 
оның кемшілігі де бар: «ата-анаға» қатысты сияқты, ол шындықтан алыс. 
Бір кездері онымен болған жағдайларға ғана жауап береді. 
Ересек адам. Транзакциялық талдаудағы бұл жағдай «бала» мен 
«ересек» арасындағы нəрсе болып саналады. Адам балалар сияқты 
эмоционалды емес, бірақ сонымен бірге ол ата -аналық бейнелердің 
көзқарасы мен шектеулеріне бағынбайды. «Ересектер» қоршаған əлемді 
барабар түрде қабылдай алады, ақылға қонымды басшылыққа ала отырып, 
саналы шешімдер қабылдай алады. 
Зейін бірінші рет 3 жасында пайда болады. Бала өзін тұлға ретінде 
түсінеді, оның анам мен əкем е ұқсамайтынын түсінеді. Оны, əрине, 
толыққанды «ересек» деп атауға болмайды, бірақ оны жасау қазірдің өзінде 
бар. Транзакциялық талдау теориясы бойынша адам өмірінің көп бөлігін 
осы күйде өткізеді. Бірақ анда-санда ол басқа біреу бола алады. Көбінесе 
бұл стресстік жағдайларда болады. Сіз қандай күйде екеніңізді қалай 
анықтауға болады? 
Мінез-құлықты аздап байқау жеткілікті. Əрбір эго күйінің өзіне тəн 
ерекшеліктері бар: 

1. «Бала» мұндай тіркестерді жиі айтады: «Мен қалаймын», «Бұл мені 
қатты ашуландырады», «Маған бұл маңызды емес». Оның бетінде 
эмоциялар көрінеді. Бұл сіздің аяғыңыздың астындағы көрініс, дірілдейтін 
ерніңіз жəне қуаныштың көрінісі болуы мүмкін. 
2. «Ата-аналар» үнемі бір нəрсеге тыйым салады, назар аударады, 
парыз сезімін еске салады. Олар бастарын шайқайды, керемет түрге енеді, 
қолдарын кеудесіне айқастырады.  
3. «Ересектер», олар кез -келген нəрседен пайда іздейді, 
артықшылықты есептеуді ұсынады, сол немесе басқа əрекеттің, шешімнің 
орындылығын талқылайды. Олар үнемі бір нəрсе туралы ойланады. 
Біздің вербалды немесе вербальды емес қарым-қатынасымызды талдау 
үшін, адамдардың өзара əрекеттесуінің барлық процесі Эрик Берн 
қарапайым бөлшектерге - трансакцияға бөлуді ұсынды. Трансакция, 
байланыс бірлігі ретінде, үш эго компонентті ескере отырып, ад амдар 
арасындағы жеке қарым-қатынасты сипаттайды. 
 Берннің құрылымдық талдауы бойынша, екі адам арасындағы 
байланыс əрқашан олардың күйлерінің байланысы болып табылады, егер 
диалогке қатысушылардың бірі екіншісіне ынталандыру жіберсе, ал 
екіншісі осы ынталандыруға өзінің күйлерінің кем дегенде біреуімен жауап 
берсе, байланыс дұрыс деп санауға болады. Егер сұхбаттасушылар 
арасындағы байланыс үшін əрқайсысынан бір күйі жеткілікті болса, мұндай 
транзакция қарапайым деп аталады. Біздің қандай күйде 
болатындығымызды жəне олардың өзара əрекеттесуін ескере отырып, 
транзакцияны үш түрдің біріне жатқызуға болады: 
1. Параллель  
2. Қиылысу  
3. Жасырын  
Параллель операциялар. Бұл бір адамның ынталандыруы екінші 
адамның жауабымен тікелей толықтырылатын мəмілелер. Мысалы,  
ынталандыру: «Қазір сағат нешеде?», Реакция: «Тоқсан алтыға дейін». Бұл 
жағдайда өзара əрекеттесу əңгімелесушілердің ересек Эго күйлері арасында 
жүреді. 
Қиылысу. Ынталандыру мен жауап беру бағыттары қиылысады, бұл 
мəмілелер жанжалдарға негіз болады. Мысалы, күйеуі: «Менің галстугім 
қайда?» Деп сұрайды, əйелі тітіркеніп жауап береді: «Мен бəріне əрқашан 
кінəлімін !!!». Бұл жағдайда ынталандыру Ересек ерден əйелдің Ересек 
адамына бағытталады, ал реакция Баладан Ата-анаға дейін болады. 
Жасырын трансакция. Адам бір нəрсені айтқан кезде орын алады, бірақ 
сонымен бірге мүлде басқаша білдіреді. Бұл жағдайда айтылған сөздер, 
дауыс ырғағы, мимика, қимылдар мен көзқарастар бір -біріне сəйкес 
келмейді. Жасырын транзакциялар психологиялық ойындардың дамуына 
негіз болады. Ойындар теориясын Эрик Берн «Адамдар ойнайтын 

ойындар» кітабында сипаттаған. Ойынды талдау - бұл транзакциялық 
талдаушылар қолданатын əдістердің бірі. 
«Өмір сценарийі» ұғымы. 
Трансакт анализінің əдістемесінде, «өмір сценарийі» деген ұғым бар. 
Ол туралы Берн өзінің «Ойын ойнайтын адамдар» деген кітабында 
көрсеткен. Автордың ойынша, адамдардың өмірлік программасы мектепке 
дейінгі уақытта қалыптасады. Бұл қағиданы ортағасыр заманында, 
мұғалімдер мен шіркеу қызметкерлері ұстанған. Олар баланы ата-анасынан 
алып кетіп оқытып, 6 жастан кейін ата-анасына қайтаруды ұсынған. Берннің 
айтуынша, сценарий адамның түпкі санасында жататын өмірлік программа. 
Оның қалыптасуына ата-анасы əсер етеді. Оның сөзінше адамның іс -
əрекетке итермелейтін , ішкі күші.  Адам қанша тырысып, жеңуге ұмтылса 
да, соңғы қорытынды қалағанындай болмауы мүмкін. Мысалы, адамдар көп 
ақша табуға қанша ұмтылғанымен, оны жаратуды жалғастыра береді. 
Басқалары бұл уақытта, жетістікке жетуі мүмкін. 
Ең қызығы, бала өмір жолының алғашқы 2 жылында анасына тəуелді. 
Оның санасында қалыптасқан психотерапиялық бағдарлама оның өмірлік 
жолын айқындайды. 
Туылған уақыттан бастап бірінші жылда, баланың санасында қоршаған 
ортаға деген сенімділігі немесе сенімсіздігі қалыптасады. Оның өзіне 
немесе өзін қоршаған адамдарға деген пікірі пайда болады. Ол өзінің жақсы 
екенін, барлығының дұрыс екенін түсінеді немесе керісінше. Дəл сол 
секілді, басқа адамдармен қарым қатынысы да сондай. Оларда барлығы 
дұрыс, немесе олар жақсы, оларда барлығы дұрыс емес, немесе олар нашар 
адамдар. Бұл өмірлік ұстаным. Бұны Мен жəне Сен деп алып қарастырамыз. 
Барлығы дұрыс «+», барлығы дұрыс емес «-». Бұл ұстанымдардың бірігуі 
əр адамның өмірлік сценарийін құрайды.  
Тереңірек тоқталайық: 
1. Мен +, Сен + Бұл шынайы табыс. Парасатты адамның белгісі, 
жеңіске сенімді келе жатқан адамның белгісі. Бұл ұстанымды ерте кезде 
сіңіруге болады, немесе ынтамен жұмыс істеу нəтжесінде қалыптастыруға 
болады.  
2. Мен +, Сен - . Шынайы несе аңдаусыз  «Сен кінəлі» деген ойын 
ойнайды. Өзін қоршаған адамдарды жау көреді. Сонымен қатар, олардан 
құтылуға асығады. Ол тек бөгде адамдар емес, сонымен қатар туыстары, 
достары несесе балалары болуы да мүмкін. Өте қатал жағдайларда ,осы 
ұстанымды ұстанғандар, адам өлтіруші болып шығуы ғажап емес.  
3. Мен -, Сен + - Тоқырау ұстанымы. Адам өзін өзі жоюмен 
айналысады. Ең қорқыныштысы, оны əрі қарай балаларына береді. 
Көбінесе, мұндай адамдар, меланхолик, жолы болмайтындар. Бар өмірін 
жалғыздықта өткізетіндер. 
4. Мен-, Сен -. Толықтай үмітсіздік, жолы болмағыш адамның 
сценариі. Мұндай өмірлік сценарийден бас тарту немесе өзгерту өте қиын. 

Бұл дегеніміз, үйді бұзбай тұрып, астындағы фундаментін суырып алумен 
тең. 
Бірақ мүмкіндік əрқашан да бар. Көмекті психолог, психотерапевт 
көрсете алады. Басқа адамдармен қарым -қатынас адамның өмірлік 
ұстанымына тəуелді.  Адамның ұстанымын, бағдарын ең бірінші кездесуде 
айқындауға болады. Егер сіз ақкөңіл, ақжарқын болсаңыз , демек 
айналаңыздағы адамдар да сондай деген сөз.   
Трансакциялық талдау - бұл əркім өзіне сенуге, өздігінен ойлауға, 
тəуелсіз шешім қабылдауға жəне өз сезімдерін ашық білдіруге үйренеді 
деген тұжырымға негізделген мінез-құлықты түсінудің ұтымды əдісі.  Оның 
қағидаларын жұмыста, үйде, мектепте, көршілермен - адамдар адамдармен 
қарым-қатынас жасайтын кез келген жерде қолдануға болады. 
Трансакциялық талдау мыналарды қамтиды:  
• Құрылымдық талдау - жеке тұлғаның құрылымын талдау. 
• Мəмілелерді талдау - адамдар арасындағы вербальды жəне вербальды 
емес өзара қатынастар. 
• Психологиялық ойындарды талдау, қажетті нəтижеге əкелетін 
жасырын транзакциялар - жеңіске жету.  
• Адам еріксіз ұстанатын жеке өмір сценарийінің сценарийін 
талдау.(Скрипт анализ) 
 Қысқа мерзімді психокоррекциялық жұмыстарға арналған топтық 
жұмыста транзакциялық талдау тиімді.  Трансакциялық талдау клиентке 
бейсаналық мінез-құлық үлгілері мен қалыптарының шеңберінен шығуға, 
мінез-құлықтың басқа когнитивті құрылымын қабылдау арқылы ерікті 
еркін мінез-құлық мүмкіндігін алуға жағдай жасайды. Маманның 
басшылығымен транзакциялық немесе транзакциялық талдау сіздің 
өміріңіздің қалай дамитынын түсінуге көмектеседі. Оның жасаушысы Эрик 
Берннің айтуынша, əр адамның балалық шағындағы санасында оның 
өмірлік сценарийі қалыптасады. Оны адам көптеген жылдар бойы 
ұстанады. Бұл көптеген проблемалардың тамыры. Егер сізге бірдеңе дұрыс 
емес болып көрінсе, психологқа жүгінуден қорықпаңыз. Мүмкін 
транзакциялық талдау сессиясы сізге жағдайды түзетуге көмектеседі. 
Р. Блейко мен Д. Мутонның басқару теориясы . Америкалық 
зерттеушілер Р. Блейк пен Д. Мутон кез – келген басқарушы əрекетті екі 
өлшеммен өлшеуді ұсынды – өндіріске көңіл бөлу мен адамдарға қамқор 
болу. Өндіріске көңіл бөлу -  ол басшының көптеген сұрақтар жүйесіне 
қатынасы, яғни кадрлар таңдауда, адамдарды ұйымдастыруда, өндірістік 
үрдістерде жəне шығаратын өнімнің көлемі мен сапасына қатысты шешім 
қабылдауда тиімдісін таңдау болып саналады. Адамдарға қамқор болу 
жұмысшылардың мақсаттарына жетуіне, өзіне құрметпен қарауда, 
жауаптылықты дамытуда, жақсы еңбек жағдайын туғызуда, тұлға аралық 
жақсы қатынастарда болуды меңзейді.  

Т. Кононың ойынша  басқарудың жаңашыл – талдаушы типі ұйымға 
нарықтық бəсекелестіктің ең қатты кезінде де дамуына үлес қосатын тиімді 
үлгісі болып саналады. Ол өзіне келесі менеджерлік тəртіп элементтерін 
қамтиды: 
- ұйымға берілгендік; 
- қуаттылық жəне жаңашылдық; 
- жаңа ақпараттармен идеялардағы шапшаңдық: 
- көптеген идеялар мен жаңалықтарды жалпыландыру; 
-  шешімді тез қабылдау; 
- топтық əрекеттерді сəйкестендір; 
- мақсаттарды таңдаудағы нақтылық; 
- басқалардың пікірімен санасушылық: 
- сəтсіздіктерге шыдамдылық.  
Басқарудың негізгі функциялары:  
Жоспарлау - ұйымның мақсаты қандай болу керек жəне алға қойған 
мақсатқа қол жеткізу үшін ұйым мүшелері не істеу керек, соны анықтайды. 
Ұйымдастыру - ұйымның барлық бөлімшелері арасында тұрақты жəне 
уақытша өзара қарым-қатынастарды орнатуға, ішкі тəртіпті жəне оның 
шарттарын анықтауға негізделген. 
Мотивация - ұйым мақсаты мен жеке мақсаттарына қол жеткізуі үшін 
өзін жəне басқаларды қызмет етуге ұйытқы болу процесі. 
Бақылау - жалпы алғанда нақты қол жеткізген нəтижелерді 
жоспарланған көрсеткіштермен салыстыру.  
Басқарудың бастапқы нүктесі ұйымдастырушылық мақсаттардың 
айқындалуы болып табылады. Мақсат – бұл топқа біріктірілген, 
қызметкерлердің ортақ күштері арқылы қол жеткізілетін нақты жай-күй 
немесе нəтиже. 
Басқару психологиясының  көздері: 
а) басқару тəжірибесі; 
б) психологиялықғылымның дамуы; 
в) ұйым əлеуметінің дамуы.  
Басқарудың дəстүрлі моделі басқарушының назарын тек 
экономикалық мақсаттарға көздеген еді. Жаңа модель экономикалық жəне 
əлеуметтік салалардың бірорталықтануын көрсете келе, назарды 
басқарушының мақсаттар шеңбері мен əлеуметтік мақсат -міндеттерге 
аударады – жұмысбастылықты қамтамасыз ету, еңбек жағдайын 
ізгілендіру, басқаруға қатысуды кеңейту жəне т.б. 
Қызметкерлермен жұмыс жүргізу барысында басқарудың 
стратегиялық тұжырымдамасының орталығында ұйым үшін ең басты 
құндылық болып саналатын адам тұрады. Мазмұны бойынша 
қызметкерлерді басқарудың жаңа стратегиялық тұжырымдамасы төмендегі 
қағидаларға негізделген: 
- əлеуметтік инновациялар да психологиялық сияқты маңызды; 

- қызметкерлердің үйлестірілген белсенділігі өзара түсінушілік 
негізінде туындайды; 
- ортақ мəселелер қызметкерлердің бірлескен күш салуы арқылы 
шешіледі; 
- жұмыстың кооперативті стилі басым болуы қажет.  
Басқарудың дəстүрлі моделі басқарушының назарын тек 
экономикалық мақсаттарға көздеген еді. Жаңа модель экономикалық жəне 
əлеуметтік салалардың бірорталықтануын көрсете келе, назарды 
басқарушының мақсаттар шеңбері мен əлеуметтік мақсат-міндеттерге 
аударады – жұмысбастылықты қамтамасыз ету, еңбек жағдайын 
ізгілендіру, басқаруға қатысуды кеңейту жəне т.б. 
 Қызметкерлермен жұмыс жүргізу барысында басқарудың 
стратегиялық тұжырымдамасының орталығында ұйым үшін ең баст ы 
құндылық болып саналатын адам тұрады. Мазмұны бойынша 
қызметкерлерді басқарудың жаңа стратегиялық тұжырымдамасы төмендегі 
қағидаларға негізделген: 
- əлеуметтік инновациялар да психологиялық сияқты маңызды; 
- қызметкерлердің үйлестірілген белсенділігі өзара түсінушілік 
негізінде туындайды; 
- ортақ мəселелер қызметкерлердің бірлескен күш салуы арқылы 
шешіледі; 
- жұмыстың кооперативті стилі басым болуы қажет.  
Басқарушылық қызметтің синтетикалық табиғаты жеке-біріккен 
ретінде қызметтіңайрықша, спецификалық түріне жататындығын ғана 
анықтамайды, сонымен бірге оның негізгі психологиялық  ерекшеліктердің 
қатарының болуын белгілейді. А.В.Карпов оларға келесілерді жатқызады: 
1. Басқарушылық қызмет тікелей емес, белгілі бір ұйымның қызмет 
етуінің соңғы нəтижелерімен байланысты салдарлы байланысымен 
сипатталады. Аталмыш белгі бойынша басқарушылық қызмет атқаруышыл 
қызметтен ерекшеленеді. 
2. Басқарушылық қызмет өз заты бойынша өте айрықшаланған. Оның 
пəні ретінде адамдар, тұлғалар сияқты өте ерекше заттар болып табылады. 
Басқарушылық қызметтің ерекше болуы оның пəні (ықпал ету объектісі) 
субъектілер болып табылатындығында. Осыған байланысты басқарушылық 
қызметтің қызықты ерекшелігін атап өткен жөн. Ондағы еңбек объектісі 
мен субъектісі өз ұйымының күрделіл ігі бойынша бірдей ғана емес, 
сонымен қатар өздерінің негізгі, яғни психологиялық ерекшеліктері 
бойынша да ұқсас болып табылады. 
1. Менеджмент - бұл нарықтық экономика жағдайында өндірісті тиімді 
басқарудың теориясы мен практикасы. Менеджмент ағылшын сөзі, оның 
түпкі түбірі гректің «Манус» сөзінен шығып «қол, күш» деген мағынаны 
білдіреді. Алғашында мал бағу саласында оны ұстау, меңгеру шеберлігін 
білдіреді. Ол адам қызмет саласына ауысып, адамдарды басқарудың жəне 

ұйымдастырудың ғылыми практикалық мəнін білдіретін болды. Ағылшын 
тілінде Ocsford сөздігінде бұл ұғымға мынадай түсініктер беріледі: 
А) Адамдармен қарым- қатынас жасау əдісі.  
Ə) Билік жəне басқару өнері. 
Б) Шеберліктің ерекше түрі жəне əкімшілік дағды. 
В) Басқару органы əкімшілік бөлігі. 
Менеджмент бұл нақты мақсатты жүзеге асыру үшін кəсіпорын 
жұмысын басқаруға жəне ұйымдастыруға байланысты адамдар қызметінің 
түрі. Американ экономисті Леотивтің анықтамасы бойынша менеджмент 
бұл - өнім, технология ,өндірісті ұйымдастыру басқару еңбегі, əлеуметтік 
қатынас саласында жаңарту, иновациялау, жаңалық мақсатында 
фирмаларды, компанияларды тиімді басқару принцптерін тəсілдер мен 
формалардың жиынтығы. Сонымен менеджменттің бастапқы ұғымы бұл 
басшылық. Іскер кəсіпорындар тек менеджер арқылы əрекет ете алады. 
Жеке кəсіпорын өзінің құқықтық формаларына қарамастан басшылығы 
болу тиіс. 
Менеджер деген сөздің өзі ағылшын тілінен шыққан ол бір нəрсені 
реттеу, бір нəрсені меңгеру, басшылық ету деген сөз. Менеджер ең кең 
тараған түрі. Ол басқару түрі эконом икамен шұғылданатын заң жəне 
басқада мəселелерді жақсы білетін адам. 
Барлық менеджмент үшін олардың қызмет орнына қарамастан ортақ 
қызмет болады.  
А) Менеджер іскер кəсіпорын мақсатын орындайды.Сол мақсатын 
орындау үшін не істеу керектігін ойластырады.  
Ə) Менеджер ұйымдастырушы болуы қажет. 
Б) Менеджер көтермелу шараларын қамтамасыз ететін тығыз байланыс 
орнатады. 
В) Менеджер ұйым іс- əрекетін талдайды, нормалауды белгілейді. 
Г) Менеджер адамның қызмет жағынан кемелденіп, жоғарлатуын 
қамтамасыз етеді. 
Шаруашылықтың түйінді орнында жұмыс істейтін кез келген адам да 
менеджер. Менеджер адамдарды жұмысқа ынталандырады, бағыттайды, 
ұйымдастырады. Оның бірден-бір құралы-жазбаша немесе ауызша сөзі; 
немесе цифр тілі. Менеджердің жұмысы техникаға, есептеу 
операцияларына немесе өнім сатуға қатысты болғанына қарамастан, оның 
жұмысының тиімділігі тыңдау жəне оқу, айту жəне жазу қабілеттеріне 
байланысты. Ол өз ойын басқа біреулердің санасына жеткізе білуі, сондай-
ақ басқа адамдардың да пікірін айқындай алуы тиіс. 
Менеджерлік шеберліктің маңызды жақтарының бірі-келіссөз жүргізе 
білуі-əріптесінің мүддесін өз  мүддесіне сəйкестендіре білетін  өнері болуы 
тиіс. Мұның өзі əсіресе қарамағындағы адамдарға  əкімшілік билік жүргізе 
алмайтын басшылар үшін де, сондай-ақ сырттан шикізат жеткізушілермен 

қарым-қатынас орнату үшін де аса қажетті жағдай. Басқару типі ретінде 
менеджменттің негізгі белгілеріне мыналарды жатқызуға болады: 
1.Адам, оның қажеттіліктері, мүдделері, уəждері (мотивы), 
құндылықтары, нұсқамалары басқаруды ұйымдастырудың бастапқы сəті 
мен оны жүзеге асырушы болып табылады. 
2.Басқарудың тəсілдемесінде, принциптерінде жəн е əдістерінде 
экономикалық құралдар мен басқару əдістеріне артықшылықтар беріледі. 
Бұл əсіресе маркетингте – тұтынушылардың мүддесін алдыңғы орынға 
қоятын басқаруда жиі білінеді. 
3.Менеджермен қызметкерге қойылатын басты талап ретінде көрінетін 
кəсіби тұрғыдан басқару менеджментке  тəн. Менеджер экономикалық жəне 
əлеуметтік – психологиялық білімдерді игеріп оқуы керек. 
4.Ұйымдастыру ісінде менеджментке жағдайдың өзгеруіне қарай жəне 
инновациялық типті ұйымдастыруда, яғни жаңашылдыққа жылдам 
бейімделе алатындай басқаруды икемді ұйымдастыру тəн. 
5.Менеджмент менеджердің жеке басына қойылатын талаптардың 
кешенін танытуы керек. Олардың ішіндегі не гізгілері-тапқырлық, 
байланысқа бейімділік (коммуникабельность), сенімділік. 
2. Америкадағы менеджмент ерекшеліктері 
Американдық менеджменттің негізгі ерекшеліктері XIX-XX ғасырлар 
аралығында қалыптасты, ол кезде ірі иерархиялық құрылымдарды құру 
кезінде орындаушылық жəне басқару еңбегінің бөлінуі болды. Осы кезеңде 
менеджердің кадрлармен басқарушы ретіндегі негізгі функциялары 
белгіленді, осындай маманның рөлінің маңыздылығы жəне оның əрбір 
ұйымның штатында қажеттілігі айқын болды. 
Американдық менеджмент п ен менеджерлердің негізгі 
ерекшеліктерінің бірі - іскерлік белсенділік, яғни жоғары іскерлік жəне іс 
жүргізе білу. Осыған байланысты персоналды таңдаудағы басты қағидаттар 
– табандылық, мақсаткерлік, басталған істі логикалық соңына дейін жеткізе 
білу. Қазіргі заманғы американдық менеджменттің барлық өкілдеріне тəн 
тағы бір маңызды ерекшелігі – табысқа ұмтылу. Америкалық менеджердің 
кез келген істің алдында қоятын қисынды мəселесі: «ал бұл кəсіпорын 
маған қандай да бір табыс əкеле ме?» Менеджменттің сипаттам асына 
айналған американдық іскерліктің тағы бір көрінісі -сандық бағалауды 
сауатты жүргізе білу, яғни барлығын санау. Егерде жаңа кəсіпорын ашу 
керек болса немесе оны дамыту қажет болса əрбір менеджер оның барлық 
теріс жəе оң жақтарын бағалап,шығындар мен тиімділікті дұрыс санай білу 
қажет. Америка менеджментінің ұлттық ерекшеліктеріне, сондай-ақ оның 
барлық өкілдерінің сөз мен істің бірлігі жатады. Америкалық басқарушылар 
үшін келісім-шарт пен қол қойылған міндеттемелер - бұл шын мəнінде 
қасиетті. 
Қазіргі заманғы американдық менеджменттің сөзсіз жетістігі кез -
келген кəсіпорын үшін дұрыс ұйымдық құрылымды таба білу болып 

табылады. Компаниядағы қызметкердің алдына тек қана ортақ мақсат 
қойылады, оның жеке мұқтаждықтары ескерілмейді. Басқарушылардың 
ұйымдастырушылық қабілеті тұрғысынан американдық менеджменттің 
тағы бір ерекшелігі – кəсіпорынның иелігінде бар мақсаттар мен ресурстар 
санын байланыстыру қабілеті. Осыған байланысты кəсіпқойлықтың басты 
белгісі - кадрлық, уақытша, материалдық жəне қаржы ресурстарының талап 
етілетін көлемін бағалай алмау.  
Мəселен, американдық іскерліктен бастайық. «Тиімділік» ұғымының 
өзі түсінікті жəне іскер тұлға ретінде сипатталады. Бірақ Америкада оның 
бірнеше ерекше белгілері бар. Бұл көріністі қызметк ерлердің мақсаты 
ретінде айтуға болады, яғни қызметкерлер əрдайым табандылықпен 
бастаған ісін аяқтайды. Осыдан кейін американдық менеджментте MBO 
(Management By Objectives) тұжырымдамасы өте дамыған. «Пайда ауамен 
дем алмаса да, ол іскери əлемде дем алады. Еңбекқор американдықтар кез-
келген іс тиімді болуы керек деп санайды, яғни ақша уақыт жəне көңіл-күй 
арқылы келеді деп ойлайды». Осы сөздерден кейін американдықтардың 
істің егжей-тегжейін түсінуге, түрлі тəсілдерді табуға, түрлі елдердің 
тəжірибесін зерттеуге деген ықыласы түсінікті. Сондай-ақ «үш іскерлік 
ереже» бар: 
1) өзін ақтап, не табыс əкелетінін анықтау; 
2) қойылған мақсатқа жетудің ең тиімді тəсілдерін таңдау; 
3) қажетті ресурстарды табу жəне барынша тиімді пайдалану. 
Сонымен қатар америкалық менеджерлер санау жəне бағалауды 
алдыңғы орынға қойған. Олар əрқашан өз ісінің оң жəне теріс жақтарын, 
шығындары мен табыстарын табуға тырысады. Американдық іскерліктің 
басқа белгісі - сөз мен істің бірлігі. Американдықтар ешқашан өз сөзін 
бұзбайды. Егер ол уəдесін орындамаса, онда мұндай менеджерге сенім 
жоғалады, яғни бұл американдықтар үшін киын мəселелердің бірі. 
Персоналдың құзыреттілігін қамтамасыз ету дегеніміз менеджментті 
жетілдіру индустриясының дамуын көрсетеді. Бұл белгіні персоналды 
даярлау жəне біліктілігін арттыру, сондай -ақ оқыту технологияларын 
дамыту жүйесінде табуға болады. Институттардың 4 түрін бөліп көрсету 
керек: 
1. Менеджмент мектебі; 
2. Жоғары оқу орындарындағы менеджмент факультеттері; 
3. Кəсіби қоғамдар; 
4. Консультативтік фирмалар.  
Европадағы менеджмент ерекшеліктері 
Менеджменттің пайда болуы мен дамуына Макс Вебердің (1864-1920) 
«Шаруашылық тарихы» жəне «Протестанттық этика жəне капитализм 
рухы» кітаптарындағы капиталистік өндірістегі протестантизм этикасы 
бастауын талдауы негіз болды. Ол капиталистік өндіріс құрылымында 

еңбек бөлінісін оңтайландыру идеясы жатыр деп есептеді. Ол «əрекеттің 
мінсіз типі» түсінігін енгізіп оның 4 түрін қарастырады: 
А) дəстүрлі; 
Б) аффективті; 
В) құндылықты – оңтайландырылған; 
Г) мақсаттандырылған. 
Менеджменттің негізін салушы еңбектерінің бірі ретінде француз 
инженері, оқымыстысы, кəсіпкері, əкімшілік басқару мектебінің негізін 
қалаушы Анри Файольдың (1841-1925) еңбектері саналады.  Ол 20 жыл 
көлемінде тау – кен жəне металлургиялық компаниясының директоры 
болды. Ол « Жалпы жəне өндірістік əкімшілік» жəне « Менеджмент негізі» 
жұмыстары арқасында еуропадағы ғылыми менеджмент бағытындағы 
белгілі тұлға болды. Файол бірінші жəне толық менеджмент теориясының  
авторы. 
Файол басқаруды жоспарлау, ұйымдастыру, мотивациялау, бақылау 
сияқты бірнеше байланысқан функциялардан тұрады деп есептеген. Ол 
компанияның құрылуына себепші  жоспары болуы керек деп  есептеген: 
- Фирма қорлары (капитал, ғимарат, шикізат, болдыру жүйесі, даңқ) 
- Бітпеген өндірістің маңыздылығы жəне құрам есебі; 
- Техникалық, қаржылық, коммерциялық жəне басқа шарттарға тəуелді 
болашақ беталысы. 
Басқарушы əрекеттегі ұйым қарастырылады жорамалдайды: 
- Жоспардың тыңғылықты өңделуі жəне орындалуын қатаң қадағалау; 
- Өндірістің кадрлық жəне материалдық құрамдас бөлігі фирма 
мақсаттарына, қорлары мен қажеттіліктеріне сəйкестігін бақылау.  
Файоль басшының жұмыс бастылығы негізінде бір бастықтың 
бақылауындағы қызметкерлер санымен көрсеті летін тиімді «бақылау 
диапазоны» сияқты белгіні ұсынды. Ол бірінші болып өндірістегі 
менеджмент психолгияға негізделгенін, өндірісте жұмысшы мен басшы 
арасында психологиялық қатынас барын анықтап, басшы өкілеттілігіне 
«бұйрық беру жəне қоластындағылардың бағыныштылығы» мен 
менеджердің тікелей кіретінін қарастырды. Ол Тейлорға қарағанда шешім 
қабылдау басшылықтың артықшылығы ретінде санамады. Оның бұл 
көзқарасы «өкілеттілікті табыстау» принципінің таралуына себеп болды. 
Ол оқу орындарында менеджментті үйретуге, оны зерттеуге ұсынды. Ол 
бірінші болып ұйымның сəтті жұмыс істеуіне менеджерлердің жеке – 
психологиялық ерекшелігі көп əсер ететініне көңіл аударды. 
Еуропалықтардың түснігінше, менеджер қазіргі тəсілдерді 
басшылыққа ала отырып, нақты жұмысты ұйымдастыратын адамдар. 
Жапониядағы менеджмент ерекшеліктері 
Жапонияда сол жапондықтардың өздері айтпақшы бір-ақ байлық бар-
ол адамдар. Тек соларға ғана сүйеніп, елдің билеуші топтары «кедергілер 
жарысында» жеңіске жете алады. Басқарудың жапондық стилі – бірегей. 

Жапондық стильге тəн нəрсе – басқарудың Коноске Масуцити принципі. 
Оның ең бастысы қызметшілерді басқара білу принципі. Жапонияда тек 
Масуцити ғана экономикалық механизмнің түйінді элементі ретінде 
адамдармен қарым-қатынас жасаудың барлық нəзік жақтарын терең, жан-
жақты зерттеу қажеттігін мойындады. Бірақ мұнда басқаруды бақылаудың 
сенімді, жолға қойылған жүйесі қалыптасқан.Масуцити идеясы бойынша 
жапондық басқару жүйесінің үш түрі қалыптасқан: адам -қаржы-
технология. Технология тəуелділік жағдайда, ал бірінші орында 
қызметшілер.«Масуцити дэнки» компаниясында жұмыскерлерді даярлау 
жүйесі, біріншіден, кəсіптік білімді оқытудан, екіншіден, фирмалық мінез-
құлық кодексін игеруден тұрады. Фирмалық мінез -құлық кодексін 
менгергеннен кейін, жаңадан қабылданған жұмыскерлер арнайы сабаққа 
қатысып, онда оларға былайша сендіреді: «Егер сен кездейсоқ қателік 
жіберсең, фирма сені кешіреді. Егер сен фирманың моральдық  кодексінен 
тайсаң, саған кешірім жоқ». 
Жапонияда қызметшілерді басқару нақтылы, көбінесе дəстүрлі 
тəсілдермен жүзеге асырылады. Оның ең бастылары: жұмыскерлерді ұзақ 
мерзімге, өмір бойы жалдау, жасына қарай еңбек ақы төлеу жəне қызметін 
жоғарылату болып саналады. Осының арқасында жапондықтар ұзақ уақыт 
бойы жұмыссыздықты барынша азайтып отыр. Кандидаттарда қателікке 
жол бермес үшін таңдау мұ қият жүргізіледі. «Масуцити — дэнка» 
концернінде кондедатураларды іріктегенде өлшемдік куəліктермен жəне 
өмірбаяндық деректермен танысып қана қоймайды. Концернге алынатын 
кадрлардың оқу орнын бітірген дипломымен жəне ондағы емтихан 
бағасымен танысып қоюы жеткіліксіз – олар дауысқа түсуге құқысы бар 
құжаттармен, салықтарды төлегені туралы куəліктермен семясын тексерген 
актімен мұқият танысып шығады. Мұндағы мақсат кандидаттың жеке 
сапасын, оның мінез құлқын, бейімділігін, ынта жігерін білу. Əсіресе 
кандидаттардың кəсіпорын ұжымына психологиялық үйлесімділігіне 
ерекше зор көңіл бөлінеді. Жұмысшылар кондидатурасын іріктеген, 
олардың жұмысқа төзімділігін, көз өлшемінің дұрыстығын 
тексереді.Кадрлар бəрін шешеді – Бұл жапондық корпорациялар үшін ұран 
емес, кəсіпорынның табысты болуын қамтамасыз ететін алғы шарт. 
Шешім əзірлеу жəне қабылдау. Қазіргі Жапонияда шешім əзірлеу мен 
қабылдау менеджментін маңызды саласы болып саналады. Шешім 
қабылдаудың жапондық жүйесі ұлттық дəстүрлерге жапондардың 
этнопсихологиялық ерекшеліктеріне олардың əлеуметтік құндылығына 
негізделген.Жапонияда шешім қабылдаудың елеулі ерекшелігі – келісу 
принципі. Европалықтардың шешім қабылдау тəсілінен айырмашылығы – 
жапондықтар əуелі мəжілістер мен ресми емес келіссөздерге түйінді 
мəселелерді көпшілік дауыспен шешіп алады. Олардың пікірінше, мұндай 
процедура бірауыздылыққа келісіп əрекет жасауға ықпал етеді. 

Еңбекақы жəне жасына қарай қызметінің жоғарылауы. Жапонияда 
жасының үлкендігіне қарай ақы төлеу қабылданған оны «нэнко сэйдо» деп 
атайды.Жұмысқа орналасқан жұмысшы немесе қызметші фирмамен келісім 
жасайды. Жұмысқа жаңадан орналасушының міндеті: «Барлық күш -
қайратын еңбекке жұмсау». Фирма қауымдық құрылысқа негізделген бала 
ата-анасының борышын қалай өтесе, жұмыскерлер де табан ет маңдай 
термен фирмаға өз борышын солай өтеуі тиіс.Жапон менеджменттеріне тəн 
сипат фирманың корпоративті рухы мұның өзі өмірлік жалданатын 
жұмыскерлердің, олардың еңбекақысының, жасының ұлғаюына қарай 
қызметінің жоғарылауына қарай, шағын топтар психологиясын сіңірудің 
тегеурінді күші болып саналады. 
Қазақстандағы менеджмент ерекшеліктері 
Менеджмент туралы сөз болғанда біз ең бірінші Əбу Нəсір Əл -
Фарабиді еске аламыз. Əбу Нəсір Əл-Фараби (870-950 жж.) ғылымның əр 
алуан саласында аса маңызды, құнды пікірлер, тұжырымдар қалдырған 
кемеңгер ғалым, данышпан ойшыл, энциклопедист адам болған. 
Қазақстанда менеджмент негіздеріне арналған оқу құралын ең бірінші 
1992 жылы ағылшын ғалымдарының теориясын негізге ала отырып, Орал 
ауыл шаруашылығы институтының профессоры К.Ғ.Ахметов жазып 
шығарды. Осыдан кейін басқару академиясының профессоры 
К.Б.Бердалиевтің басшылығымен «Басқару негіздері» оқулығы баспадан 
шықты. 
Қазіргі жағдайда республиканың мектептерінен бастап, барлық 
жоғары жəне орта білім беретін оқу орындарында менеджмент негіздерін 
оқытып, үйрету бағдарламаға енгізілді. Оның себебі нарықтық экономикада 
өндірістің тиімділігін арттырып, өнім өндіріп, оны сатып, пайда келтіру 
үшін, тұтынушылардың сұранысынан шығатындай тауар жəне қызмет 
ұсыну тек қана кəсіпорынды басқарудың барлық қыр-сырын толық білген 
жағдайда ғана мүмкін. Сондықтан да елімізде менеджмент теорияларын 
жан-жақты меңгеріп, оны өмірде қолдана білу кездескен жағдайларға 
байланысты шешім қабылдауға бейімделіп, менеджментті дамыта  түсу 
əрбір басшының міндеті. 
Республикамыздың нарықтық экономикаға өтуіне байланысты барлық 
кəсіпорындарда «менеджер» қызметі пайда болып, қазіргі менеджерлер, 
бұрынғы жоғарыдан бұйрық арқылы ғана өз міндетін орындайтын басшы 
емес, əр істің басы-қасында болып, ұйымның барлық деңгейіндегі іс-
əрекеттерге қанық, іс жүзінде болып жатқан жағдайларды талдау арқылы 
шешім қабылдап, оны жүзеге асырушы маман, қызметкерлер. Ондай 
қызметкерлер менеджмент негідерін толық меңгерген, менеджерге 
қойылатын талаптарды нақты білетін, басқаруда бар теориялармен ғана 
шектелмей, ой-өрісі жоғары, жаңашыл, кез-келген тұйықтан шығатын, 
тапқырлық қасиеті мол, жедел шешім қабылдауға қабілетті адамдар болуы 
тиіс. 

Əлемнің түрлі елдеріндегі менеджменттің тарихи дамуымен ұлттық 
басқару модельдері пайда болды. Қазіргі уақытта басқарудың 2 басты 
полюсі бар: жеке жауапкершілікпен жəне қызметкерлердің тар 
мамандануымен ерекшеленетін американдық менеджмент жəне 
иерархиялық басқару жəне əрекеттер мен бақылауды үйлестіретін 
жапондық менеджмент. Кейбір елдер  американдық менеджерлердің 
тəжірибесін пайдаланды, ал олардың кейбіреуі жапон менеджерлерінікін 
қолданды, бірақ барлық елдерде өзіндік ерекшеліктері, жағымды жəне 
жағымсыз жақтары бар өздерінің менеджмент моделін құра бастады. Бұл 
үдеріс қазақстандық менеджментке де əсер етті. 
Қазіргі қазақстандық менеджмент моделін қалыптастыруға нақты 
өңірдегі тарихи процестер мен оның халқының мəдениеті əсер етті. 
Тəуелсіздік күнінен бері 20 жылдан астам уақыт өтті жəне осы қысқа мерзім 
ішінде қазақстандық менеджмент моделінің ерекшеліктері қалыптасты. 
Қазақстанның басқару ойлары тарихының тамырлары ғасырлар 
қойнауынан бастау алады. Жүздеген жылдар бойы басқару ойы біртіндеп 
жетілдірілді. Менеджментке деген қажеттілік адамның жəне оның біріккен 
қызметінің пайда болуына байланысты туды. Мемлекетті басқару жөнінде 
біздің еліміздің дамуының əрқилы кезеңіндегі əртүрлі міндеттер 
өткенімізге үлкен əсер етті жəне бүгінгі күні де Қазақстанның басқару 
ойының қалыптасуы мен дамуына ықпалын тигізуде. 
Қазіргі заманғы менеджменттің қалыптасу тарихы мен дамуын ХХ 
ғасырдың 50-ші жылдарынан бастап қарауға болады. Алғашқы қазақ 
инженер-менеджері, өндірісті ұйымдастырушысы Қ.И. Сəтпаев (1889-1964) 
болды. Ол бірінші кеншілердің еңбек өнімділігі мен адамдардың еңбекке 
деген мотивация мəселеле рін, жұмысшылардың, кəсіподақтардың 
кəсіпорындармен жəне Балқаш пен Жезқазғанның тау -кен байыту 
комбинаттарындағы еңбек процестерімен байланысты сұрақтарын шешті. 
Оның басқару стиліне тəн ең маңызды ерекшелік, ол зерттелінетін нақтылы 
материалдарды терең ғылыми жүйелеу мен жалпылау болатын. Бұл жерде 
нағыз білгірдің əдеттен тыс басқару ойы көрінеді. 
Мектептегі басқару жүйесі 
Педагогика ғылым мен тəжірибеде тұтас педагогикалық процесті 
басқару ғылыми тұрғыдан қарастырып, оған қатаң ғылыми негізделген 
сипат беруге деген ұмтылыс күшейе түсуде. Шындығында басқару тек 
техникалық жəне өндірістік процестердеғана емес, сонымен бірге 
педагогика сияқты күрделі əлеуметтік жүйе үшін де қажет.  
Мектеп жұмыстарының ішінде ең басты мəселелердің бірі – 
педагогикалық ұжымға ғылыми тұрғыдан сауатты басшылық жасау қажет. 
Мектеп жұмысын меңгкріп, зор жауапкершілікпен жүзеге асыратын тұлға 
директор жəне оның оқу-тəрбие жұмысы жөніндегі орынбасарлары. Олар 
өздерінің міндеттерін педагогикалық ұжыммен ынтымақтасып, 
демократиялық принцип негізінде іске асырады.  

Мектепті басқарудың əдістемелік негіздері, заңдылықтары:  
1. Талдау. Мектептің оқу-тəрбие үрдісінің нəтижесіне сараптама 
жасау. 
2. Жоспарлау. Басқарудың мақсаттылығы, мектеп алдындағы 
басқарудың бағытты жұмысы. Мектеп ісіне тереңдей қанық болған сайын 
оның күнделікті қызметінің бағыты айқындалып, қорытынды нəтижесі 
ашылады.  
3. Ұйымдастыру. Басқаруды демократиялық (жариялылық) негізде 
құру.  
4. Бақылау. Басқарудың бұқарашылдығы. Басқару барысында 
мұғалімдерді қосу жəне оқушыларды өзін-өзі тəрбиелеуге дағдылау.  
 Мектеп директоры, оның оқу-тəрбие, əдістемелік жəне ғылыми 
жұмыстарды басқаратын орынбасарлары ұжым пікірі жəне оның 
қорытындылары негізінде педагогикалық кеңестің мəжілісінде оқу, 
сабақтан тыс пəндік жəне тəрбие жұмыста ры бойынша жинақталған 
талдаулар жөнінде пікір алысады. Бұл, əрине барлық қатысқан сабақтар мен 
үйірме жұмыстарының тізбесі емес.  Міндет күрделірек: оқу-тəрбие 
жұмысында болып жатқан жағымды, жағымсыз жəйттерді анықтай талдап, 
жағымдысын дамытып, жағымсыздарын жою жолдары белгілену керек. Бұл 
мектепте психологиялық ахуалды жасауға, педагогикалық ұжымды белгілі 
əдістемелік көзөараста тəрбиелеуге, оқытудың барасын жақсарту (қолайлы) 
жолдарын, əдістерін табудың дұрыс жолдарын таңдауда мүмкіндік береді.  
Республикада білім беру жүйесі қоғамдауымен байланысты дамып, 
жетіліп отыруы анық. Қазіргі уақытта мектеп рефрмасына көптеген 
біржақты өзгерістер енгізіліп, мектеп ісінің ішкі-сыртқы жүйесі түгелімен 
жаңаруда. Біз бүгінгі  күні əлемдік білім беру жүйесіне негізделген  басым 
бағыттарды ұстануда ең алдымен мұғалімдерді жаңаша оқытуға 
бағыттауымыз қажет. Дамыған елдерді білім беру жүйесіндгі  
тенденциялардың бірі – білім беруді басқарудың  тиімді жолдарының 
қарастырылуы. Білім саласында еңбек ететін адамдар дың басқару 
мəдениеті, олардың кəсіптік-педагогикалық мəдениетінің құрамды бөлігі 
болып табылады. Білім беру реформасы мұғалімнің жаңа мəртебесін – 
шығармашылық ой-өрісі кең, жаңа жағдайдағы жұмысқа əзір мұғалім-
зерттеушіні қалыптастыруды талап етіп отыр. Ол оқытуға бағытталған жеке 
басқа бағдарланған, өзіндік жəне білікті тəсілдерінің  əдістемелік негіздері 
мен оны іске асыру тетіктерін, пəн бойынша білім беру мазмұнының 
базалық, кəсіби деңгейін, өткізетін сабақтар мен бейіндік, бейін алдындағы 
курстарды əзірлеу əдістемелерін білу керек. Адами қасиеттерді дамыту, 
бала бойына сіңіру мен  қалыптастыруда мұғалімнің  алатын орны ерекше 
десек, мектеп басқарушылары  мұғалімнің қоғамдағы  белсенділігін 
арттыру үшін  кəсіптік мəрте бесі жəне əлеуметтік беделіне, 
шығармашылығына көңіл бөлу керек. Шығармашылықпен жұмыс істейтін 
мұғалімнің  құзыреттілігін қалыптастыру жағын кеңіне қарастырған жөн. 

Ұжымда əдістемелік жұмыстардың мазмұнын, жоспарын, іс -
шараларды жүргізу əдістерінің тиімділігін үнемі талдап отыру əдістемелік 
көмек көрсету жұмысын ары қарай жақсартуға жəне оны дамытуға 
мүмкіндік береді. Сондықтан білім беруді басқару жүйесінде келсідегідей 
жұмыстар үнемі назарда болу қажет:  
-жүргізілген іс-шараларға нақтылы баға беру, қабылданған шешім 
дəлелді болу, жұмысты дұрыс жоспарлау; 
-ұжымның жағдайы мен қажеттілігін ескеру; 
-əдістемелік жұмыстың кезеңдерінің тығыз байланыста болуы; 
-ұжымдық жəне жекеше жұмыс түрлерінің өзара байланыста дамуы; 
-мұғалідерді мазмұны мен түрі жағынан бір-біріне жақын іс-шараларға 
қатыстыру. 
Яғни, əдістемелік жұмысты ретке келтіруде оның қалыпты жағдайын 
зерттеп, ұйымдастырушылық құрылымын, мақсат, міндеттерді дұрыс 
анықтау қажет. 
Мектепті басқарудың құрылымының негізгі мақсаты: мекептегі 
педкадрларды диагностикалау арқ ылы кəсіби шеберлігі мен 
шығармашылығын дамыту болып саналады. Тұлғалық қасетін талдау, 
кəсіби біліктілік пен шеберлігін жетідіру, инновацияларды меңгеруге 
үйрету сынды мазмұндық сипатқа ие болмақ. Мектепті басқару 
құрылымының ұстанымдары: ынтымақтастық, ізігілік, тұлғалық бағдар, 
даралау мен саралау, тиімділік пен нəтижелілік болып табылады. Басқару 
айқындалған мақсатқа жету үшін соған сəйкес міндеттерді жəне оларды 
орыдаудың тиімді жолын  анықтап, жүзеге 
асыру қажет. 
 
 
 
 
    
      
 
 
 
 
 
 
Стратегиялық Тактикалық Оперативті Өзін-өзі басқару 
 
Педагогикалық кеңес: 
- Оқу жоспарын 
бекітеді; 
- Оқу жылының даму 
стратегиясы мен 
міндеттерін 
анықтайды; 
Ғылыми-əдістемелік 
кеңес: 
- Оқу-тəрбиеүрдісінде 
инновациялық 
ұжымдық 
жетекшілік 
ұйымдастырады; 
- Кешенді жобалар 
мен бағдарламалар 
жасайды;  
Директордың оқу-
тәрбие жөніндегі 
орынбасары:  
- Оқу-тəрбие 
үрдісін 
ұйымдастырады; 
- Оқу-тəрбие 
үрдісін 
жетілдіреді;  
- Оқушылардың 
білім деңгейін 
бақылайды;  
- Ақпараттар 
жинайды; 
Директордың тəрбие 
жұмысы жөніндегі 
орынбасары: 
Пəнбірлестігі 
жетекшілері 
(кафедра 
жетекшілері, 
мұғалімдер, 
сынып 
жетекшілері)  
- Білім 
бағдарламалары 
мен мемлекеттік 
білім 
стандартының 
орындалуын 
қамтамасыз етеді;  
- Оқу-
əдістемелік, 
кіріктірілген 
кешендерді 
Оқушылардың 
өзін-өзі басқару 
комитетінің 
қызметі. 
Оқушылар:  
- Мектептің 
өміріне тікелей  
атсалысады; 
-  Мұғалімдер 
еңбегін 
бағалауда өз  
көзқарасын 
білдіреді. 


 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
Мектепті басқаруда басшыларға жəне мұғалімдерге басқару əдебін, 
педагогикалық менеджмент қағидаларын, қарым -қатынас өнерінің 
психологиялық негіздерін жетілдіріп, оң шешеім қабылдауға, қызметті ішкі 
мотивация негізінде ұйымдастыруға баулу мазмұнында жаңа си паттар 
керек. Сөйтіп, мектепті басқару жүйесінде төмендегі құралдарды негізге 
ала отырып жұмыс жүргізу керек: педагогикалық менеджмент, озат 
тəжірибелер, маркетинг, рейтинг пен мониторинг, білім беру 
технологиялары. 
Деңгейлі бағдарламаны басшылыққа ала оты рып, педагогикалық 
басқарудың негізгі функцияларын таңдап алуға болады: жобалау -
жоспарлау, ұйымдастыру-үйлестіру, бақылау - сараптама жасау. 
Басқаруды ұйымдастыру басшы білігіне байланысты екенін ескере 
отырып, басқарудың барлық буынында менеджмент өнерін меңгеру, қазіргі 
педагогикалық инновацияның негізгі бағытынан хабардар болу қағидасын 
ұстану қажет. Мектеп қызметін жаңаша ұйымдастыру, əр мектеп 
басшысының өз деңгейіндегі басқару рөлін арттыру, оқушылардың, 
мұғалімдердің жəне мектептің қызметін бағалау тəсілдерін басқаша, тиімді 
негізде қайта құру, үрдіс пен нəтижеге сай қызметкерлердің кəсіби 
мəдениетіне, қызмет əдебіне, рухани-əлеуметтік жағдайына көңіл бөлу – 
мектепті басқару құрылымының негізгі қағидаларының бірі болып 
табылады. 
Қорыта келе айтарымыз мектепті қазіргі таңда жаңа талаптарға сай 
басқарғанда мектептің оқу-тəрбие үрдісінің сапасы артатыны сөзсіз. Демек, 

ғылым мен техниканың жедел дамыған, мəліметтер ағыны күшейген ХХІ 
ғасырда жан-жақты дамыған шығармашыл жеке тұлғаны қалыптастыру 
мектептің басты міндеті болып отыр. Сондықтан да, мектепті басқару 
жүйесінде басқарудың мəні мен негізгі принципткрін жетік ə рі нақты 
меңгере білу қажет. 
Бақылау сұрақтары:  
1. Менеджер қызметінің бес стилін сипаттап,  «менеджмент 
торын» құрастырған теорияларды сипаттаңыз. 
2. Басқару психологиясының зерттеу обьектісіне сипаттыңыз. 
3. ХХғ. бас кезінде басқару ғылымына үлес қосқан өкілдердің 
еңбегін тоқталыңыз. 
 

`},{id:"lecture-3",category:"lecture",shortTitle:"3-дәріс",title:"§ 3 Басқару ғылымының даму тарихы",pdfFile:"./assets/docs/3sabak.pdf",numPages:14,textHtml:`<h3 class="chapter-subheading">§ 3 Басқару ғылымының даму тарихы Басқару өте ежелгі тəжірибе болып саналады. Адамдар топтар мен ұйымдарға бірігіп, өмір сүре бастаған кезден басқару қажеттілігі пайда болды. Ерте кездегі Вавилонды, Египет пирамидаларын, Македонияны, Римді еске алатын болсақ, соның барлығы да үлкен үйлестіру, ұйымдастыру қызметтері арқылы жүзеге асырылған. Басқару-қызмет пен тəжірибе ретінде өте ежелгі сипатқа ие болғанымен, ғылым мен зерттеу саласы түрінде салыстырмалы түрде алғанда жаңа болып табылады. Басқару психологиясы - басқару жүйелеріндегі (мемлекет басқару, ұйым, мекеме, топ, ұжым жəне т.б.) адамдардың қатынастарына байланысты мəселелерді зерттейтін жəне білімдерді жинақ тайтын қолданбалы психологияның саласы. Ғылымның теориялық даму тарихын хронологиялық кесте арқылы талдап өтер болсақ, басқару теориясы мен практикасының дамуын бірнеше тарихи кезеңдерді бөліп көрсету болады. Менеджменттің даму кезеңдері: ü Ежелгі кезең (б.з.д. 9-7 мыңжылдықтан XVIII ғасыр аралығы) Басқару тəжірибелерінің жинақталуы ü Индустриальды кезең (1776-1890 жж.) Өнеркəсіптік революция кезінде менеджменттің туындауы ü Жүйелік кезең (1856-1960 жж.) Жинақталған тəжірибені жалпылау. Ғылыми мектептердің қалыптасуы ü Ақпараттық кезең (1960ж.-қазіргі уақыт) Басқару практикасында сандық əдістерді қолдану Басқару тəжірибелерінің жинақталуы. Шамамен б.з.д. 9-7 мыңжылдықтарда Жақын Шығыс елдерінде иемденуші қоғамнан (аңшылық, терімшілік) өндіруші қоғамға (өнімдерді өндіру, егіншілік) өту кезеңінде басқару төңірегінде белгілі бір білімдер туындап жинақтала бастады.Басқарудың бастапқы мəселелерін, жайттарын ежелгі египеттіктер шеше бастады. Бұл олардың пирамидалар құрылысын жүргізуімен (б.з.д. 4 мыңжылдық) байланысты болды. Құрылысқа көп адам жұмылдырылғаннан кейін олар адамдарды мақсатқа сəйкес ұйымдастыру, нəтижені жоспарлау жəне қадағалау керек екендігін түсінді.Шумер территорияларында табылған қыш кестелерден (сауда-саттық жəне елдің заңдары жөнінде мəліметтер жазылған) ежелгі гректердің басқарушылық тəжірибелерінің болғанын аңғаруға болады (б.з.д. 3 мыңжылдық). Вавилон патшасы Хаммурапи (б.з.д. 1792-1750 жж.) мемлекетті басқару заңдар нұсқасын жасады, өзінің жеке лидерлік стилін ойлап тапты, ең аз еңбекақы анықтаудың заңдық нормасын бекітті. Ассирия патшасы ІІ Навуходоносор (б.з.д. 604-562 жж.) текстилді жəне астық қоймаларында бақылау жүйесін ойлап тауып жəне оны дұрыс қолдана білді. Қытай ғалымы Сан Цу «Соғыс</h3>
<p>өнері» (б.з.д. 500 ж.) шығармасында ұйымның иерархиялық құрылымы, кадрлік жоспарлау, тұлға аралық байланысты ұйымдастыру керектігін көрсетті. Басқаруды қызметтің (адамзат іс-əрекетінің) ерекше сферасы деп алғашқылардың бірі болып сипаттама берген ежелгі грек философы Сократ (б.з.д. 469-399жж.) болды. Ол жақсы кəсіпорын иесінің, саудагердің, əскери басшының міндеттерін талдай келе, негізінен олардың бірдей екендігін айтты. Еңбек бөлінісі жөнінде алғаш рет айтты. Басты мақсат қажет адамды тиісті орнына қойып одан өз талабыңның орындалуын қадағалауда. Осылайша Сократ басқарудың əмбебап сипаты туралы идеяны тұжырымдады (Басқарудың əмбебап принципі). Идеальды мемлекеттің негізін қалаушы – грек философы Платон (б.з.д. 428-348 жж.) басқарудағы іс-əрекет қоғам өмірін қамтамасыз ету жүйесінің маңызды элементі болатынын дəлелдеді. Ол мемлекеттік басқару формаларын жіктеді, басқару мүшелерінің қызметтерін бөліп көрсетуге талпынды. Грек философы Аристотель (б.з.д. 384-322 жж) үй шаруашылығы туралы ілімнің негізін қалады. Оның негізінде құлдармен қарым-қатынас жасау дағдылары мен оларды басқару өнерін үйрететін «құдайлар ғылымын » («господская наука») дайындау қажеттілігі жатты. Қайта өрлеу дəуірінің өкілі Никколо Макиавеллидің (1469-1527жж.) əлеуметтік ойлау тарихына, басқару теориясы мен практикасына қосқан үлесі орасан зор. Ол алғашқылардың бірі болып азаматтық қоғам тұжырымдамасын негіздеді жəне «мемлекет» терминін қолдана бастады. өзінің «Государь», «Рассуждение о Тите Ливии» еңбектерінде жетекшінің стилі, жұмыс беруші мен бағынышты арасындағы өзара байланысты талқылайды. Макиавеллидің қазіргі заманғы əлеуметтік менеджменттің дамуына əсер еткен төрт қағидасы: • бедел сенушілердің қолдауына негізделеді; • бағыныштылар басшылардан не күтуге болатындығын білуі керек; • көшбасшының өмір сүруге деген еркі болуы керек; • көшбасшы əрқашан əділеттіліктің үлгісі болып табылады. Оның идеялары элиталардың (В. Парето, Э. Дженнинг, Г. Моска, С. Р. Миллс) заманауи социологиялық теориясына жол ашты, «Макиавеллистік қозғалысты» басқарған «басқарушылық төңкеріс» теориясының авторы Дж.Бернхаймға əсер етті. Макиавелли «қоғамдық келісім» идеясын алға тартты. Макиавелли тұлғасы əлеуметтану мен басқару тарихында маңызды орын алатындығы сөзсіз. Өнеркəсіптік революция кезінде менеджменттің туындауы</p>
<p>Менеджмент тарихы туралы білім жүйесі XIX ғасырдағы өнеркəсіптік революция кезінде пайда болды, қол еңбегін фабрикалық өндіріс жүйесіне ауыстырумен сипатталды. Фабрикалық жүйе - бұл өнеркəсіптік төңкерістен кейін кеңінен енгізілген жəне жаңа табиғи энергия көздерін пайдалануға, еңбек бөлінісін кеңейтуге жəне еңбек процесіне анағұрлым толық бақылауды енгізуге мүмкіндік беретін кеңейтілген кəсіпорындарды құрумен сипатталатын өндіріс жүйесі. Мамандандыру, өсіп келе жатқан механикаландыру жəне тауар нарығының кеңеюі фабрикалық жүйеге бұрыннан келе жатқан қолөнер өндірісінің дəстүрлі жүйесін қалдырып отыруға мүмкіндік берді. Бұл əсіресе XIX ғасырдың басындағы зауыттық əдісінің ең жарқын үлгісі болған тоқыма өнеркəсібінде айтылды. Басқару жүйесінің жалпы тұжырымдамалары. Қазіргі кездегі басқару теориясының дамуы ғылыми басқару мектебінің өкілдері еңбектерімен байланысты, олар Ф.Тейлор, Д.Гильберт, Г.Гант, Г.Эмерсон, Г. Фордт. Ф. Тэйлор ғылыми басқаруды көрсеткішт ер уақыт пен міндетті зерттеу, ұдайы сұрыптау жəне баулу, ақшалай ынталандыру салаларын да дамытты. Ф.Тэйлордың ғылыми басқару жүйесіндегі қағидалары мынадай: • қызметкерді ғылыми түрде сұрыптау • еңбекке мамандандыру • еңбекақыда ынталандыру жүйесін қолдану • жауапкершіліктің əділетті арттырылуы. Индустриальды кезеңде мемлекеттік басқару туралы түсініктің дамуына үлкен үлес қосқан шотланд экономисі, философ А. Смит (1723- 1790 жж.) болды. Ол тек классикалық саяси экономиканың өкілі ғана емес, басқару саласының маманы болып та табылады. Өйткені ол еңбек бөлінісінің əртүрлі формаларына талдау жасады, мемлекет пен мемлекет басшысы міндеттеріне сипаттама берді. Ол «Халықтың бай болуының себептері мен табиғаты туралы зерттеулері» еңбегінде «экономикалық адам» идеясын қалыптастырды. Оның негізгі мақсаты жеке қызығушылықтарды қанағаттандыру мен толтыруға ұмтылу болып табылады. Г. Эмерсон «өнімділіктің 12 қағидасы» деп аталатын кəсіпорынды басқаруды төмендегідей белгіледі: 1. Əр бір басшы мен қызметкер ұмытылатын дəл тұжырымдалған мақсат; 2. Болашақ мақсатты ескере отырып, əр бір жаңа процесті талдауға шынайы көңіл бөлу; 3. Нақты белгіленген тəртіп пен ережеге бағыну 4. Қызметкерлерге əділ көңіл бөлу;</p>
<p>5. Дер кезінде, əрі сенімді есеп беру; 6. Ұйым қызметін мұқият жəне жедел басқару 7. Көрсеткіштер мен жұмыс кестелері; 8. Уақыт, күш – қуат пен шығындарды үйлесімді ұштастыра білу 9. Операциялар көрсеткішін жасау; 10. Ереже мен жазбаша нұсқауларды қолдану; 11. Еңбек өнімділігін арттыру үшін сыйақы төлеу; 12. Ұйымдастырудағы күрделі міндеттерді шешуде əрекеттер қажеттілігін жəне рационализациялау. Қазiргi кездегi менеджменттiң көптеген ғылыми бағыттары мен мектептерiнiң қалыптасуына Роберт Оуэннiң (1771-1858) iлiмi үлкен ықпал еттi. «Мануфактураларды басқарушыларға үндеу» (1813) еңбегiнде Оуэн басшыларға «жансыз машиналармен» қатар «жанды машиналарға» да (қызметкерлерге) бiрдей көңiл бөлу керектiгiн атап өттi. Сол кезеңде бiрқатар тоқыма фабрикаларының басқарушысы болған Оуэн 1800-1828 жж. кең ауқымды əлеуметтiк тəжiрибе жүргiздi. Ол бойынша жұмысшыларға жабдықталған тұрғын үй беру, еңбек, тұрмыс жəне демалыс жағдайын жақсарту, қол жетерлiк бағамен күнделiктi қажет тауарларды сататын дүкендер ашу көзделдi. Одан басқа балалар жұмыс iстей алатын ең төменгi жас деңгейi арттырылды, жұмысшы кенттерiнде мектептер ашылды. Сонымен қоса Оуэн қайырымдылық идеясын ғана емес, сондай-ақ осындай тəсiлмен еңбек өнiмдiлiгiн арттырудың экономикалық есебiн басшылыққа алды. Оуэн əлемде тұңғыш рет фабрикада моральдық ынталандыру əдiстерiн қолданды. Ол станоктарға түрлi түстi ленталарды байлады. Жалақыны арттырмағанның өзiнде екi айдан кейiн барлық станоктарда нормаларды асыра орындағанын бiлдiретiн қызыл түстi ленталар болды. Басқару теориясы мен тəжiрибесiнiң дамуына алғашқы есептегiш машинаның өнертапқышы ағылшын Чарльз Бэббидж (1791-1871) маңызды қадам жасады. Ол түрлi операцияларды жүзеге асыру кезiндегi жұмыс уақытының шығындарын зерделеу, бiр профильдi кəсiпорындарды ң жұмысын салыстырмалы талдау, статистикалық талдау негiзiнде еңбек тиiмдiлiгiн арттыру жолдарын табу, еңбекке ақы төлеудiң сыйлықақылық жүйесiн қолдану əдiстемелерiн əзiрледi. Өз зерттеуiнiң нəтижелерi мен практикалық ұсыныстарын Бэббидж ғылыми басқару саласындағы дүние жүзiндегi алғашқы басылым болған «Материалдар мен жабдықтарды үнемдеу туралы» (1832) атты кiтабында баяндады. Ресми түрде иiру машинасының өнертапқышы болып саналатын ағылшын Ричард Аркрайт (1732-1792) өз фабрикасының астында тоқыма өндiрiсiнiң барлық процестерiн бiрiктiрдi жəне оны ұйымдастырудың иерархиялық қағидасын енгiздi. Еңбектi бөлу, жабдықтарды орналастыруды жоспарлау, машиналар мен қызметкерлердiң жұмысын үйлестiру, тəртiптi қамтамасыз ету негiзiнде ол технологиялық</p>
<p>процестердiң үздiксiздiгiне жəне шығындарды əжептəуiр үнемдеуге қол жеткiздi. Сөйтiп, Аркрайт бүгiндерi индустриялық басқару немесе өндiрiстi ұйымдастыру бағыттарының негiзiн қалады. Жинақталған тəжірибені жалпылау Ғылыми мектептердің қалыптасуы. Басқару туралы ғылым əрдайым қозғалыста болады. Жаңа бағыттар, мектептер, ағымдар қалыптасады, ғылыми аппарат өзгередi жəне жетiлдiрiледi, ақырында, зерттеушiлердiң өздерi жəне олардың көзқарастары өзгередi. Уақыт өте келе менеджерлер бағдарларын өзiнiң нақты ұйымының қажеттiлiктерiнен айналада əрекет ететiн басқару тəсiлдерiн зерделеуге ауыстырды. Олардың бiреулерi өз басқарушылық мəселелерiн бұрынғы кезеңде көмектескен тəсiлдермен шештi. Өзге зерттеушiлер басқаруға барынша жүйелендiрiлген тəсiлдемелер iздедi. Олардың жеке табыстары мен сəтсiздiктерi бүгiнгi таңдағы менеджерлер үшiн құнды сабақ болуы мүмкiн. Басқару практикасында сандық əдістерді қолдану. 60-шы жж. бастап оның көмегiмен математикалық талдау жəне менеджерлердiң субъективтi шешiмдерiн шоғырландыруға қол жететiн математикалық аппаратты пайдалануға сүйенетiн басқару тұжырымдамаларын кеңiнен əзiрлеу басталды. Бiрқатар басқарушылық қызметтердi формализациялау, еңбектi, адам мен ЭЕМ-дi ұштастыру ұйымның құрылымдық элементтерiн қайта қарауды талап еттi. Шешiмдердi елiктегiш үлгiлеу, белгiсiздiк жағдайларындағы талдау əдiстерi, көп мақсатты басқарушылық шешiмдердi бағалауды математикалық қамтамасыз ету секiлдi фирмаiшiлiк жоспарлаудың жаңа элементтерi пайда болды. Қазiргi жағдайларда математикалық əдiстер басқарушылық ғылымның барлық бағыттарында пайдаланылып келеді. ХІХ ғасырдың ортасынан бастап жүйелі басқару тұжырымдамасы дами бастады. XX ғасырдың басында бұл тұжырымдама жаңа сапалы мəнге ие болып, басқару ұйымға жетістік əкелуі мүмкін дербес қызмет өрісі ретінде қарастырыла бастады. Əдетте басқаруды зерттеудің дербес саласы мен ғылым ретінде танудың басы деп есептелетін Тейлордың «Ғылыми басқару қағидалары» атты кітабы (1911) жарық көрген соң менеджменттегі жаңа революция кезеңі басталды. Бұл кезең кəсіби менеджерлер тобы бөлініп шығып, олардың капиталистер тобын «ығыстыруымен» сипатталады. ХХ ғасырдың бірінші жартысында басқару ойының 4 айқын ерекшеленетін мектебі дами бастады: 1) Ғылыми басқару мектебі 2) Əкімшілік немесе классикалық басқару мектебі 3) Адамдық қарым-қатынастар мен мінез-құлық ғылымының мектебі 4) Басқару ғылымының мектебі (сандық тəсілдеме).</p>
<p>Мектептер Басқару ойының дамуына қосқан үлестерi Өкілдері Ғылыми басқару мектебi 1.Мiндеттi орындаудың ең жақсы тəсiлдерiн анықтау үшiн ғылыми талдауды пайдалану. 2. Мiндеттi орындау үшiн барынша лайықты қызметкерлердi таңдап алып, оларды үйретудi қамтамасыз ету. 3. Мiндеттi тиiмдi орындау үшiн қызметкерлердi қажеттi ресурстармен қамтамасыз ету. 4. Өнiмдiлiктi арттыру үшiн материалдық ынталандыруды жүйелi əрi дұрыс пайдалану. 5. Жоспарлау мен ойлауды жұмыстан бөлу Ф.Тейлор, Л. Гильберт, Г. Гантт, Г. Форд, Г.Эмерсон, А.К. Гастеев Əкiмшiлiк немесе классикалық басқару мектебi 1.Басқару қағидаларын дамыту. 2. Басқару қызметiн бейнелеу. 3. Барлық ұйымды басқаруға жүйелi көзқарас. А.Файоль, М. Вебер, Дж. Муни, Л. Урвик, Г. Черч, О.А. Ерманский, А.А. Богданов Адамдық қарым- қатынастар мен мiнез-құлық ғы- лымының мектебi 1.Қанағаттылық пен өнiмдiлiк дəрежесiн арттыру үшiн жекелiк қатынастарды басқару тəсiлдерiн қолдану. 2. Адам қатынастары туралы ғылымды, əрбiр қызметкер əлеуетіне сай пайдаланылатындай етiп, ұйымды қалыптастыру мен басқаруға қолдану. Э. Мэйо, М. Фоллет, Ф. Макгрегор т.б. Басқару ғылымының мектебi 1.Үлгiлердi жасау мен қолдану арқасында күрделi басқару мəселелерiн түсiнудi тереңдету. 2. Күрделi жағдайларда шешiм қабылдайтын басшыларға көмек ретiнде сандық əдiстердi дамыту. Д. Форестер, Р. Люс, А. Гольдбергер, Ч. Бернард, Г. Саймон т.б. Ғылыми басқару мектебі.</p>
<p>Ғылыми түрде басқарудың негізі Фредрик Уинслоу Тейлор (1851 - 1915) тарапынан қаланған. Ғылыми басқару философиясының ең негізгі элементі - өнімділік. Ғылыми басқарудың əдісі, тəсілі мен құралдары өнімділікпен қамтамасыз етуге тəн. Ғылыми басқару, сонымен қа тар жұмысшы мен басқарма мүдделері арасындағы өзара тығыз байланыстың болуы, сол себептен ынтымақтасып бірге жұмыс істеулерінің қажетті жəне міндетті екендігі туралы ой-пікірге сүйенеді. Ф.Тейлор «ғылыми басқару» деген ой-пікірлерін «Ательені басқару» жəне «ғылыми басқарудың принциптері» атты екі шығармасында атап көрсеткен. Тейлор, ғылыми кəсіпкерлік саласында, қазіргі кезде де сөз етілетін «ғылыми басқарудың принциптерінің» мақсаттарын төмендегідей көрсетуде: Ø қымбатқа соққан тиімсіз жұмыстарды жəне шығындарды қарапайым мысалдармен келтіру; Ø осы тиімсіз жұмыстардың себебін, бірнеше төтенше күш пен адамдардың болмауынан емес, жүйелі басқару түсінігінің болмағандығын халыққа түсіндіру; Ø ең тиімді басқарудың белгіленген заңдарға, принциптерге жəне ережелерге негізделіп, шын мəнінде ғылыми тұрғыда болғандығын дəлелдеу. Ғылыми басқару мектебінің(1885-1920) негізін қалаушылар байқау, өлшеу, логика мен талдауды пайдалана отырып, қол еңбегінің көптеген операцияларын жетілдіруге, сөйтіп өндіріс тиімділігін барынша арттыруға болады деп есептеді. «Ғылыми менеджменттің атасы» американ инженері Фредерик Тейлор (1856-1915) жүргізілген зерттеу барысында ол «ғылыми менеджмент» немесе «ғылыми басқару» деген атқа ие қоғамдық қозғалыс туғызды. Ұйымның ғылыми өндірісінде Тейлор 3 ұстанымды ашып көрсетті: Саралау қызметі ұстанымы , жеке жұмысшыларға берілге н нұсқаулар тобы. Жұмысшыларға белгілі бір өндірістік тапсырманы орындаудың əдістері көрсетілген жазбаша нұсқаулар берілген. Мамандану ұстанымы, əр адамның мүмкіндігі белгілі бір басты қызметті орындауға жұмсалуы тиіс. Материалды қызығушылық ұстанымы. Тейлордың жұмыстары материалды қызығушылықтар ұстанымына басты рөль беретін «экономикалық адам» концепциясының негізін қалады. Жұмысшы істеген жұмысына қарай жалақы алу тиіс деп пайымдады Тейлор. Тейлордың зерттеулерінің басты міндеті өндірістен алынатын өнімді оны кеңейту арқылы алу емес, керісінше еңбекті ынталандыру арқылы жетістіктерге жету. Ол ең алғаш рет «адами фактор» түсінігін енгізіп, өзінен кейінгі көптеген ғалымдардың жаңалықтар ашуына себепші болды. Г.Форд өндірісті ұйымдастырудағы «Тэйлор жүйесін» жетілдіре отырып, төмендегідей атап өтті:</p>
<p>- өндіріс процесі мен сатыларын байланыстыра отырып, дəл есептеу, жоспарлау; - қажетті жұмыс пен басқа ресустарды əзірлеу; - стандартты технологиялар мен механизмдерді қолдау; - өндірісті жетілдіру жолдарын үнемі қарастыру. Басқарудың классикалық жəне əкімшілік басқару мектептері. Классикалық мектеп өкілдерінің ұйғарымы бойынша басқару - белгілі мақсатқа жетуде орын алатын қатаң əкімшілік қағида, əдістердің жиынтығы. Мəселен, осы бағыттағы көрнекті өкілі Файолдің пікірінше, əкімшілік ету жан - жақты ауқымын белгілейтін басқарудың бір бөлігі, жəне де техникалық, коммерциялық, қорғаныстық, бухгалт ерлік, əкімшілік салаларын қамтиды. Осы қызметтер арасында əкімшілік əрекет ең маңызды есептелініп, оның элементтері: жоспарлау, ұйымдастыру, басшылық ету, үйлестіру жəне бақылау анықталған. Сонымен қатар, А.Файол тəжірибеде кең қолдану тапқан басқарудың 14 қағидасын жасап шығарды. Оларға: жауапкершілік, жеке дара басшылық, иерархиялық басқару, жеке жəне жалпы мүдделер үйлесімділігі, мамандандыру, тəртіп, əділеттілік, ынта - ықылас, лауазымға сəйкестілік, қызметкерлер тұрақтылығы, орталықтандыру жəне т.б. енеді. Ұйымдағы басшылық, билік жəне құрылым құру проблемаларына көңіл бөліп зерттеуде əкімшілік мектептің келесі бір өкілі ерекше орын алады. Ол əртүрлі ұйымдарды талдай отырып, басшы ие болатын билік сипатына қарай ұйымдастырудың негізгі үш кезеңін, яғни харизматикалық, дəстүрлі жəне идеалды кезеңдерін ажыратып берді. Неміс ғалымы Макс Вебер (1864-1920) ұйымдағы билік құрылымы мен лидерлік мəселелерге жете назар аударды. Əртүрлі ұйымдарды талдай отырып, басшы ие болатын билік сипатына қарай ұйымдастырудың негізгі үш түрін ажыратады: харизмалық, дəстүрлі жəне бюрократтық. «Шаруашылық тарихы» жəне «Протестанттық этика жəне капитализм рухы» кітаптарындағы капиталистік өндірістегі протестантизм этикасы бастауын талдауы негіз болды. Ол капиталистік өндіріс құр ылымында еңбек бөлінісін оңтайландыру идеясы жатыр деп есептеді. Ол «əрекеттің мінсіз типі» түсінігін енгізіп оның 4 түрін қарастырады: А) дəстүрлі; Б) аффективті; В) құндылықты – оңтайландырылған; Г) мақсаттандырылған. Қолайсыз түсінігіне сүйене отырып Вебер капиталисттердің 2 типін қолайсыз(архаикалық, авантюристтік, көпестік) жəне қолайлы(өнімді) бөліп шығарды. Қолайсыз капиталисттік тип бойынша табиғи шаруашылық жəне тауар айырбастаудағы теңсіздік əулеттік құрылымнан дамыды деп шешті. Капиталисттіктің екінші типі қолайлы шіркеудің реформацияланып, еңбектің діни мағынаға ие болып, адамдардың басты құндылығына айналуы себепші болды. Тарих бойынша капиталистіктің екі типі бір мезгілде өмір сүрді, тек үстемші тип ретінде еңбекті қолайлы пайдалану дамыды. Соның нəтижесінде басқару жүйесі, ғылым, білім</p>
<p>сияқты жаңа құрылымдар пайда болып Вебердің бюрократия теориясын туғызды. Оның пайымдауынша бюрократия басқаруды ұйымдастырудағы негізгі жол болып саналды. Жұмысшылар басқарушының бұйрығына емес, тиімді ережелер жиынтығына бағынуды қалайтынын көрсеткен бұл теория «басқарудың ғылыми баспалдағы» болып саналды М.Вебер ұйымдастырудың аталған түрлерін зерттей келіп, үшінші кезеңге үлкен көңіл бөле отырып, «бюрократиялық жүйе қағидаларын» жасап шығарды: - нақтылы еңбек бөлінісі; - басқару деңгейлерінің жіктелуі; - міндеттер бірыңғайлығымен үйлестіріле қажетті ресми ережелер мен стандарттар жүйесін жасау; - əлеуметтік аралық пен əділеттілік; - жұмысқа қабылдауда қатаң орын алуы жатқызылады. Адамдық қатынастар мектебі жəне тəртіптік тəсілі. ХХ ғасырдың орта шеніне қарай ғылыми басқару жəне əкімшілік мектептердің адам факторына жеткіліксіз көңіл бөлуіне жауап ретінде жаңа бағыт адамдық қатынастар мектебі пайда болды. Оның өзі классикалық көзқарастағы кемшіліктерді шешу мақсатында пайда болғандықтан, адамдық қатынастар мектебін кейде неоклассикалық мектеп деп те атайды. Адамдық қатынастар мектебінің көрнекті өкілдеріне М.Фоллет, Э.Майо, Д.Макгрегор т.б жатқызылады. Адамдық қарым-қатынастар(1930-1950) мен мінез-құлық ғылымының мектебін(1950 жылдан қазіргі кезге дейін) дамытуға негізгі үлес қосқан ғалымдар Мэри Паркер Фоллет (1868-1933) пен Элтон Мэйо (1880-1949) болып табылады. Элтон Мэйо «Индустриалды өркениеттің адами мəселелері» (1933), «Индустриалды өркениеттің əлеуметтік мəселелері» (1945), «Индустриалды өркениеттің саяси мəселелері» (1947) кітаптарында еңбек адамдарға қуаныш əкелмейтін күйге жетті деп көрсетті. Ол еңбек өнімділігін көтеру мəселесін көп қозғап, Хоторне қаласындағы «Вестерн Электрик Компани» компаниясындағы 1927-1939 жылдар арасындағы тəжірбиесі арқасында АҚШ-та ғана емес, басқа елдерде де үлкен атаққа ие болды. Осы тəжиірибе нəтижесінде ол мынандай қорытындылар жасады: 1. Адам – топта жұмыс істеуді қажет ететін əлеуметтік жаратылыс. Жұмысшылар мен төмен жəне жоғары лауазымды менеджерлердің əрекеттерін олардың қатынастарын зерттей отырып алдын ала болжауға болады. Топ белгілі бір мақсатқа қол жеткізу барысында бір – бірімен араласуы арқылы ғана өмір сүреді. 2. Топтың барлық мүшелері топ ережелеріне сəйкес өздерін ұстайды, жұмысшылар шешімді жеке тұлға ретінде емес, топ мүшелері ретінде қабылдайды. Топтық ережелер топ мүшелері құрастырған идеялар. Олар жұмысшылардың қай бағытта, қандай жұмыс істеуін анықтайды.</p>
<p>3. Жұмысшы өнімі оның физикалық мүмкіндіктерімен емес, топтық ережелермен анықталады. Топтық ереже атағы моральды əсер ету құралдарының көмегімен іске асады. 4. Өндіріс басшылары өнімге емес адамдарға бағытталуы керек. Қатаң бағындыру иерархиясы мен бюрократиялық ұйымдар е ркіндікті қалап тұратын адам табиғатына қайшы келеді. Америкалық белгілі маман Дуглас Мак – Грегор (1906-1964) Х жəне У əріптерімен белгіленген басқарудың екі теориялық концепциясын жасап шығарды. Автор бұл теориялар адам табиғатына əртүрлі көзқарас туғызады: егер Х теориясы адамды өндірісте жекешеліктен айрылған механистикалық көзқарасты анықтаса, У теориясы адамды оның ішкі ортасымен қатынасының органикалық байланысы көзқарасы ретінде түсіндіреді. Х теориясының шарттары : Қарапайым адам жұмыс істеуді ұнатпайды, əрі жұмыстан мүмкіндік болса жалтаруға тырысады. Басшылыққа жұмысшылардың өз міндеттерін атқаруы үшін күш көрсетуге жəне жазаға тартуға тура келеді. Қатардағы жұмысшы селқос əрі өзін басқарғанды қалайды, шешім қабылдауға əрі жауапкершілікті мойнына алуға құлықсыз. Х теориясын қолдануда Мак – Грегор сəйкес ұстанымдарын құрастырды: Ұйымды қатаң басқару. Заң өкілеттерін дəстүрлі түрде орталықтандыру. Шешім қабылдау үрдісінде жұмысшылардың аз болуы. У теориясы ұстанымы басқаша: Өзін – өзі ынталандыру мен жұмыс үрдісінде адам рахаттану үшін ол ұйымның мақсаттарының орындалуына ортақтасып, ерікті түрде жұмыс істейді. Ынталандырудың бір факторы ретінде жұмысшының қоғам өміріне араласуы, өзіне міндет жіктеуі болып табылады. Адамның жұмыс істеуіне жағдай жасалса ол өзіне жауапкершілік алудан қорықпайды. Шығармашылық жəне басшылық мəселелерді шешуді адамдардың аз тобына емес, жұмысшы топқа беру керек. Көрсетілген шарттарға байланысты Мак – Грегор келесі ұстанымдарды ұсынады: -Ұйымды еркін əрі жалпы басқару. -Ресми өкілеттілікті орталықтандырмау. -Өзін – өзі бақылау мен жекеше белсенділікті арттырып, бақылау мен мəжбүрлеуді азайту. -Басқарудың демократиялық стилі. Бұл мектептің айрықша ерекшелігі оның психологияға, соның ішінде XX ғасырда кеңінен таралған əрі жете зерттелген психологиялық теориялардың бірі - бихевиоризмге (мінез-құлық туралы ғылым) бағытталуы болды. Мектептің негізгі мақсаты адам ресурстарының тиімділігін арттыру есебінен ұйымның тиімділігін арттыру болып табылады.</p>
<p>Басқарудың ғылыми мектебінің қалыптасуы математиканың, статистиканың, инженерлік ғылымның жəне олармен аралас басқа да білім салаларының дамуымен байланысты. Бұл мектептің ең танымал өкілдері – Р.Акофф, Л.Берталанфи, С.Бир, А.Гольдбергер, Д.Фосрестер, Р.Люс, Л.Клейн, Н.Джорджеску-Реган. Басқарудың ғылыми мектебі 50 - жылдардың басында қалыптасты жəне қазіргі уақытта да табысты жұмыс істейді. Басқару ғылым мектебінде екі басты бағыт бар.Жүйелік, үдерістік жəне жағдайлық тəсілдерді пайдалана отырып, өндірісті «əлеуметтік жүйе» ретінде қарастыру. Математикалық əдістер мен ЭЕМ қолдануды қоса алғанда, жүйелік талдау жəне кибернетикалық тəсілді қолдану негізінде басқару мəселелерін зерттеу. Басқару ғылым мектебінің еңбегі оның ұйымға əсер ететін негізгі ішкі жəне сы ртқы айнымалыларды(факторларды)айқындай алды. Екінші бағыт басқару ғылым мектебін нақты ғылымдардың,ең алдымен математиканың дамуымен байланысты. Қазіргі жағдайда көптеген ғалымдар бұл бағытты жаңа мектеп деп атайды. XIX ғ.экономикалық зерттеулерде математикалық əдістерді қолданудың басталуы француз экономисі А. Каунот (1801-1877) атымен байланыстырады. Осылайша,басқару шамамен жеті мың жыл бұрын пайда болды, бірақ XIX ғасырдың аяғынан бастап, əсіресе ХХ-шы жылдары, əлеуметтік нарықтық шаруашылықтың дамуымен менеджмент дербес білім саласына, яғни ғылымға бөлінді . ХХ ғ.басқару ойының дамуындағы жаңа кезеңнің қалыптасуымен сипатталады.Алдыңғы кезеңдерде ұсынылған идеялардың синтезі негізінде зерттеушілер басқарудың кешенді тəсілінің қажеттілігін түсінуге келді. Сонымен қатар, басқару-бұл ғылым ғана емес, өнер деген пікір қалыптасты. Батыс менеджменті – бұл ең алдымен өзінің құндылықтарымен, нормалары мен заңдарымен ерекше субмəдениет. Екінші жағынан – бұл қойылған мақсаттарға қол жеткізу үшін қажетті техникалық рəсімдер мен əдістердің жиынтығы, жоспарлау, ұйымдастыру, уəждеу жəне бақылау жөніндегі нақты іс-əрекеттердің сомасы. Бүгінде нарықтық экономика оған тең келетін басқару жүйесін талап етеді, ол барлық қоғаммен бірге түбегейлі өзгерістерге ұшырауы тиіс.Нарықтық қатынастарға көшу жағдайында басқарудың теориясы мен практикасын үздіксіз жетілдіру табыстың маңызды факторы болып табылады.Шетелдік басқарудың озық жəне прогрессивті тəжірибесін зерделеу жəне оны меншікті басқару проблемаларын талдау кезінде пай далану үлкен мəнге ие болады.Сондықтан шетелдік менеджменттің теориясы мен тəжірибесінің даму тарихын зерделеу өте өзекті. Қызметкерлерді басқару менеджменттің ең бір маңызды фунццияларының бірі болып табылады. Басқару – негізгі өндірістік, шығармашылық күш. Қазіргі заманғы күрделі өндірісте адам рөлі өсуде, соның нəтижесінде қызметкердің қабілеттіне, білім мен біліктілік деңгейіне жоғарғы талаптар қойылуда. Ғылыми-техникалық прогресс еңбек əдістерінің терең өзгерістеріне əкелді, яғни қызметкерлерді</p>
<p>ұйымдастыру мен басқарудың жаңа нысандарын талап етеді. Адам ресурсын қолданудың тиімділігін арттыру бағыттары əр түрлі менеджмент моделінде əр түрлі қарастырылған.Əр елде белгілі бір моделді елдің тарихи, əлеуметтік-саяси, ғылыми-техникалық дамуы, псиихологиялық, моральді-этикалық нормалар мен адам тəртібінің стилі, олардың тəрбиесі, əдет-ғұрыптарна қарай отырып қолданады. Менеджменттің өзіне бейімделген моделін құрастыруда меншік типі, мемлекеттің түрін, нарықтық қатынастардың қалыптасқан уақытын ескеру қажет. Американдық жəне Жапондық жəне Батыс Еуропалық педагогикалық менеджментінің артықшылықтары мен кемшіліктерімен анықтау жəне салыстыру. Американдық Жапондық Батыс Еуропалық Американдық моделі менеджмент. Негізін қалаған ғылым деп са налады американдық инженер жəне зерттеуші Ф. Тейлор. Америкалық педагогикалық менеджментінде жұмысқа алу жəне кадрлық саясатта жұмысшыларды университеттер желісі,бизнес мектептері арқылы еңбек нарығынан жұмысқа алу. Жұмысшыларды жеке бағалау жəне аттестациядан өткізу.Жеке нəтижелері мен жұмысшының еңбегіне байланысты жалақы төлеу. Америкадағы педагогикалық менеджмент «басқару шеберлігі» деп те қарастырылады. Ол өз стандартсыз жəне ерекше шешімдерімен көрінетін, менеджердің көрнекті ойы мен интуициясына негізделеді. Жапондық педагогикалық менеджментінде мектеп пен ЖОО-ның еңбегі кеңінен қолданылады. Өндірістен қол үзбестен, кəсіпорывн ішіндегі мамандарды оқыту мен қайта даярлау. Жұмыс істеу жылдарының мөлшеріне қарай қызмет бабының жылжуы. Кəсіпорындағы еңбек өтілімі мен жасына қарай жалақы төлеу. Əкімшілігі ауысқан кезде кəсіпорын философиясы өзгеріссіз қалады. Жұмысшылар өз орнында қалады. Жапондық менеджменттің мəні адамдарды басқару болып табылады. Осы ретте жапондықтар американдықтар сияқты, бір адамды (тұлғаны) емес, адамдар топтарын қарастырады. Осыған байланысты Жапонияда жасы үлкенге бағыну дəстүрі қалыптасқан, бұл позицияны топтың барлық мүшелері мақұлдайды. Батыс Еуропалық педагогикалық менеджменттің тəрбие жағына жəне басқару жағына бағытталған. Қамту дəрежесі бойынша. Қызмет ауқымы бойынша (стратегиялық, тактикалық, жедел); мектепке қатысты жалпы біліммен қамту, тəрбие жұмысы, əдістемелік жұмыс т.б.); Басқару жауапкершілігінің келесідей түрлері қалыптасқан: жалпы – қызметке орай жағдайларды жасау; белгілі қызметтік – нақты іс-əрекеттерге байланысты шарттарды түзу. Батыс корпорацияларының ұйымдастырушылық мəдениетінің қалыптасуына əсерін тигізетін компоненттерінің бірін таңдап алу күрделі. Соңғы уақытта Батыс фирмалары жұртшылықпен байланыстарға көп көңіл аударады.</p>
<p>Американдық жəне Жапондық жəне Батыс Еуропалық педагогикалық менеджментінің артықшылықтары мен кемшіліктерімен анықтау жəне салыстыру. Сонымен, менеджментті ұйымның тиімді жəне əрекетті функционалдану мақсатында интеллектуалды, материалды жəне қаржылық ресурстарын мобилизациялау үшін ғылым, шеберлік жəне іс-əрект деп анықтауға болады. Менеджменттің жапондық моделі «əлеуметтік адамға» негізделген. Алайда жапондықтардың «əлеуметтік адам» түсінігіне қатынасы американдықтарға қарағанда иілгіш болып табылады. Басқару тиімділігінің қажетті шарты: корпорациялық құндылықты жұртшылыққа, болашақ тұтынушыларға жəне əлемдік қоғамдастыққа жеткізудің құралы Сонымен, қорытындылай келе педагогикалық модельдеріне, жүйелеріне басқаруына талдау жасалды.Алдыңғы қатарлы тəжірибені танып білу өте маңызды болды. Бұл модельді салыстыра отырып, талдауда, біздің қызығушылығымыз елеулі. Өз еліміздің педагогикалық менеджмент моделін құрастыруда жоғарыдағы елдердің тəжірибелерін ескергуе болады. Біздің ойымызша, осы 3 модельді салыстыра отырып , Қазақстан педагогикалық менеджментіне сəйкес келестін тұстарын қарайтын болсақ, жапондық жəне американдық модельді қолданған көбірек жұмыс тиімділігіне алып келеді, педагогикалық менеджмент оқу -тəрбие, оқу- таным үдерісінің жəне білім берудің бүкіл жүйесінің тиімділігін арттыруға бағытталған, оларды басқарудың принциптері, əдістері, ұйымдастыру нысандары мен технологиялық тəсілдерінің кешені болғандықтан, бүкіл модельдерді бір-бірімен салыстыра отырып, тəжірибе жинақтауға болады. Сонымен, басқарудың түрлі жүйелеріне талдау жасалды, яғни американдық жəне жапондық менеджмент. Алдыңғы қатарлы тəжірибені танып-білу өте маңызды мəселе болып табылады. Алайда, қа ндай да болсын басқару жүйесін салыстырмалы талдауда мынаны ескеру қажет: қай басқару жүйесін болсын оны тек механикалық түрде қолдану жоғары тиімділікке кепілдеме бермейді. Өндірістік ұйымның тиімділігі тек қана белгілі бір басқару жүйесінің қолданылуымен негізделмейді. Ол жүйеге өндірістің бөліктері, жұмысшылар қалай бейімделгенін де ескеруі қажет. Əр басқару жүйесін талдағанда сол жүйе орын алатын елдегі кəсіпорынның жеке ерекшеліктерін, сол елдің ішкі-сыртқы экономикалық жағдайын да назарға алу керек. Қызметкерлерді басқарудың тиімді тəсілдерін тану бізге оларды қолданудың кең мүмкіндігін береді. Американдық жəне жапондық менеджмент модельдерін салыстыра талдау,мынаны көрсетеді: менеджменттің бір моделін басқа елдің экономикасына көшіруге болмайды,себебі ол елдің өзіндік ерекшеліктері, спецификалық шарттары, психологиялық, əлеуметтік-мəдени факторлары бар. Алайда бұл екі модельді салыстыра талдауда біздің елеулі қызығушылығымыз бар. Өз еліміздің менеджмент моделін құрастыруда жоғарыдағы елдердің тəжірибелерін ескеруге болады.</p>
<p>Біздің ойымызша, осы үш модельді салыстыра отырып Қазақстан менеджментіне сəйкес келетін тұстарын қарайтын болсақ,онда өндіріс орындары, цехтар, зауыт фабрикаларда жапондық модельді қолданған көбірек жұмыс өнімділігі мен тиімділігіне алып келеді. Себебі, Жапон мемлекеті өндірістің жетілгендігімен, дамығандығымен танымал жəне олар өз істерінің өнімділігін басты мақсат етіп қойып, соған жету жолында барлық менеджменттік мүмкіндіктерді пайдаланады. Ал өз кезегінде, қаржылық мекемелер, маркетингтик фирмалар, ті келей өнім өндіретін өндіріске қатыссыз кəсіпорындар көбіне американдық модельді ескеруі тиіс деп ойлаймын. Себебі, бұл модельде адамның жеке басының қызметінің өсуіне баса назар аударылған, ал қазіргі кезде қызметкерлер көбіне қызмет бабының өсуін жəне істелген жұмыстарына қарай тиісті жалақыларын алуды қалайды.Нарықтық қатынастар негізінде экономиканы қайта құрудың қазіргі заманғы жағдайларында оның басым бағыттарының бірі отандық ұйымдардың практикалық қызметінде менеджментті пайдалану бойынша негізгі теориялық жəне əдіснамалық ұстанымдарды əзірлеу болып табылады.Басқару ойыны ң негізгі ерекшелігі басқару жүйесін жетілдірудің жаңа нақты жəне жолдарын іздеу, нарықтық жағдайларға қатысты жəне алдыңғы қатарлы шетелдік тəжірибені шығармашылық пайымдау негізінде басқарудың əртүрлі проблемалары бойынша ұстанымды əзірлеу болып табылады. Бақылау сұрақтары: 1. «Адамгершілік қатынас» мектебінде ұйым қызметін түсіндіріңіз. 2. Басқарушы менеджерлер мынадай 2 категорияға бөлінеді: «Х» теориясы жақтаушылар жəне «Y» теориясын жақтаушылар, атты концепциясын сипаттаңыз. 3. ХХғ. басында Ф.Тейлордың басқару жүйесіне байланысты еңбектеріне тоқталыңыз.</p>`,rawText:`§ 3 Басқару ғылымының даму тарихы 
 
Басқару өте ежелгі тəжірибе болып саналады. Адамдар топтар мен 
ұйымдарға бірігіп, өмір сүре бастаған кезден басқару  қажеттілігі пайда  
болды. Ерте кездегі Вавилонды, Египет пирамидаларын, Македонияны, 
Римді еске алатын болсақ, соның барлығы да үлкен үйлестіру, ұйымдастыру 
қызметтері арқылы жүзеге асырылған. Басқару-қызмет пен тəжірибе 
ретінде өте ежелгі сипатқа ие болғанымен, ғылым мен зерттеу саласы 
түрінде салыстырмалы түрде алғанда жаңа болып табылады. 
Басқару психологиясы - басқару жүйелеріндегі (мемлекет басқару, 
ұйым, мекеме, топ, ұжым жəне т.б.) адамдардың қатынастарына 
байланысты мəселелерді зерттейтін жəне білімдерді жинақ тайтын 
қолданбалы психологияның саласы. 
Ғылымның теориялық даму тарихын  хронологиялық кесте арқылы 
талдап өтер болсақ, басқару теориясы мен практикасының дамуын бірнеше 
тарихи кезеңдерді бөліп көрсету болады. 
Менеджменттің даму кезеңдері: 
ü Ежелгі кезең (б.з.д. 9-7 мыңжылдықтан XVIII ғасыр аралығы) 
Басқару тəжірибелерінің жинақталуы 
ü Индустриальды кезең  (1776-1890 жж.)  
Өнеркəсіптік революция кезінде менеджменттің туындауы 
ü Жүйелік кезең  (1856-1960 жж.)   
Жинақталған тəжірибені жалпылау. Ғылыми мектептердің 
қалыптасуы 
ü Ақпараттық кезең  (1960ж.-қазіргі уақыт)  
Басқару практикасында сандық əдістерді қолдану 
Басқару тəжірибелерінің жинақталуы. 
Шамамен б.з.д. 9-7 мыңжылдықтарда Жақын Шығыс елдерінде 
иемденуші қоғамнан (аңшылық, терімшілік) өндіруші қоғамға (өнімдерді 
өндіру, егіншілік) өту кезеңінде басқару төңірегінде белгілі бір білімдер 
туындап жинақтала бастады.Басқарудың бастапқы мəселелерін,  жайттарын  
ежелгі египеттіктер шеше бастады. Бұл олардың пирамидалар құрылысын 
жүргізуімен (б.з.д. 4 мыңжылдық) байланысты болды. Құрылысқа көп адам 
жұмылдырылғаннан кейін олар адамдарды мақсатқа сəйкес ұйымдастыру, 
нəтижені жоспарлау жəне қадағалау керек екендігін түсінді.Шумер 
территорияларында табылған қыш кестелерден (сауда-саттық жəне елдің 
заңдары жөнінде мəліметтер жазылған) ежелгі гректердің басқарушылық 
тəжірибелерінің болғанын аңғаруға болады (б.з.д. 3 мыңжылдық). Вавилон 
патшасы Хаммурапи (б.з.д. 1792-1750 жж.) мемлекетті басқару заңдар 
нұсқасын жасады, өзінің жеке лидерлік стилін ойлап тапты, ең аз еңбекақы 
анықтаудың заңдық нормасын бекітті. Ассирия патшасы ІІ Навуходоносор 
(б.з.д. 604-562 жж.) текстилді жəне астық қоймаларында бақылау жүйесін 
ойлап тауып жəне оны дұрыс қолдана білді. Қытай ғалымы Сан Цу «Соғыс 

өнері» (б.з.д. 500 ж.) шығармасында ұйымның иерархиялық құрылымы, 
кадрлік жоспарлау, тұлға аралық байланысты ұйымдастыру керектігін 
көрсетті. 
Басқаруды қызметтің (адамзат іс-əрекетінің) ерекше сферасы деп 
алғашқылардың бірі болып сипаттама берген ежелгі грек философы Сократ  
(б.з.д. 469-399жж.) болды. Ол жақсы кəсіпорын иесінің, саудагердің, əскери 
басшының міндеттерін талдай келе, негізінен олардың бірдей екендігін  
айтты. Еңбек бөлінісі жөнінде алғаш рет айтты. Басты мақсат қажет адамды 
тиісті орнына қойып одан өз талабыңның орындалуын қадағалауда. 
Осылайша Сократ басқарудың əмбебап сипаты туралы идеяны 
тұжырымдады (Басқарудың əмбебап принципі). 
Идеальды мемлекеттің негізін қалаушы – грек философы Платон (б.з.д. 
428-348 жж.) басқарудағы іс-əрекет қоғам өмірін қамтамасыз ету жүйесінің 
маңызды элементі болатынын дəлелдеді. Ол мемлекеттік басқару 
формаларын жіктеді, басқару мүшелерінің қызметтерін бөліп көрсетуге 
талпынды. 
Грек философы Аристотель (б.з.д. 384-322 жж)  үй шаруашылығы 
туралы ілімнің негізін қалады. Оның негізінде құлдармен қарым-қатынас 
жасау дағдылары мен оларды басқару өнерін үйрететін «құдайлар ғылымын 
» («господская наука») дайындау қажеттілігі жатты.  
Қайта өрлеу дəуірінің өкілі Никколо Макиавеллидің (1469-1527жж.)  
əлеуметтік ойлау тарихына, басқару теориясы мен практикасына қосқан 
үлесі орасан зор. Ол алғашқылардың бірі болып азаматтық қоғам 
тұжырымдамасын негіздеді жəне «мемлекет» терминін қолдана бастады. 
өзінің «Государь», «Рассуждение о Тите Ливии» еңбектерінде жетекшінің 
стилі, жұмыс беруші мен бағынышты арасындағы өзара байланысты 
талқылайды. 
Макиавеллидің қазіргі заманғы əлеуметтік менеджменттің дамуына 
əсер еткен төрт қағидасы:  
• бедел сенушілердің қолдауына негізделеді;  
• бағыныштылар басшылардан не күтуге болатындығын білуі 
керек;  
• көшбасшының өмір сүруге деген еркі болуы керек;  
• көшбасшы əрқашан əділеттіліктің үлгісі болып табылады.  
Оның идеялары элиталардың (В. Парето, Э. Дженнинг, Г. Моска, С. Р. 
Миллс) заманауи социологиялық теориясына жол  ашты, «Макиавеллистік 
қозғалысты» басқарған «басқарушылық төңкеріс» теориясының авторы 
Дж.Бернхаймға əсер етті. 
Макиавелли «қоғамдық келісім» идеясын алға тартты. Макиавелли 
тұлғасы əлеуметтану мен басқару тарихында маңызды орын алатындығы 
сөзсіз. 
Өнеркəсіптік революция кезінде менеджменттің туындауы 

Менеджмент тарихы туралы білім жүйесі XIX ғасырдағы өнеркəсіптік 
революция кезінде пайда болды, қол еңбегін фабрикалық өндіріс жүйесіне 
ауыстырумен сипатталды. 
Фабрикалық жүйе - бұл өнеркəсіптік төңкерістен кейін кеңінен 
енгізілген жəне жаңа табиғи энергия көздерін пайдалануға, еңбек бөлінісін 
кеңейтуге жəне еңбек процесіне анағұрлым толық бақылауды енгізуге 
мүмкіндік беретін кеңейтілген кəсіпорындарды құрумен сипатталатын 
өндіріс жүйесі. 
Мамандандыру, өсіп келе жатқан механикаландыру жəне тауар 
нарығының кеңеюі фабрикалық жүйеге бұрыннан келе жатқан қолөнер 
өндірісінің дəстүрлі жүйесін қалдырып отыруға мүмкіндік берді. Бұл 
əсіресе XIX ғасырдың басындағы зауыттық əдісінің ең жарқын үлгісі 
болған тоқыма өнеркəсібінде айтылды. 
Басқару жүйесінің жалпы тұжырымдамалары. 
Қазіргі кездегі басқару теориясының дамуы ғылыми басқару 
мектебінің өкілдері еңбектерімен байланысты, олар Ф.Тейлор, Д.Гильберт, 
Г.Гант, Г.Эмерсон, Г. Фордт.  
Ф. Тэйлор ғылыми басқаруды көрсеткішт ер уақыт пен міндетті 
зерттеу, ұдайы сұрыптау жəне баулу, ақшалай ынталандыру салаларын да 
дамытты. 
Ф.Тэйлордың ғылыми басқару жүйесіндегі қағидалары мынадай: 
• қызметкерді ғылыми түрде сұрыптау 
• еңбекке мамандандыру 
• еңбекақыда ынталандыру жүйесін қолдану 
• жауапкершіліктің əділетті арттырылуы. 
Индустриальды кезеңде мемлекеттік басқару туралы түсініктің 
дамуына үлкен үлес қосқан шотланд экономисі, философ А. Смит (1723-
1790 жж.) болды. 
Ол тек классикалық саяси экономиканың өкілі ғана емес, басқару 
саласының маманы болып та табылады. Өйткені ол еңбек бөлінісінің 
əртүрлі формаларына талдау жасады, мемлекет пен мемлекет басшысы 
міндеттеріне сипаттама берді. 
Ол «Халықтың бай болуының себептері мен табиғаты туралы 
зерттеулері» еңбегінде «экономикалық адам» идеясын қалыптастырды. 
Оның негізгі мақсаты жеке қызығушылықтарды қанағаттандыру мен 
толтыруға ұмтылу болып табылады. Г. Эмерсон «өнімділіктің 12 қағидасы» 
деп аталатын кəсіпорынды басқаруды төмендегідей белгіледі:  
1. Əр бір басшы мен қызметкер ұмытылатын дəл тұжырымдалған 
мақсат; 
2. Болашақ мақсатты ескере отырып, əр бір жаңа процесті талдауға 
шынайы көңіл бөлу; 
3. Нақты белгіленген тəртіп пен ережеге бағыну  
4. Қызметкерлерге əділ көңіл бөлу; 

5. Дер кезінде, əрі сенімді есеп беру; 
6. Ұйым қызметін мұқият жəне жедел басқару 
7. Көрсеткіштер мен жұмыс кестелері; 
8. Уақыт, күш – қуат пен шығындарды үйлесімді ұштастыра білу 
9. Операциялар көрсеткішін жасау; 
10. Ереже мен жазбаша нұсқауларды қолдану; 
11. Еңбек өнімділігін арттыру үшін сыйақы төлеу; 
12. Ұйымдастырудағы күрделі міндеттерді шешуде əрекеттер 
қажеттілігін жəне рационализациялау. 
Қазiргi кездегi менеджменттiң көптеген ғылыми бағыттары мен 
мектептерiнiң қалыптасуына Роберт Оуэннiң (1771-1858) iлiмi үлкен ықпал 
еттi. «Мануфактураларды басқарушыларға үндеу» (1813) еңбегiнде Оуэн 
басшыларға «жансыз машиналармен» қатар «жанды машиналарға» да 
(қызметкерлерге) бiрдей көңiл бөлу керектiгiн атап өттi. Сол кезеңде 
бiрқатар тоқыма фабрикаларының басқарушысы болған Оуэн 1800-1828 
жж. кең ауқымды əлеуметтiк тəжiрибе жүргiздi. Ол бойынша 
жұмысшыларға жабдықталған тұрғын үй беру, еңбек, тұрмыс жəне демалыс 
жағдайын жақсарту, қол жетерлiк бағамен күнделiктi қажет тауарларды 
сататын дүкендер ашу көзделдi. Одан басқа балалар жұмыс iстей алатын ең 
төменгi жас деңгейi арттырылды, жұмысшы кенттерiнде мектептер 
ашылды. Сонымен қоса Оуэн қайырымдылық идеясын ғана емес, сондай-ақ 
осындай тəсiлмен еңбек өнiмдiлiгiн арттырудың экономикалық есебiн 
басшылыққа алды. Оуэн əлемде тұңғыш рет фабрикада моральдық 
ынталандыру əдiстерiн қолданды. Ол станоктарға түрлi түстi ленталарды 
байлады. Жалақыны арттырмағанның өзiнде екi айдан кейiн барлық 
станоктарда нормаларды асыра орындағанын бiлдiретiн қызыл түстi 
ленталар болды. 
Басқару теориясы мен тəжiрибесiнiң дамуына алғашқы есептегiш 
машинаның өнертапқышы ағылшын Чарльз Бэббидж (1791-1871) маңызды 
қадам жасады. Ол түрлi операцияларды жүзеге асыру кезiндегi жұмыс 
уақытының шығындарын зерделеу, бiр профильдi кəсiпорындарды ң 
жұмысын салыстырмалы талдау, статистикалық талдау негiзiнде еңбек 
тиiмдiлiгiн арттыру жолдарын табу, еңбекке ақы төлеудiң сыйлықақылық 
жүйесiн қолдану əдiстемелерiн əзiрледi. Өз зерттеуiнiң нəтижелерi мен 
практикалық ұсыныстарын Бэббидж ғылыми басқару саласындағы дүние 
жүзiндегi алғашқы басылым болған «Материалдар мен жабдықтарды 
үнемдеу туралы» (1832) атты кiтабында баяндады. 
Ресми түрде иiру машинасының өнертапқышы болып саналатын 
ағылшын Ричард Аркрайт (1732-1792) өз фабрикасының астында тоқыма 
өндiрiсiнiң барлық процестерiн бiрiктiрдi жəне оны ұйымдастырудың 
иерархиялық қағидасын енгiздi. Еңбектi бөлу, жабдықтарды 
орналастыруды жоспарлау, машиналар мен қызметкерлердiң жұмысын 
үйлестiру, тəртiптi қамтамасыз ету негiзiнде ол технологиялық 

процестердiң үздiксiздiгiне жəне шығындарды əжептəуiр үнемдеуге қол 
жеткiздi. Сөйтiп, Аркрайт бүгiндерi индустриялық басқару немесе өндiрiстi 
ұйымдастыру бағыттарының негiзiн қалады. 
Жинақталған тəжірибені жалпылау Ғылыми мектептердің қалыптасуы. 
Басқару туралы ғылым əрдайым қозғалыста болады. Жаңа бағыттар, 
мектептер, ағымдар қалыптасады, ғылыми аппарат өзгередi жəне 
жетiлдiрiледi, ақырында, зерттеушiлердiң өздерi жəне олардың 
көзқарастары өзгередi. Уақыт өте келе менеджерлер бағдарларын өзiнiң 
нақты ұйымының қажеттiлiктерiнен айналада əрекет ететiн басқару 
тəсiлдерiн зерделеуге ауыстырды. Олардың бiреулерi өз басқарушылық 
мəселелерiн бұрынғы кезеңде көмектескен тəсiлдермен шештi. Өзге 
зерттеушiлер басқаруға барынша жүйелендiрiлген тəсiлдемелер iздедi. 
Олардың жеке табыстары мен сəтсiздiктерi бүгiнгi таңдағы менеджерлер 
үшiн құнды сабақ болуы мүмкiн. 
Басқару практикасында сандық əдістерді қолдану. 
60-шы жж. бастап оның көмегiмен математикалық талдау жəне 
менеджерлердiң субъективтi шешiмдерiн шоғырландыруға қол жететiн 
математикалық аппаратты пайдалануға сүйенетiн басқару 
тұжырымдамаларын кеңiнен əзiрлеу басталды. 
Бiрқатар басқарушылық қызметтердi формализациялау, еңбектi, адам 
мен ЭЕМ-дi ұштастыру ұйымның құрылымдық элементтерiн қайта қарауды 
талап еттi. Шешiмдердi елiктегiш үлгiлеу, белгiсiздiк жағдайларындағы 
талдау əдiстерi, көп мақсатты басқарушылық шешiмдердi бағалауды 
математикалық қамтамасыз ету секiлдi фирмаiшiлiк жоспарлаудың жаңа 
элементтерi пайда болды. 
Қазiргi жағдайларда математикалық əдiстер басқарушылық ғылымның 
барлық бағыттарында пайдаланылып келеді. ХІХ ғасырдың ортасынан 
бастап жүйелі басқару тұжырымдамасы дами бастады. XX ғасырдың 
басында бұл тұжырымдама жаңа сапалы мəнге ие болып, басқару ұйымға 
жетістік əкелуі мүмкін дербес қызмет өрісі ретінде қарастырыла бастады. 
Əдетте басқаруды зерттеудің дербес саласы мен ғылым ретінде танудың 
басы деп есептелетін Тейлордың «Ғылыми басқару қағидалары» атты 
кітабы (1911) жарық көрген соң менеджменттегі жаңа революция кезеңі 
басталды. Бұл кезең кəсіби менеджерлер тобы бөлініп шығып, олардың 
капиталистер тобын «ығыстыруымен» сипатталады. 
ХХ ғасырдың бірінші жартысында басқару ойының 4 айқын 
ерекшеленетін мектебі дами бастады: 
1) Ғылыми басқару мектебі 
        2) Əкімшілік немесе классикалық басқару мектебі 
3) Адамдық қарым-қатынастар мен мінез-құлық ғылымының мектебі 
4) Басқару ғылымының мектебі (сандық тəсілдеме). 
 

Мектептер Басқару ойының дамуына 
қосқан үлестерi 
Өкілдері 
Ғылыми басқару 
мектебi 
1.Мiндеттi орындаудың ең 
жақсы тəсiлдерiн анықтау үшiн 
ғылыми талдауды пайдалану.  
2. Мiндеттi орындау үшiн 
барынша лайықты 
қызметкерлердi таңдап алып, 
оларды үйретудi қамтамасыз 
ету. 
3. Мiндеттi тиiмдi орындау үшiн 
қызметкерлердi қажеттi 
ресурстармен қамтамасыз ету.  
4. Өнiмдiлiктi арттыру үшiн 
материалдық ынталандыруды 
жүйелi əрi дұрыс пайдалану.  
5. Жоспарлау мен ойлауды 
жұмыстан бөлу 
Ф.Тейлор, Л. 
Гильберт, Г. 
Гантт, Г. Форд, 
Г.Эмерсон, А.К. 
Гастеев 
Əкiмшiлiк немесе 
классикалық 
басқару мектебi 
1.Басқару қағидаларын дамыту.  
2. Басқару қызметiн бейнелеу.  
3. Барлық ұйымды басқаруға 
жүйелi көзқарас. 
А.Файоль, М. 
Вебер, Дж. Муни, 
Л. Урвик, Г. Черч, 
О.А. Ерманский, 
А.А. Богданов 
Адамдық қарым-
қатынастар мен 
мiнез-құлық ғы-
лымының мектебi 
1.Қанағаттылық пен өнiмдiлiк 
дəрежесiн арттыру үшiн 
жекелiк қатынастарды басқару 
тəсiлдерiн қолдану. 
2. Адам қатынастары туралы 
ғылымды, əрбiр қызметкер 
əлеуетіне сай 
пайдаланылатындай етiп, 
ұйымды қалыптастыру мен 
басқаруға қолдану. 
Э. Мэйо, М. 
Фоллет, Ф. 
Макгрегор т.б. 
Басқару 
ғылымының 
мектебi 
1.Үлгiлердi жасау мен қолдану 
арқасында күрделi басқару 
мəселелерiн түсiнудi тереңдету.  
2. Күрделi жағдайларда шешiм 
қабылдайтын басшыларға 
көмек ретiнде сандық əдiстердi 
дамыту. 
Д. Форестер,  
Р. Люс,  
А. Гольдбергер,  
Ч. Бернард,  
Г. Саймон  т.б. 
 
Ғылыми басқару мектебі.  

Ғылыми түрде басқарудың негізі Фредрик Уинслоу Тейлор (1851 -
1915) тарапынан қаланған. Ғылыми басқару философиясының ең негізгі 
элементі - өнімділік. Ғылыми басқарудың əдісі, тəсілі мен құралдары 
өнімділікпен қамтамасыз етуге тəн. Ғылыми басқару, сонымен қа тар 
жұмысшы мен басқарма мүдделері арасындағы өзара тығыз байланыстың 
болуы, сол себептен ынтымақтасып бірге жұмыс істеулерінің қажетті жəне 
міндетті екендігі туралы ой-пікірге сүйенеді. Ф.Тейлор «ғылыми басқару» 
деген ой-пікірлерін «Ательені басқару» жəне «ғылыми басқарудың 
принциптері» атты екі шығармасында атап көрсеткен. 
Тейлор, ғылыми кəсіпкерлік саласында, қазіргі кезде де сөз етілетін 
«ғылыми басқарудың принциптерінің» мақсаттарын төмендегідей 
көрсетуде: 
Ø қымбатқа соққан тиімсіз жұмыстарды жəне шығындарды 
қарапайым мысалдармен келтіру; 
Ø осы тиімсіз жұмыстардың себебін, бірнеше төтенше күш пен 
адамдардың болмауынан емес, жүйелі басқару түсінігінің 
болмағандығын  халыққа түсіндіру; 
Ø ең тиімді басқарудың белгіленген заңдарға, принциптерге жəне 
ережелерге негізделіп, шын мəнінде ғылыми тұрғыда 
болғандығын дəлелдеу.  
Ғылыми басқару мектебінің(1885-1920) негізін қалаушылар байқау, 
өлшеу, логика мен талдауды пайдалана отырып, қол еңбегінің көптеген 
операцияларын жетілдіруге, сөйтіп өндіріс тиімділігін барынша арттыруға 
болады деп есептеді. «Ғылыми менеджменттің атасы» американ 
инженері Фредерик Тейлор (1856-1915) жүргізілген зерттеу барысында ол 
«ғылыми менеджмент» немесе «ғылыми басқару» деген атқа ие қоғамдық 
қозғалыс туғызды. Ұйымның ғылыми өндірісінде Тейлор 3 ұстанымды 
ашып көрсетті: 
Саралау қызметі ұстанымы , жеке жұмысшыларға берілге н 
нұсқаулар тобы. Жұмысшыларға белгілі бір өндірістік тапсырманы 
орындаудың əдістері көрсетілген жазбаша нұсқаулар берілген. 
Мамандану ұстанымы, əр адамның мүмкіндігі белгілі бір басты 
қызметті орындауға жұмсалуы тиіс.   
Материалды қызығушылық ұстанымы. Тейлордың жұмыстары 
материалды қызығушылықтар ұстанымына басты рөль беретін 
«экономикалық адам» концепциясының негізін қалады. Жұмысшы істеген 
жұмысына қарай жалақы алу тиіс деп пайымдады Тейлор. 
Тейлордың  зерттеулерінің басты міндеті өндірістен алынатын өнімді 
оны кеңейту арқылы алу емес, керісінше еңбекті ынталандыру арқылы  
жетістіктерге жету. Ол ең алғаш рет «адами фактор» түсінігін енгізіп, өзінен 
кейінгі көптеген ғалымдардың жаңалықтар ашуына себепші болды. 
Г.Форд өндірісті ұйымдастырудағы «Тэйлор жүйесін» жетілдіре 
отырып, төмендегідей атап өтті:  

- өндіріс процесі мен сатыларын байланыстыра отырып, дəл есептеу, 
жоспарлау; 
- қажетті жұмыс пен басқа ресустарды  əзірлеу; 
- стандартты технологиялар мен механизмдерді  қолдау; 
- өндірісті жетілдіру жолдарын үнемі  қарастыру. 
Басқарудың классикалық жəне əкімшілік басқару  мектептері.  
Классикалық мектеп өкілдерінің ұйғарымы бойынша басқару - белгілі 
мақсатқа жетуде орын алатын қатаң əкімшілік қағида, əдістердің 
жиынтығы. Мəселен, осы бағыттағы көрнекті өкілі Файолдің пікірінше, 
əкімшілік ету жан - жақты ауқымын белгілейтін басқарудың бір бөлігі, жəне 
де техникалық, коммерциялық, қорғаныстық, бухгалт ерлік, əкімшілік 
салаларын қамтиды. Осы қызметтер арасында əкімшілік əрекет ең маңызды 
есептелініп, оның элементтері: жоспарлау, ұйымдастыру, басшылық ету, 
үйлестіру жəне бақылау анықталған. Сонымен қатар, А.Файол тəжірибеде 
кең қолдану тапқан басқарудың 14 қағидасын жасап шығарды. Оларға: 
жауапкершілік, жеке дара басшылық, иерархиялық басқару,  жеке жəне 
жалпы мүдделер үйлесімділігі, мамандандыру, тəртіп, əділеттілік, ынта - 
ықылас, лауазымға сəйкестілік, қызметкерлер тұрақтылығы, 
орталықтандыру жəне т.б.  енеді. 
Ұйымдағы басшылық, билік жəне құрылым құру проблемаларына 
көңіл бөліп зерттеуде əкімшілік мектептің келесі бір өкілі ерекше орын 
алады. Ол əртүрлі ұйымдарды талдай отырып, басшы ие болатын билік 
сипатына қарай ұйымдастырудың негізгі үш кезеңін, яғни харизматикалық, 
дəстүрлі жəне идеалды кезеңдерін ажыратып берді. 
Неміс ғалымы Макс Вебер (1864-1920) ұйымдағы билік құрылымы мен 
лидерлік мəселелерге жете назар аударды. Əртүрлі ұйымдарды талдай 
отырып, басшы ие болатын билік сипатына қарай ұйымдастырудың негізгі 
үш түрін ажыратады: харизмалық, дəстүрлі жəне бюрократтық. 
«Шаруашылық тарихы» жəне «Протестанттық этика жəне капитализм 
рухы» кітаптарындағы капиталистік өндірістегі протестантизм этикасы 
бастауын талдауы негіз болды. Ол капиталистік өндіріс құр ылымында 
еңбек бөлінісін оңтайландыру идеясы жатыр деп есептеді. Ол «əрекеттің 
мінсіз типі» түсінігін енгізіп оның 4 түрін қарастырады: А) дəстүрлі;  Б) 
аффективті; В) құндылықты – оңтайландырылған; Г) мақсаттандырылған. 
Қолайсыз түсінігіне сүйене отырып Вебер капиталисттердің 2 типін 
қолайсыз(архаикалық, авантюристтік, көпестік) жəне қолайлы(өнімді)  
бөліп шығарды. Қолайсыз капиталисттік  тип бойынша табиғи 
шаруашылық жəне тауар айырбастаудағы теңсіздік əулеттік құрылымнан 
дамыды деп шешті. Капиталисттіктің екінші типі қолайлы шіркеудің 
реформацияланып, еңбектің діни мағынаға ие болып, адамдардың басты 
құндылығына айналуы себепші болды. Тарих бойынша капиталистіктің екі 
типі бір мезгілде өмір сүрді, тек үстемші тип ретінде еңбекті қолайлы 
пайдалану дамыды. Соның нəтижесінде басқару жүйесі, ғылым, білім 

сияқты жаңа құрылымдар пайда болып Вебердің бюрократия теориясын 
туғызды. Оның пайымдауынша бюрократия басқаруды ұйымдастырудағы 
негізгі жол болып саналды. Жұмысшылар басқарушының бұйрығына емес, 
тиімді ережелер жиынтығына бағынуды қалайтынын көрсеткен бұл теория 
«басқарудың ғылыми баспалдағы» болып саналды 
М.Вебер ұйымдастырудың аталған түрлерін зерттей келіп, үшінші 
кезеңге үлкен көңіл бөле отырып, «бюрократиялық жүйе қағидаларын» 
жасап шығарды: 
- нақтылы еңбек бөлінісі; 
- басқару деңгейлерінің жіктелуі; 
- міндеттер бірыңғайлығымен үйлестіріле қажетті ресми ережелер мен 
стандарттар жүйесін жасау; 
- əлеуметтік аралық пен əділеттілік; 
- жұмысқа қабылдауда қатаң орын алуы жатқызылады. 
Адамдық қатынастар мектебі жəне тəртіптік тəсілі.  
ХХ ғасырдың орта шеніне қарай ғылыми басқару жəне əкімшілік 
мектептердің адам факторына жеткіліксіз көңіл бөлуіне жауап ретінде жаңа 
бағыт адамдық қатынастар мектебі пайда болды. Оның өзі классикалық 
көзқарастағы кемшіліктерді шешу мақсатында пайда болғандықтан, 
адамдық қатынастар мектебін кейде неоклассикалық мектеп деп те атайды. 
Адамдық қатынастар мектебінің көрнекті өкілдеріне М.Фоллет, Э.Майо, 
Д.Макгрегор т.б жатқызылады. 
Адамдық қарым-қатынастар(1930-1950) мен мінез-құлық ғылымының 
мектебін(1950 жылдан қазіргі кезге дейін) дамытуға негізгі үлес қосқан 
ғалымдар Мэри Паркер Фоллет (1868-1933) пен Элтон Мэйо (1880-1949) 
болып табылады. Элтон Мэйо «Индустриалды өркениеттің адами 
мəселелері» (1933), «Индустриалды өркениеттің əлеуметтік мəселелері» 
(1945), «Индустриалды өркениеттің саяси мəселелері» (1947) кітаптарында 
еңбек адамдарға қуаныш əкелмейтін күйге жетті деп көрсетті. Ол еңбек  
өнімділігін көтеру мəселесін көп қозғап, Хоторне қаласындағы «Вестерн 
Электрик Компани» компаниясындағы 1927-1939 жылдар арасындағы 
тəжірбиесі арқасында АҚШ-та ғана емес, басқа елдерде де үлкен атаққа ие 
болды. Осы тəжиірибе нəтижесінде ол мынандай қорытындылар жасады: 
1. Адам – топта жұмыс істеуді қажет ететін əлеуметтік жаратылыс. 
Жұмысшылар мен төмен жəне жоғары лауазымды менеджерлердің 
əрекеттерін олардың қатынастарын зерттей отырып алдын ала болжауға 
болады.  Топ белгілі бір мақсатқа қол жеткізу барысында бір – бірімен 
араласуы арқылы ғана өмір сүреді. 
2. Топтың  барлық мүшелері топ ережелеріне сəйкес өздерін ұстайды, 
жұмысшылар шешімді жеке тұлға ретінде емес, топ мүшелері ретінде 
қабылдайды. Топтық ережелер топ мүшелері құрастырған идеялар. Олар 
жұмысшылардың қай бағытта, қандай жұмыс істеуін анықтайды. 

3. Жұмысшы өнімі оның физикалық мүмкіндіктерімен емес, топтық 
ережелермен анықталады. Топтық ереже атағы моральды əсер ету 
құралдарының көмегімен іске асады.  
4. Өндіріс басшылары өнімге емес адамдарға бағытталуы керек. Қатаң 
бағындыру иерархиясы мен бюрократиялық ұйымдар е ркіндікті қалап 
тұратын адам табиғатына қайшы келеді.  
Америкалық белгілі маман Дуглас Мак – Грегор (1906-1964) Х жəне У 
əріптерімен белгіленген басқарудың екі теориялық концепциясын жасап 
шығарды. Автор бұл теориялар адам табиғатына əртүрлі көзқарас 
туғызады: егер Х теориясы адамды өндірісте жекешеліктен айрылған 
механистикалық көзқарасты анықтаса, У теориясы адамды оның ішкі 
ортасымен қатынасының органикалық байланысы көзқарасы ретінде 
түсіндіреді. 
Х теориясының шарттары : Қарапайым адам жұмыс істеуді ұнатпайды, 
əрі жұмыстан мүмкіндік болса жалтаруға тырысады. 
Басшылыққа жұмысшылардың өз міндеттерін атқаруы үшін күш 
көрсетуге жəне жазаға тартуға тура келеді. Қатардағы жұмысшы селқос əрі 
өзін басқарғанды қалайды, шешім қабылдауға əрі жауапкершілікті мойнына 
алуға құлықсыз. Х теориясын қолдануда  Мак – Грегор сəйкес 
ұстанымдарын құрастырды: 
Ұйымды қатаң басқару. Заң өкілеттерін дəстүрлі түрде 
орталықтандыру. Шешім қабылдау үрдісінде жұмысшылардың аз болуы. 
У теориясы ұстанымы басқаша: Өзін – өзі ынталандыру мен жұмыс 
үрдісінде адам рахаттану үшін ол ұйымның  мақсаттарының орындалуына 
ортақтасып, ерікті түрде жұмыс істейді. Ынталандырудың  бір факторы 
ретінде жұмысшының қоғам өміріне араласуы, өзіне міндет жіктеуі болып 
табылады. Адамның  жұмыс істеуіне жағдай жасалса ол өзіне 
жауапкершілік алудан қорықпайды. Шығармашылық жəне басшылық 
мəселелерді шешуді адамдардың аз тобына емес, жұмысшы топқа беру 
керек. Көрсетілген шарттарға байланысты Мак – Грегор келесі 
ұстанымдарды ұсынады: 
-Ұйымды еркін əрі жалпы басқару. 
-Ресми өкілеттілікті орталықтандырмау. 
-Өзін – өзі бақылау мен жекеше белсенділікті арттырып, бақылау мен 
мəжбүрлеуді азайту. 
-Басқарудың демократиялық стилі. 
Бұл мектептің айрықша ерекшелігі оның психологияға, соның ішінде 
XX ғасырда кеңінен таралған əрі  жете зерттелген психологиялық 
теориялардың бірі - бихевиоризмге (мінез-құлық туралы ғылым) 
бағытталуы болды. Мектептің негізгі мақсаты адам ресурстарының 
тиімділігін арттыру есебінен ұйымның тиімділігін арттыру болып 
табылады. 

Басқарудың ғылыми мектебінің қалыптасуы математиканың, 
статистиканың, инженерлік ғылымның жəне олармен аралас басқа да білім 
салаларының дамуымен байланысты. Бұл мектептің ең танымал өкілдері – 
Р.Акофф, Л.Берталанфи, С.Бир, А.Гольдбергер, Д.Фосрестер, Р.Люс, 
Л.Клейн, Н.Джорджеску-Реган. Басқарудың ғылыми мектебі 50 -
жылдардың басында қалыптасты жəне қазіргі уақытта да табысты жұмыс 
істейді. Басқару ғылым мектебінде екі басты бағыт бар.Жүйелік, үдерістік 
жəне жағдайлық тəсілдерді пайдалана отырып, өндірісті «əлеуметтік жүйе» 
ретінде қарастыру. Математикалық əдістер мен ЭЕМ қолдануды қоса 
алғанда, жүйелік талдау жəне кибернетикалық тəсілді қолдану негізінде 
басқару мəселелерін зерттеу. Басқару ғылым мектебінің еңбегі оның 
ұйымға əсер ететін негізгі ішкі жəне сы ртқы 
айнымалыларды(факторларды)айқындай алды. Екінші бағыт басқару 
ғылым мектебін нақты ғылымдардың,ең алдымен математиканың 
дамуымен байланысты. Қазіргі жағдайда көптеген ғалымдар бұл бағытты 
жаңа мектеп деп атайды. XIX ғ.экономикалық зерттеулерде математикалық 
əдістерді қолданудың басталуы француз экономисі А. Каунот (1801-1877) 
атымен байланыстырады. Осылайша,басқару шамамен жеті мың жыл 
бұрын пайда болды, бірақ XIX ғасырдың аяғынан бастап, əсіресе ХХ-шы 
жылдары, əлеуметтік нарықтық шаруашылықтың дамуымен менеджмент 
дербес білім саласына, яғни ғылымға бөлінді . ХХ ғ.басқару ойының 
дамуындағы жаңа кезеңнің қалыптасуымен сипатталады.Алдыңғы 
кезеңдерде ұсынылған идеялардың синтезі негізінде зерттеушілер 
басқарудың кешенді тəсілінің қажеттілігін түсінуге келді. Сонымен қатар, 
басқару-бұл ғылым ғана емес, өнер деген пікір қалыптасты.  Батыс 
менеджменті – бұл ең алдымен өзінің құндылықтарымен, нормалары мен 
заңдарымен ерекше субмəдениет. Екінші жағынан – бұл қойылған 
мақсаттарға қол жеткізу үшін қажетті техникалық рəсімдер мен əдістердің 
жиынтығы, жоспарлау, ұйымдастыру, уəждеу жəне бақылау жөніндегі 
нақты іс-əрекеттердің сомасы. Бүгінде нарықтық экономика оған тең 
келетін басқару жүйесін талап етеді, ол барлық қоғаммен бірге түбегейлі 
өзгерістерге ұшырауы тиіс.Нарықтық қатынастарға көшу жағдайында 
басқарудың теориясы мен практикасын үздіксіз жетілдіру табыстың 
маңызды факторы болып табылады.Шетелдік басқарудың озық жəне 
прогрессивті тəжірибесін зерделеу жəне оны меншікті басқару 
проблемаларын талдау кезінде пай далану үлкен мəнге ие 
болады.Сондықтан шетелдік менеджменттің теориясы мен тəжірибесінің 
даму тарихын зерделеу өте өзекті. Қызметкерлерді басқару менеджменттің 
ең бір маңызды фунццияларының бірі болып табылады. Басқару – негізгі 
өндірістік, шығармашылық күш. Қазіргі заманғы күрделі өндірісте адам 
рөлі өсуде, соның нəтижесінде қызметкердің қабілеттіне, білім мен 
біліктілік деңгейіне жоғарғы талаптар қойылуда.  Ғылыми-техникалық 
прогресс еңбек əдістерінің терең  өзгерістеріне əкелді, яғни қызметкерлерді 

ұйымдастыру мен басқарудың жаңа нысандарын талап етеді. Адам 
ресурсын қолданудың тиімділігін арттыру бағыттары əр түрлі менеджмент 
моделінде əр түрлі қарастырылған.Əр елде белгілі бір моделді елдің  
тарихи, əлеуметтік-саяси, ғылыми-техникалық дамуы, псиихологиялық, 
моральді-этикалық нормалар мен адам тəртібінің стилі, олардың тəрбиесі, 
əдет-ғұрыптарна қарай отырып қолданады.  Менеджменттің өзіне 
бейімделген моделін құрастыруда меншік типі, мемлекеттің түрін, 
нарықтық  қатынастардың қалыптасқан уақытын ескеру қажет. 
Американдық жəне Жапондық жəне Батыс Еуропалық педагогикалық 
менеджментінің артықшылықтары мен кемшіліктерімен анықтау жəне 
салыстыру. Американдық  Жапондық  Батыс Еуропалық Американдық 
моделі менеджмент. Негізін қалаған ғылым деп са налады американдық 
инженер жəне зерттеуші Ф. Тейлор. 
Америкалық педагогикалық менеджментінде жұмысқа алу жəне 
кадрлық саясатта жұмысшыларды университеттер желісі,бизнес мектептері 
арқылы еңбек нарығынан жұмысқа алу. Жұмысшыларды жеке бағалау жəне 
аттестациядан өткізу.Жеке нəтижелері мен жұмысшының еңбегіне 
байланысты жалақы төлеу. Америкадағы педагогикалық менеджмент 
«басқару шеберлігі» деп те қарастырылады. Ол өз стандартсыз жəне ерекше 
шешімдерімен көрінетін, менеджердің көрнекті ойы мен интуициясына 
негізделеді.  
Жапондық педагогикалық менеджментінде мектеп пен ЖОО-ның 
еңбегі кеңінен қолданылады. Өндірістен қол үзбестен, кəсіпорывн ішіндегі 
мамандарды оқыту мен қайта даярлау. Жұмыс істеу жылдарының 
мөлшеріне қарай қызмет бабының жылжуы. Кəсіпорындағы еңбек өтілімі 
мен жасына қарай жалақы төлеу. Əкімшілігі ауысқан кезде кəсіпорын 
философиясы өзгеріссіз қалады. Жұмысшылар өз орнында қалады. 
Жапондық менеджменттің мəні адамдарды басқару болып табылады. Осы 
ретте жапондықтар американдықтар сияқты, бір адамды (тұлғаны) емес, 
адамдар топтарын қарастырады. Осыған байланысты Жапонияда жасы 
үлкенге бағыну дəстүрі қалыптасқан, бұл позицияны топтың барлық 
мүшелері мақұлдайды. 
Батыс Еуропалық педагогикалық менеджменттің тəрбие жағына жəне 
басқару жағына бағытталған. Қамту дəрежесі бойынша. Қызмет ауқымы 
бойынша (стратегиялық, тактикалық, жедел); мектепке қатысты жалпы 
біліммен қамту, тəрбие жұмысы, əдістемелік жұмыс т.б.); Басқару 
жауапкершілігінің келесідей түрлері қалыптасқан: жалпы – қызметке орай 
жағдайларды жасау; белгілі қызметтік – нақты іс-əрекеттерге байланысты 
шарттарды түзу. Батыс корпорацияларының ұйымдастырушылық 
мəдениетінің қалыптасуына əсерін тигізетін компоненттерінің бірін таңдап 
алу күрделі. Соңғы уақытта Батыс фирмалары жұртшылықпен 
байланыстарға көп көңіл аударады.  

Американдық жəне Жапондық жəне Батыс Еуропалық педагогикалық 
менеджментінің артықшылықтары мен кемшіліктерімен анықтау жəне 
салыстыру. 
Сонымен, менеджментті ұйымның тиімді жəне əрекетті 
функционалдану мақсатында интеллектуалды, материалды жəне қаржылық 
ресурстарын мобилизациялау үшін ғылым, шеберлік жəне іс-əрект деп 
анықтауға болады. Менеджменттің жапондық моделі «əлеуметтік адамға» 
негізделген. Алайда жапондықтардың «əлеуметтік адам» түсінігіне 
қатынасы американдықтарға қарағанда иілгіш болып табылады. Басқару 
тиімділігінің қажетті шарты: корпорациялық құндылықты жұртшылыққа, 
болашақ тұтынушыларға жəне əлемдік қоғамдастыққа жеткізудің құралы 
Сонымен, қорытындылай келе педагогикалық модельдеріне, 
жүйелеріне басқаруына талдау жасалды.Алдыңғы қатарлы тəжірибені 
танып білу өте маңызды болды. Бұл модельді салыстыра отырып, талдауда, 
біздің қызығушылығымыз елеулі. Өз еліміздің педагогикалық менеджмент 
моделін құрастыруда жоғарыдағы елдердің тəжірибелерін ескергуе болады.  
Біздің ойымызша, осы 3 модельді салыстыра отырып , Қазақстан 
педагогикалық менеджментіне сəйкес келестін тұстарын қарайтын болсақ, 
жапондық жəне американдық модельді қолданған көбірек жұмыс 
тиімділігіне алып келеді, педагогикалық менеджмент оқу -тəрбие, оқу-
таным үдерісінің жəне білім берудің бүкіл жүйесінің тиімділігін арттыруға 
бағытталған, оларды басқарудың принциптері, əдістері, ұйымдастыру 
нысандары мен технологиялық тəсілдерінің кешені болғандықтан, бүкіл 
модельдерді бір-бірімен салыстыра отырып, тəжірибе жинақтауға болады. 
Сонымен, басқарудың түрлі жүйелеріне талдау жасалды, яғни американдық 
жəне жапондық менеджмент. Алдыңғы  қатарлы тəжірибені танып-білу өте 
маңызды мəселе болып табылады. Алайда, қа ндай да болсын басқару 
жүйесін салыстырмалы талдауда мынаны ескеру қажет: қай басқару 
жүйесін болсын оны тек механикалық түрде қолдану жоғары тиімділікке 
кепілдеме бермейді. Өндірістік ұйымның тиімділігі тек қана белгілі бір 
басқару жүйесінің қолданылуымен негізделмейді. Ол жүйеге өндірістің 
бөліктері, жұмысшылар қалай бейімделгенін де ескеруі қажет. Əр басқару 
жүйесін талдағанда сол жүйе орын алатын елдегі кəсіпорынның жеке 
ерекшеліктерін, сол елдің ішкі-сыртқы экономикалық жағдайын да назарға 
алу керек. Қызметкерлерді басқарудың тиімді тəсілдерін тану бізге оларды 
қолданудың кең мүмкіндігін береді. Американдық жəне жапондық 
менеджмент модельдерін салыстыра талдау,мынаны көрсетеді: 
менеджменттің бір моделін басқа елдің экономикасына көшіруге 
болмайды,себебі ол елдің өзіндік ерекшеліктері, спецификалық шарттары, 
психологиялық, əлеуметтік-мəдени факторлары бар. Алайда бұл екі 
модельді салыстыра талдауда біздің елеулі қызығушылығымыз бар.  Өз 
еліміздің менеджмент моделін құрастыруда жоғарыдағы елдердің 
тəжірибелерін ескеруге болады. 

Біздің ойымызша, осы үш модельді салыстыра отырып Қазақстан 
менеджментіне сəйкес келетін тұстарын қарайтын болсақ,онда өндіріс  
орындары, цехтар, зауыт фабрикаларда жапондық модельді қолданған 
көбірек жұмыс өнімділігі мен тиімділігіне алып келеді. Себебі, Жапон 
мемлекеті өндірістің жетілгендігімен, дамығандығымен танымал жəне олар 
өз істерінің өнімділігін басты мақсат етіп қойып, соған жету жолында 
барлық менеджменттік мүмкіндіктерді пайдаланады. Ал өз кезегінде, 
қаржылық мекемелер, маркетингтик фирмалар, ті келей өнім өндіретін 
өндіріске қатыссыз кəсіпорындар көбіне американдық  модельді ескеруі 
тиіс деп ойлаймын. Себебі, бұл модельде адамның жеке басының 
қызметінің өсуіне баса назар аударылған, ал қазіргі кезде қызметкерлер 
көбіне қызмет бабының өсуін жəне істелген жұмыстарына қарай тиісті 
жалақыларын алуды қалайды.Нарықтық қатынастар негізінде экономиканы 
қайта құрудың қазіргі заманғы жағдайларында оның басым бағыттарының 
бірі отандық ұйымдардың практикалық қызметінде менеджментті 
пайдалану бойынша негізгі теориялық жəне əдіснамалық ұстанымдарды 
əзірлеу болып табылады.Басқару ойыны ң негізгі ерекшелігі басқару 
жүйесін жетілдірудің жаңа нақты жəне жолдарын іздеу, нарықтық 
жағдайларға қатысты жəне алдыңғы қатарлы шетелдік тəжірибені 
шығармашылық пайымдау негізінде басқарудың əртүрлі проблемалары 
бойынша ұстанымды əзірлеу болып табылады.  
Бақылау сұрақтары:  
1.  «Адамгершілік қатынас» мектебінде ұйым қызметін түсіндіріңіз.  
2. Басқарушы менеджерлер мынадай 2 категорияға бөлінеді: «Х» 
теориясы жақтаушылар жəне «Y» теориясын жақтаушылар, атты 
концепциясын сипаттаңыз.  
3. ХХғ. басында Ф.Тейлордың басқару жүйесіне байланысты 
еңбектеріне тоқталыңыз. 
 

`},{id:"lecture-4",category:"lecture",shortTitle:"4-дәріс",title:"§ 4 Жеке тұлға басқарудың объектісі мен субъектісі",pdfFile:"./assets/docs/4sabak.pdf",numPages:9,textHtml:`<h3 class="chapter-subheading">§ 4 Жеке тұлға басқарудың объектісі мен субъектісі Басқару субъектісінің басқару объектісіне ықпал жасау əдістері басқару əдістері деп түсіндіріледі. Басқару əдістері ұжымдар қызметінің жоғары тиімділігін, олардың ынтымақты жұмысын қамтамасыз етуге тиіс. Мұның өзі басқару əдістерін өндірістік-шаруашылық міндеттерді шешу процесінде қолданылатын басқа да техникалық жəне технологиялық əдістерден ерекшеленеді. Басқару əдістері басқ ару процесін мүлтіксіз ұйымдастыру, осы замаңғы техниканы пайдалану, еңбек пен өндірісті прогресті жолмен ұйымдастыру үшін жағдайлар жасайды, олардың барынша тиімді болуын қамтамасыз етеді. Сонымен, əдістер -басқару қызметінің мəні жəне негізгі мазмұны болып табылады, өйткені басқару міндеттері солар арқылы іске асырылады. Басқару ілімінде бірнеше əдістер бар: 1.Əкімшілік əдістері 2.Экономикалық 3.Əлеуметтік-психологиялық. Басқару бұл элемент, функция, белгілі бір құрылымдарды сақтауды қамтамасыз ететін, ұйымдасқан жүйелердің режимін қолдау, олардың қызметін жүзеге асыруға, олардың бағдарламалары мен мақсаттарын түсіндіреді. Ұйымға біріккен адамдарды басқару туралы сөз болғанда, онда көптеген басқа да аспектілері сияқты басқарушылық қызметіне психологиялық аспектте кіреді, сондықтан да психологиялық ғылымда табысты дамып келе жатқан, жаңа пəн ретінде-басқару психологиясы пайда болды. Басқару жүйесінде жеке тұлға басқару субъектісі ретінде де, басқару объектісі ретінде де қабылдана алады жəне көбінесе бір уақытта субъект пен объектіні біріктіреді. Жеке тұлға басқару субъектісі ретінде белгілі бір басқару объектісіне бағытталған пəндік -практикалық əс-əрекеттің тасымалдаушысы, басқарушылық қызметтің көзі ретінде танылады. Жеке тұлға басқару объектісі ретінде басқарушылық əсердің мақсаты болып табылады, жоғары басқару субъектісінің басқарушылық шешімдерін іс жүзінде жүзеге асырады. Осыған сүйене о тырып, басқару психологиясында «бағынуды үйренбестен басқаруды үйрену мүмкін емес» деген алтын қағида бар. Бұл алдыңғы тақырыптарда анықтағанымыздай, əлеуметтік басқарудағы басқару субъектісі мен объектісі үнемі өзгеріп отырады жəне сонымен бірге субъект те, объект те бола алады. Бұл басқару субъектілері мен объектілері ретінде жеке тұлғаға да, ұйымғада толықтай қатысты. Басқару субъектісі ретіндегі жеке тұлға қасиеттерінің негізгі блоктарының бірі-ұйымдастырушының қасиеттері. Ю. Н. Емельяновтың пікірінше, жеке тұлғаның ұйымдастырушылық əлеуеті-бұл жеке тұлғаны ғана емес, сонымен бірге осы адамның</h3>
<p>ұйымдастырушылық қызметі жүзеге асырылатын əлеуметтік ортаның параметрлерін сипаттайтын жүйелік сапа. Бұл жүйелік сапа қоғам, ұжым, жеке тұлға жəне оның қызметінің объектісі арасындағы түйісте пайда болады. Сондай-ақ, жеке тұлғаның ұйымдастырушылық қасиеттері иерархиялы екенін атап өткен жөн. Бұл иерархияда басшының ұйымдастырушылық қасиеттерінің эмоционалды -еріктік компоненті негізделген ұйымдастырушылық инстинкт басым болады. Ұйымдастырушылық қызметке бейімділік барлық басқа жүйелік қасиеттердің дамуын қамтамасыз ететін негіз болып табылады. Л. И. Уманский басқару субъектісі ретінде жеке тұлғаның ұйымдастырушылық қасиеттері жеке тұлғаның белгілі бір психологиялық қасиеттеріне негізделген деп санайды. Психологиялық талғампаздық-адамның жалпы топтық мəселені шешу барысында ұйымдасқан топтың психологиясын жеткілікті түрде толық көрсете білу қабілеті. Ақыл-ойдың практикалық психологиялық бағыты-практикалық психология саласындағы білім мен дағдылардың жиынтығы, оларды ұйымдастырушылық мəселелерді шешу практикасында қолдануға дайын болу. Психологиялық əдептілік-адамдармен қарым-қатынаста шекті шаманың болуы. Жеке тұлғаның мұндай қасиеттерін Л.И.Уманский жиынтығында «ұйымдастыру сезгіштігі» деп қарастырады. Əлеуметтік жігерлілік - адамның ұйымдастырылатын адамдарды өз жігерімен қуаттандыру қабілеті. Талапшылдық-жағдайдың ерекшеліктеріне қарай ақылға қонымды талаптар қоя алу қабілеті. Сыншылдық - қойылған тапсырмалар мəжбүрлейтін жағдайлардан осы іс-əрекеттің маңызды ауытқуларын анықтау жəне білдіру мүмкіндігі. Осы үш қасиетті Л.И.Уманский сондай-ақ эмоционалды-ерікті əрекетсіздік деп аталатын бүтін құбылысқа біріктіреді. Ұйымдастырушылық қызметке бейімділік-осы қызметке деген əлеуметтік жағына қарай бағдарланған жəне оң эмоционалды бояуы бар ішкі қажеттілік. Басқару объектісі ретінде əрекет ете отырып, адам басқарушылық əсерге бағына алуы, сезіне алуы жəне бейім болуы керек. Бағынудың əртүрлі түрлері бар: бастамашыл, немқұрайлы жəне қыңыр. Егер адам басқару объектісі ретінде бір мезгілде субъект болмаса, онда ол қыңыр жəне немқұрайлы бағынуға құқылы. Егер адам бір уақытта басқару субъектісі болса, онда ол бастамашыл бағынудың тасымалдаушысы болуы керек.</p>
<p>Немқұрайлы бағыну жұмыскердің өз жағдайына қанағаттанатынын, жауапты шешімдер қабылдаудан қашатынын, «Менің шаруам шамалы, не болса ол болсын» қағидаты бойынша əрекет ететінін көрсетеді. Қыңыр бағыну-мəжбүрлі жəне сырттай таңылған əрекет деп қабылданады, жұмыскер өкім алған кезде, əдетте «Неге мен?» деген сұрақ қояды. Ол бағыну қажеттілігін, оның функционалдық міндеттерін, басқарушылық өзара іс-қимыл жүйесіндегі орнын нашар түсінумен сипатталады. Бастамашыл бағыну-бағыну қажеттілігін түсінумен сипатталады. Борыш сезімі əдетке айналады, бірақ бастамашылдық сезімін баспайды. Бағыну жоғары басшының беделін құрметтеу мен оның бұйрығын сыни бағалаудың үйлесуіне негізделген. Басшының субъект жəне басқару объектісі ретіндегі қызметі өте қайшылықты: - басшы қатаң құрылымдалған жағдайларда жұмыс істейді (жоспарлардың болуы: стратегиялық, тактикалық, жедел); - басшының алдында тұрған міндеттерді (тəуекелді жəне қалыптасқан, пысықталған, стереотиптік іс-əрекеттер арасында) шешу тəсілдері мен əдістерін таңдау дилеммасы үнемі тұрады; - үнемі өзгеріп отыратын ішкі жəне сыртқы айнымалылар, олар жаңа қызмет жағдайларына сəйкес келмеуі мүмкін көшбасшының құзыреттілігіне күмəн келтіруі мүмкін; - жоғары тұрған басшылық тарапынан үнемі өзгеріп отыратын ұйымдастырушылық жағдайлар жағдайында басшының қабілеті мен жеке өсуіне барабар бағалаудың болмауы; - ұйымдастырушылық қақтығыстарды басқаруда тиімсіз мінез-құлық стратегияларын таңдау; - орындаушылардың пікірін ескермей басқарушылық шешімдер қабылдау; - қызметкерлердің бастамашылық пен шығармашылық танытуға деген ұмтылысына зиян келтіретін басқару құжаттарының, нұсқаулықтардың талаптарын қатаң сақтау қажеттілігі: - қызметте жетістікке жетуге бағытталған көшбасшының жеке мотивациясының сəйкес келмеуі жəне қызметкерлердің жүріс - тұрысына оң уəждеменің болмауы. Қазіргі басқару жүйесі мен заманауи басшының ерекшеліктеріне мыналар жатады: - басшы əйелдер санының өсуі; - интеллект рөлінің өсуі жəне техникалық құзыреттілік деңгейін кеңейту қажеттілігі; - білім деңгейін арттыру, екі жəне одан да көп жоғары білімнің болуы; - ұйымдастырушылық құрылымның барлық деңгейлерінде шешім қабылдауға қатысатын адамдар тобын кеңейту;</p>
<p>- басшылардың əлеуметтік жауапкершілігі рөлінің артуы; - кəсіби ұтқырлық. Əлеуметтік басқарудың басқа түрлерден айырмашылығы оның басты компонентті болып əртүрлі ұйымдардың мүшесі ретінде адамдар, немесе ұйымдастыру бөлімшелері тұтастай қатысады. Жеке тұлғалар (жеке өзі, немесе əлеуметтік топтардың құрамында) ұсынылып отырған күрделі жүйеде басқарушылық қарым қатынаста болуы керек, оған басқару субъектісі мен объектісі қатыса алады. Автордың жазуы бойынша əлеуметтік басқарудың негізгі категориялары «ұйым», «басқару субъекттісі мен объектісі» болып табылады. Басқару субъектісі заттық-практикалық қызметтің тасымалдаушысы, белсенді басқарудың көзі, белгілі бір басқару объектісіне бағытталған болады. Басқару субъектісі жеке тұлға ретінде, неме се əлеуметтік топ ретінде қатыса алады. Басқару объектісінің бір бөлігі объективті шындық болуы мүмкін, яғни оған басқарушының əсері бағытталған. Басқару объектісінде сондай -ақ жеке тұлға немесе əлеуметтік топта бола алады. Əсер ету адамдар қатынасының басты құрамдас бөлігі ғана болып қоймай, көсемдіктің психологиялық негізі болып табылады. Басшы болу үшін əлуетті күш қана емес, адамдарға əсер ете алу қасиетіне ие болу керек. Өз ойыңды біреулерге жүктемес бұрын билікке ие болу керек. Билік көптеген қорларға сүйенуі қажет: мүмкіншілік, əрекеттер,т.б. Олар материалды, идеалды болуы мүмкін. Қорлардың 3 тобы бар: • белгілі бір адамның билігінен емес, оның қоғамдағы ресми атқаратын рөліне байланысты əсер ету амалы. • адамның жеке тұлғалық қасиеттеріне əсер ету амалы. • басшының сендіру үшін айтылған белгілі бір сөздері арқылы əсер ету амалы. Барлық қорлар бір – бірімен тығыз байланысты, олар бір – бірін өзара толықтырып отырады. Жазалау мен мараппаттау арқылы билеу ол қарапайым басшылық үлгісі болып саналады. Бұл əсер етудің кемшіліктері бар: бағынушы тек тыңдауңа тиіс болған соң ғана бас иеді, егер оған жақсы жағдай жасайтын басқа басшы ұсыныс жасаса ол бірден келісімін беруі мүмкін. Əсер ету əр топқа əр түрлі əсер етеді. Осының негізінде америкалық психолог көсемдіктің екі еркін типін бөлектеді: ü бетпе – бет басқару. Топ мүшелері бір – бірмен тығыз байланыста болғанда басқару. ü «алыстан басқару» көсемдердің бағыныштыларымен жеке байланыс орнатуға мүмкіндігі болмайтынында. Соңғы типте басшылар қол астындағылар үлгі ететіндей өз имиджін қалптастыруға тырысады. Осылайша көсем мен соңынан ерушілер</p>
<p>арасында коммуникациялық қатынас пайда болады. Олар басшының жетістіктерін өзінен емес, ол туралы айтылған əңгімелер мен жаңалықтар ретінде қабылдағанды дұрыс көреді. Басшы харизматикалық тұлға ретінде көрсетіліп, өзіне бағындыру қасиетіне ие болады. Сонымен қатар басшы – жетістікке жеткен адам. Болжам бойынша жетістікке жеткен адамға бағыну, əрі еліктеу адамдарға тəн қасиет. Басшының əсер етуіне оның командасы мен жақтастарының даңқы да əсер етеді. Билік адамның өзін ұстауынан да байқалады. Оның жүрі с – тұрысы,сөзі бағынушыларынан өзгеше көрінеді. Ол қоластындағыларға қарағанда байыппен ұзақ сөйлейді. Басқарушылық қызметтің синтетикалық табиғаты жеке-біріккен ретінде қызметтің айрықша, спецификалық түріне жататындығын ғана анықтамайды, сонымен бірге оның негізгі психологиялық ерекшеліктердің қатарының болуын белгілейді. А. В. Карпов оларға келесілерді жатқызады: 1. Басқарушылық қызмет тікелей емес, белгілі бір ұйымның қызмет етуінің соңғы нəтижелерімен байланысты салдарлы байланысымен сипатталады. Аталмыш белгі бойынша басқарушылық қызмет атқаруышыл қызметтен ерекшеленеді. 2. Басқарушылық қызмет өз заты бойынша өте айрықшаланған. Оның пəні ретінде адамдар, тұлғалар сияқты өте ерекше заттар болып табылады. Басқарушылық қызметтің ерекше болуы оның пəні (ықпал ету объектісі) субъектілер болып табылатындығында. Осыған байланысты басқарушылық қызметтің қызықты ерекшелігін атап өткен жөн. Ондағы еңбек объектісі мен субъектісі өз ұйымының күрделілігі бойынша бірдей ғана емес, сонымен қатар өздерінің негізгі, яғ ни психологиялық ерекшеліктері бойынша да ұқсас болып табылады. Е. В. Шорохова адамды анық сойлей алатын, ойлауға қабілетті, жоғарғы психикалық функцияларды игере алатын (абстрактты-логикалық пайымдау, логикалық еске сақтау жəне т.б ), еңбек құралдарын жасап жəне оны еңбек процессінде қолдана алатын жаратылыс иесі ретінде анықтады. Адамның бұл ерекшеліктері жəне қасиеттері (тіл, ойлау қабілеті,еңбектену жəне басқалары) адамдарға биологиялық жолмен берілмейді, бұл қасиеттер алдыңғы ұрпақпен жасалған мəдениетті ұғыну барысында қалыптасады. Ешбір адамның жеке тəжірибесі оның ойлау қабілетінің өздігінен қалыптасуына, түсінік жүйесінің құралуына əкелмеген. Ол үшін мыңдаған өмір қажет етіледі. Əрбір адам ұрпағы өмірін алдыңғы ұрпақ қалдырып кеткен құбылыстар мен заттардың қоршауында бастайды. Олар еңбекке жəне қоғамдық өмірге араласа келе қазіргі адамдарға тəн адамдық ерекшеліктерді дамытты. Тұлға əлеуметтік түсінік, ол адамдағы табиғаттан тыс, тарихи құбылыстарын білдіреді. Тұлға туылмайды, ол мəдени жəне əлеуметтік жетілу барысында туындайды. Ерекше жəне басқаларға ұқсамайтын тұлға</p>
<p>өзінің физикалық жəне жан дүниесі қасиеттерінің толықтырылуын «даралық» түсінігімен сипаттайды. Даралық тəжірибенің, білімнің, пікірдің, сендірудің, мінездің əртүрлілігімен қызуқанды лығымен көрсетіледі жəне біз даралығымызды дəлелдейміз. Тұлғаның анықтамасы көп. Олардың тұлғаның мəселелерінің əр қырынан көрсетуіне қарамастан келесілері мейілінше дұрыс болып ұсынылады: Б. Г. Ананьев : тұлға – еңбектің, танымның, қатынастың субъектісі. И. С. Кон: тұлға – бұл əлеуметтік рольдердің интеграциялық қырлары. А. Г. Ковалев: тұлға – бұл қоғамда өзіндік орыны бар жəне белгілі бір қоғамдық рөль атқарушы, пайымдаушы жеке адам. Басқару субъектісі бойынша шешімдерді былайша бөлуге болады: - Əкімшілік шешімі. - Қоғамдық ұйымда шешімі т.б. Басқару объектісі бойынша шешімдерді жалпы жəне жекелей, күрделі жəне қарапайым деп бөледі. Жалпы шешім, əдетте, бүкіл шаруашылықтың мүддесін қозғайды. Жекелей шешімнің жедел сипаты болады, бұл көбінесе басқарудың төменгі буынына тəн. Ықпал ету объектісі бойынша шешімді сыртқы жəне ішкі деп бөледі. Сыртқы шешім халық шаруашылығы өндірісінің ерекшелігін айқындайды, əрі сол шаруашылықтың жоғарғы ұйымдармен жəне органдармен, сондай-ақ ауыл шаруашылық өнімде рін өндейтін кəсіпорындармен қарым-қатынасын қарастырады. Ішкі шешім ауыл шаруашылығы кітапхананың өзіндегі қызмет саласына жатады. Уақыт өлшеміне қарай шешімді: перспективалық, күнделікті (ағымдағы), жəне жедел деп бөледі. Болашақ шешімнің орындалуына ұзақ уақыт (3-5 жыл жəне одан астам) керек. Мəселен, ірі мал шаруашылық кешендерін салу, кəсіпорынды дамытудың əлеуметтік-мəдени жоспарлары т.б. перспективалық шешімге жатады. Мұндай мəселелер күрделі қаржы бөлуді, еңбек, материалдық жəне басқадай ресурстарды қамтиды. Перспективалық шешім бағдарламалық сипат алатындықтан, перспективалық жоспарларда көрсетіледі. Жедел шешім, əдетте қысқа уақыт ішінде (бірнеше апта, күн, ай) жүзеге асырылады. Басқару шешімі ұйымдастырылуына қарай жекелей алқалы жəне ұжымдық болып бөлінеді. Жекелей шешім – бұл басшының ұжыммен, немесе жекелеген адамдармен келісімінсіз, əрі ешбір талқылаусыз жеке өзінің шығарған шешімі. Бұл көбінесе ұсақ-түйек мəселелерді қозғайтын жедел шешім немесе өндірісті дамытудың принципті проблемаларын қоз ғамайтын шешім. Төтенше жағдайда мұның өзі ерекше маңызды шешім болуы мүмкін. Жекелей шешімнің сипаты мен мазмұны басқарудың орталықтану деңгейіне қарай айқындалады.</p>
<p>Алқалы шешім – бұл мамандар тобымен жіне тиісті басшылармен (алқа, кеңес т.б.) бірлесіп, ақыылдасып отырып жасалатын шешім. Мұндай шешімге əдетте мұқият əзірленеді, əрі онда көптеген мəселелер қамтылады. Алқалы шешімде əр түрлі басшылардың жекелей жауапкершілігіне нұқсан келтіретін жайттар болмауы тиіс. Ұжымдық шешім барлық ұйым мүшелерінің жал пы жиналысында қарастырылып, сонда қабылданады. Қызметтік мақсатына орай шешімдерді жоспарлау -экономикалық, технологиялық қаржы жəне əкімшілік сипатта бөледі. А.И.Пригожин «Басқарудың əлеуметтік жағдайлары» кітабында басқару шешімдерін былайша жіктейді. Мұқият айқындалған типтік шешім, оның мазмұнына басшының дербес ерекшеліктері əсер етпейді немесе шамалы əсер етеді. Бұған кадр мəселелері (жұмысқа қабылдау жəне шығару), агрономиялық, инженерлік жəне зоотехникалық-малдəрегерлік жұмыстарды ұйымдастыру жəне т.б. жатады. Мұндай шешімдерді ойластырғанда алдыңғы тəжірибелер міндетті түрде ескеріледі. Ынталы шешім, яғни онша айқындалмаған шешім, мұнда басшының жекелей үлесі басым болуы мүмкін. Творчестволық шешім белгілі бір стратегиялық мақсатты жəне соған жетуді көздейді. Əдетте мұндай шешім ұжымның алдында тұрған күрделі мəселелрді қозғайды. Мұндай шешімнің мысалына кітапханадағы ғылыми- техникалық прогресті оның əлеуметтік жағдайын дамыту бағдарламалары жатуы мүмкін. Атап көрсететін жайт, мұндай мəселелер бойынша шешім əзірлеуге міндетті түрде сол шаруашылықтың жұмыскерлері, оның қоғамдық ұйымдары кеңінен қатыстырылуы тиіс. Шет ел авторлары ұйымдық шешімдерді бағдарланған жəне бағдарланбаған деп жіктейді. Бағдарланған шешім дегеніміз жоспарлардың немесе іс-əрекеттердің белгілі бір жүйемен жүзеге асу нəтижесі, былайша айтқанда, шешімнің математикалық теңдеуі. Əдетте балама мүмкіндіктердің саны шектеулі, сондықтан да таңдау ісі ұйым белгілеген бағыт шебінде болуы тиіс. Бағдарланбаған шешім біршама жаңа, ішкі құрылымы қалыптастпаған немесе белгісіз факторлар жағдайында қабылданады. Мұндай шешімдерге мыналар жатады: ұйым мақсаты қандай болу керек, басқару бөлімшесінің құрылымын қалай жақсарту керек. Басқару – бұл адамның саналы белгілі бір бағытты қызметі, оны ң көмегімен адам қоғам, тірі жəне өлі табиғат, техника секілді ішкі ортаның элементтерін бағындырып, реттей алады. Басқару психологиясы – басқарушылық қызметтің психологиялық заңдылықтарын зерттейтін психология бөлімі.</p>
<p>Басқару жүйесінің əрекеттері арқылы жүзеге асатын техника, процесс немесе адамдар ұжымы. Басқару құралдарына сигналдар, командалар немесе құжаттар, бұйрықтар, нұсқаулар жатады. Педагогикалық үрдісті басқару – қойылған мақсатқа сəйкес шешім қабылдау, ұйымдастыру, бақылау, басқару объектісін з ерттеу, алыған ақпараттарды талдау жəне қорытындылау ісəрекеті болып табылады. Басқару объектісі биолгиялық, техникалық, əлеуметтік жүйелер бола алады. Білім беру əлеуметтік жүйеге жатады жəне елдің, өлкенің, облыстың, қаланың жəне ауданның аумағында қызме т етеді. Сондықтан басқару субъектілері министрлік, облыстық, қалалық, аудандық білім беру басқармалары болып бөлінеді. Жалпы білім беретін мектептер күрделі динамикалық жүйе ретінде мектепішілік басқару объектісі болып табылады. Мектепішілік басқару – тиімді нəтижелерге қол жеткізу мақсатында тұтас педагогикалық үдерістің объективтік заңдылықтарын тануға негізделген оған қатысушылардың мақсатты, саналы өзара əсерлесуі. Тұтас педагогикалық үдеріс қатысушыларының оны басқарудағы өзара əсерлесуі өзара байланысты: педагогикалық талдау, мақсат қою жəне жоспарлау, ұйымдастыру, бақылау, реттеу мен түзету тəрізді əрекеттер мен функциялардан тұрады. Басқару объектісі ретінде келесілер алынуы мүмкін: биологиялық жүйе, табиғи орта, адамдық өркениет, əлемдік экономика, мемлекет, оның экономикасы, аймақ, сала, кəсіпорын адамдардың ұжымы, жанұя, жеке адам, техникалық жүйе немесе техникалық кұрал, көлік, əртүрлі құбылыстар, үрдістер, ресурстар жəне т.с.с. Осындай объекттердің барлығы өздеріне ғана тəн ерекшеліктерге ие болғанына қарамастан, оларды басқару жалпыға бірдей заңдарға, принциптерге, ережелерге жəне əдістерге бағынады. Басқару обьектісі Бұл басқарылатындард ың барлығы, яғни сала, кəсіпорын, бөлімшелер жəне т. б. Əр уақытта белгілі бір мақсатқа жету үшін өздерінің ісқызметтерін үйлес тіретін адамдар тобы. Жұмыс істеуі басқару жүйесінің əрекеттері арқылы жүзеге асатын техника, процесс немесе адамдар ұжымы. Басқарудың объектісі мен субъектісінің арасында тура жəне кері байланыс болады Тура байланыс – бұл басқару объектісіне субъектіден түсетін əмір (команда). Кері байланыс – бұл басқару субъектісіне объектіден əмірдің орындалғаны жəне оның жағдайы туралы түсетін ақпарат. Басқару объектісі мен субъектісінің жиынтығы тура жəне кері байланыстармен бірге басқару жүйесін құрайды. Басқару жүйесінде басқару объектісін басқарылылатын жүйелілік, ал субъектісін – басқаратын жүйелілік деп жиі айтылады. Басқару жүйесін бірқатар жалпы шарттары сипаттайды Басқару субъектісі объектіге берілген мақсатқа сəйкес ықпалын жүргізеді. Бұл үшін басқарылатын жүйе бөлігі басқару объектісіне көрсетілген ықпалынан кейін оның жағдайы қандай екенін анық білуі керек. Мақсатқа анық бет бұру үшін басқару субъектісіне объектіге ықпал көрсетілгенше жəне көрсетілгеннен кейінгі жағдайлары бойынша ақпарат</p>
<p>түсіп отыруы қажет, басқаша айтқанда басқару жүйесінде тура жəне кері байланыс айқын түрде ұйымдастырылуы керек. Жүйелі тəсіл – бұл басқару объектісін жүйе реітнде зерттеуге негізделген ғылыми танып білу жəне əлеуметтік тəжірибе əдістемелінің бағыты. Бұл тəсіл басқару объектісінің жағдлайына жəне серпіндігіне ықпалын тигізетін барлық негізгі факторларды ескере отырып жүргізетін кешенді зерттеуге негізделген. Сонымен, педагогикалық үрдістің тиімділігін көрсететін маңызды көрсеткіштер – педагогикалық жəне оқушылар ұжымдарындағы моральдық-психологиялық климат, ата -аналар мен оқушылардың педагогикалық деңгейлері болып есептеледі. Басқару психологиясы əлеуметтік психологияның қазіргі кездегі негізгі тарауларының бірі, ол əртүрлі əлеуметтік құрылымдардағы адамдардың бір-бірімен қарым- қатынас мəселесін зерттейді. Бекіту сұрақтары: 1. Кішігірім топты басқарудағы жауапкершілікті өз мойнына алатын, көп жағдайда топтың мақсат мүддесіне сəйкес жұмысты жүргізу барысын түсіндір 2. Топ мүшелеріне қиын сəтте көмек көрсетуде көрінетін көшбасшының компоненттерін сипаттаңыз 3. Басқарудың стратегиялық концепциясын түсіндіріңіз 4. Басқару психологиясында арнайы жұмысшы, əлеуметтік топ, ұжым қарастырыңыз.</p>`,rawText:`§ 4  Жеке тұлға басқарудың объектісі мен субъектісі  
 
Басқару субъектісінің басқару объектісіне ықпал жасау əдістері 
басқару əдістері деп түсіндіріледі. Басқару əдістері ұжымдар қызметінің 
жоғары тиімділігін, олардың ынтымақты жұмысын қамтамасыз етуге тиіс. 
Мұның өзі басқару əдістерін өндірістік-шаруашылық міндеттерді шешу 
процесінде қолданылатын басқа да  техникалық жəне технологиялық 
əдістерден ерекшеленеді. Басқару əдістері басқ ару процесін мүлтіксіз 
ұйымдастыру, осы замаңғы техниканы пайдалану, еңбек пен өндірісті 
прогресті жолмен ұйымдастыру үшін жағдайлар жасайды, олардың 
барынша тиімді болуын қамтамасыз етеді. Сонымен, əдістер -басқару 
қызметінің мəні жəне негізгі мазмұны болып табылады, өйткені басқару 
міндеттері солар арқылы іске асырылады. 
Басқару ілімінде бірнеше əдістер бар: 
1.Əкімшілік  əдістері 
2.Экономикалық 
3.Əлеуметтік-психологиялық.  
Басқару бұл элемент, функция, белгілі бір құрылымдарды сақтауды 
қамтамасыз ететін, ұйымдасқан жүйелердің режимін қолдау, олардың 
қызметін жүзеге асыруға, олардың бағдарламалары мен мақсаттарын 
түсіндіреді. 
Ұйымға біріккен адамдарды басқару туралы сөз болғанда, онда 
көптеген басқа да аспектілері сияқты басқарушылық қызметіне 
психологиялық аспектте кіреді, сондықтан да психологиялық ғылымда 
табысты дамып келе жатқан, жаңа пəн ретінде-басқару психологиясы пайда 
болды. Басқару жүйесінде жеке тұлға басқару субъектісі ретінде де, басқару 
объектісі ретінде де қабылдана алады жəне көбінесе бір уақытта субъект 
пен объектіні біріктіреді. Жеке тұлға басқару субъектісі ретінде белгілі бір 
басқару объектісіне бағытталған пəндік -практикалық əс-əрекеттің 
тасымалдаушысы, басқарушылық қызметтің көзі ретінде танылады. 
Жеке тұлға басқару объектісі ретінде басқарушылық əсердің мақсаты 
болып табылады, жоғары басқару субъектісінің басқарушылық шешімдерін 
іс жүзінде жүзеге асырады. Осыған сүйене о тырып, басқару 
психологиясында «бағынуды үйренбестен басқаруды үйрену мүмкін емес» 
деген алтын қағида бар. Бұл алдыңғы тақырыптарда анықтағанымыздай, 
əлеуметтік басқарудағы басқару субъектісі мен объектісі үнемі өзгеріп 
отырады жəне сонымен бірге субъект те, объект те бола алады. Бұл басқару 
субъектілері мен объектілері ретінде жеке тұлғаға да, ұйымғада толықтай 
қатысты. 
Басқару субъектісі ретіндегі жеке тұлға қасиеттерінің негізгі 
блоктарының бірі-ұйымдастырушының қасиеттері. 
Ю. Н. Емельяновтың пікірінше, жеке тұлғаның ұйымдастырушылық 
əлеуеті-бұл жеке тұлғаны ғана емес, сонымен бірге осы адамның 

ұйымдастырушылық қызметі жүзеге асырылатын əлеуметтік ортаның 
параметрлерін сипаттайтын жүйелік сапа. Бұл жүйелік сапа қоғам, ұжым, 
жеке тұлға жəне оның қызметінің объектісі арасындағы түйісте пайда 
болады. Сондай-ақ, жеке тұлғаның ұйымдастырушылық қасиеттері 
иерархиялы екенін атап өткен жөн. Бұл иерархияда  басшының 
ұйымдастырушылық қасиеттерінің эмоционалды -еріктік компоненті 
негізделген ұйымдастырушылық инстинкт басым болады. 
Ұйымдастырушылық қызметке бейімділік барлық басқа жүйелік 
қасиеттердің дамуын қамтамасыз ететін негіз болып табылады. 
Л. И. Уманский басқару субъектісі ретінде жеке тұлғаның 
ұйымдастырушылық қасиеттері жеке тұлғаның белгілі бір психологиялық 
қасиеттеріне негізделген деп санайды. 
Психологиялық талғампаздық-адамның жалпы топтық мəселені шешу 
барысында ұйымдасқан топтың психологиясын жеткілікті түрде толық 
көрсете білу қабілеті. 
Ақыл-ойдың практикалық психологиялық бағыты-практикалық 
психология саласындағы білім мен дағдылардың жиынтығы, оларды 
ұйымдастырушылық мəселелерді шешу практикасында қолдануға дайын 
болу. 
Психологиялық əдептілік-адамдармен қарым-қатынаста шекті 
шаманың болуы. 
Жеке тұлғаның мұндай қасиеттерін Л.И.Уманский жиынтығында 
«ұйымдастыру сезгіштігі» деп қарастырады. 
Əлеуметтік жігерлілік - адамның ұйымдастырылатын адамдарды өз 
жігерімен қуаттандыру қабілеті.   
Талапшылдық-жағдайдың ерекшеліктеріне қарай ақылға қонымды 
талаптар қоя алу қабілеті. 
Сыншылдық - қойылған тапсырмалар мəжбүрлейтін жағдайлардан 
осы іс-əрекеттің маңызды ауытқуларын анықтау жəне білдіру мүмкіндігі. 
Осы үш қасиетті Л.И.Уманский сондай-ақ эмоционалды-ерікті 
əрекетсіздік деп аталатын бүтін құбылысқа біріктіреді. 
Ұйымдастырушылық қызметке бейімділік-осы қызметке деген 
əлеуметтік жағына қарай бағдарланған жəне оң эмоционалды бояуы бар 
ішкі қажеттілік. 
Басқару объектісі ретінде əрекет ете отырып, адам басқарушылық 
əсерге бағына алуы, сезіне алуы жəне бейім болуы керек. Бағынудың 
əртүрлі түрлері бар: бастамашыл, немқұрайлы жəне қыңыр. 
Егер адам басқару объектісі ретінде бір мезгілде субъект болмаса, 
онда ол қыңыр  жəне немқұрайлы бағынуға құқылы. Егер адам бір уақытта 
басқару субъектісі болса, онда ол бастамашыл бағынудың 
тасымалдаушысы болуы керек. 

Немқұрайлы бағыну жұмыскердің өз жағдайына қанағаттанатынын, 
жауапты шешімдер қабылдаудан қашатынын, «Менің шаруам шамалы, не 
болса ол болсын» қағидаты бойынша əрекет ететінін көрсетеді. 
Қыңыр бағыну-мəжбүрлі жəне сырттай таңылған əрекет деп 
қабылданады, жұмыскер өкім алған кезде, əдетте «Неге мен?» деген сұрақ 
қояды. Ол бағыну қажеттілігін, оның функционалдық міндеттерін, 
басқарушылық өзара іс-қимыл жүйесіндегі орнын нашар түсінумен 
сипатталады. 
Бастамашыл бағыну-бағыну қажеттілігін түсінумен сипатталады. 
Борыш сезімі əдетке айналады, бірақ бастамашылдық сезімін баспайды. 
Бағыну жоғары басшының беделін құрметтеу мен оның бұйрығын сыни 
бағалаудың үйлесуіне негізделген. 
Басшының субъект жəне басқару объектісі ретіндегі қызметі өте 
қайшылықты: 
- басшы қатаң құрылымдалған жағдайларда жұмыс істейді 
(жоспарлардың болуы: стратегиялық, тактикалық, жедел); 
- басшының алдында тұрған міндеттерді (тəуекелді жəне қалыптасқан, 
пысықталған, стереотиптік іс-əрекеттер арасында) шешу тəсілдері 
мен əдістерін таңдау дилеммасы үнемі тұрады; 
- үнемі өзгеріп отыратын ішкі жəне сыртқы айнымалылар, олар жаңа 
қызмет жағдайларына сəйкес келмеуі мүмкін көшбасшының 
құзыреттілігіне күмəн келтіруі мүмкін; 
- жоғары тұрған басшылық тарапынан үнемі өзгеріп отыратын 
ұйымдастырушылық жағдайлар жағдайында басшының қабілеті мен 
жеке өсуіне барабар бағалаудың болмауы; 
- ұйымдастырушылық қақтығыстарды басқаруда тиімсіз мінез-құлық 
стратегияларын таңдау; 
- орындаушылардың пікірін ескермей басқарушылық шешімдер 
қабылдау; 
- қызметкерлердің бастамашылық пен шығармашылық танытуға деген 
ұмтылысына зиян келтіретін басқару құжаттарының, 
нұсқаулықтардың талаптарын қатаң сақтау қажеттілігі: 
- қызметте жетістікке жетуге бағытталған көшбасшының жеке 
мотивациясының сəйкес келмеуі жəне қызметкерлердің жүріс -
тұрысына оң уəждеменің болмауы. 
Қазіргі басқару жүйесі мен заманауи басшының ерекшеліктеріне 
мыналар жатады: 
- басшы əйелдер санының өсуі;  
- интеллект рөлінің өсуі жəне техникалық құзыреттілік деңгейін 
кеңейту қажеттілігі; 
- білім деңгейін арттыру, екі жəне одан да көп жоғары білімнің болуы; 
- ұйымдастырушылық құрылымның барлық деңгейлерінде шешім 
қабылдауға қатысатын адамдар тобын кеңейту; 

- басшылардың əлеуметтік жауапкершілігі рөлінің артуы; 
- кəсіби ұтқырлық. 
Əлеуметтік басқарудың басқа түрлерден айырмашылығы оның басты 
компонентті болып əртүрлі ұйымдардың мүшесі ретінде адамдар, немесе 
ұйымдастыру бөлімшелері тұтастай қатысады. Жеке тұлғалар (жеке өзі, 
немесе əлеуметтік топтардың құрамында) ұсынылып отырған күрделі 
жүйеде басқарушылық қарым қатынаста болуы керек, оған басқару 
субъектісі мен объектісі қатыса алады. Автордың жазуы бойынша 
əлеуметтік басқарудың негізгі категориялары «ұйым», «басқару субъекттісі 
мен объектісі» болып табылады. 
Басқару субъектісі заттық-практикалық қызметтің тасымалдаушысы, 
белсенді басқарудың көзі, белгілі бір басқару объектісіне бағытталған 
болады. Басқару субъектісі жеке тұлға ретінде, неме се əлеуметтік топ 
ретінде қатыса алады. 
Басқару объектісінің бір бөлігі объективті шындық болуы мүмкін, яғни 
оған басқарушының əсері бағытталған. Басқару объектісінде сондай -ақ 
жеке тұлға немесе əлеуметтік топта бола алады. 
Əсер ету адамдар қатынасының басты құрамдас бөлігі ғана болып 
қоймай, көсемдіктің психологиялық негізі болып табылады. Басшы болу 
үшін  əлуетті күш қана емес, адамдарға əсер ете алу қасиетіне ие болу керек. 
Өз ойыңды біреулерге жүктемес бұрын билікке ие болу керек. Билік 
көптеген қорларға сүйенуі қажет: мүмкіншілік, əрекеттер,т.б. Олар 
материалды, идеалды болуы мүмкін. 
Қорлардың 3 тобы бар: 
• белгілі бір адамның билігінен емес, оның қоғамдағы ресми 
атқаратын рөліне байланысты əсер ету амалы. 
• адамның жеке тұлғалық қасиеттеріне əсер ету амалы. 
• басшының сендіру үшін айтылған белгілі бір сөздері арқылы 
əсер ету амалы. 
Барлық қорлар бір – бірімен тығыз байланысты, олар бір – бірін өзара 
толықтырып отырады.  
Жазалау мен мараппаттау арқылы билеу ол қарапайым басшылық 
үлгісі болып саналады. Бұл əсер етудің кемшіліктері бар: бағынушы тек 
тыңдауңа тиіс болған соң ғана бас иеді, егер оған жақсы жағдай жасайтын 
басқа басшы ұсыныс жасаса ол бірден келісімін беруі мүмкін. 
Əсер ету əр топқа əр түрлі əсер етеді. Осының негізінде америкалық 
психолог көсемдіктің екі еркін типін бөлектеді: 
ü бетпе – бет басқару. Топ мүшелері бір – бірмен тығыз байланыста 
болғанда басқару. 
ü «алыстан басқару» көсемдердің бағыныштыларымен жеке 
байланыс орнатуға мүмкіндігі болмайтынында. 
Соңғы типте басшылар қол астындағылар үлгі ететіндей өз имиджін 
қалптастыруға тырысады. Осылайша көсем мен соңынан ерушілер 

арасында коммуникациялық қатынас пайда болады. Олар басшының 
жетістіктерін өзінен емес, ол туралы айтылған əңгімелер мен  жаңалықтар 
ретінде қабылдағанды дұрыс көреді. 
Басшы харизматикалық тұлға ретінде көрсетіліп, өзіне бағындыру 
қасиетіне ие болады. Сонымен қатар басшы – жетістікке жеткен адам. 
Болжам бойынша жетістікке жеткен адамға бағыну, əрі еліктеу адамдарға 
тəн қасиет. Басшының əсер етуіне оның командасы мен жақтастарының 
даңқы да əсер етеді.  
Билік адамның өзін ұстауынан да байқалады. Оның жүрі с – 
тұрысы,сөзі бағынушыларынан өзгеше көрінеді. Ол қоластындағыларға 
қарағанда байыппен ұзақ сөйлейді. Басқарушылық қызметтің синтетикалық 
табиғаты жеке-біріккен ретінде қызметтің айрықша, спецификалық түріне 
жататындығын ғана анықтамайды, сонымен бірге оның негізгі 
психологиялық ерекшеліктердің қатарының болуын белгілейді. А. В. 
Карпов оларға келесілерді жатқызады: 
1. Басқарушылық қызмет тікелей емес, белгілі бір ұйымның қызмет 
етуінің соңғы нəтижелерімен байланысты салдарлы байланысымен 
сипатталады. Аталмыш белгі бойынша басқарушылық қызмет атқаруышыл 
қызметтен ерекшеленеді. 
2. Басқарушылық қызмет өз заты бойынша өте айрықшаланған. Оның 
пəні ретінде адамдар, тұлғалар сияқты өте ерекше заттар болып табылады. 
Басқарушылық қызметтің ерекше болуы оның пəні (ықпал ету объектісі) 
субъектілер болып табылатындығында. Осыған байланысты басқарушылық 
қызметтің қызықты ерекшелігін атап өткен жөн. Ондағы еңбек объектісі 
мен субъектісі өз ұйымының күрделілігі бойынша бірдей ғана емес, 
сонымен қатар өздерінің негізгі, яғ ни психологиялық ерекшеліктері 
бойынша да ұқсас болып табылады. 
Е. В. Шорохова адамды анық сойлей алатын, ойлауға қабілетті, 
жоғарғы психикалық функцияларды игере алатын (абстрактты-логикалық 
пайымдау, логикалық еске сақтау жəне т.б ), еңбек құралдарын жасап жəне 
оны еңбек процессінде қолдана алатын жаратылыс иесі ретінде анықтады. 
Адамның бұл ерекшеліктері жəне қасиеттері (тіл, ойлау қабілеті,еңбектену 
жəне басқалары) адамдарға биологиялық жолмен берілмейді, бұл қасиеттер 
алдыңғы ұрпақпен жасалған мəдениетті ұғыну барысында қалыптасады.  
Ешбір адамның жеке тəжірибесі оның ойлау қабілетінің өздігінен 
қалыптасуына, түсінік жүйесінің құралуына əкелмеген. Ол үшін мыңдаған 
өмір қажет етіледі. Əрбір адам ұрпағы өмірін алдыңғы ұрпақ қалдырып 
кеткен құбылыстар мен заттардың қоршауында бастайды. Олар еңбекке 
жəне қоғамдық өмірге араласа келе қазіргі адамдарға тəн адамдық 
ерекшеліктерді дамытты.  
Тұлға əлеуметтік түсінік, ол адамдағы табиғаттан тыс, тарихи 
құбылыстарын білдіреді. Тұлға туылмайды, ол мəдени жəне əлеуметтік 
жетілу барысында туындайды. Ерекше жəне басқаларға ұқсамайтын тұлға 

өзінің  физикалық жəне жан дүниесі қасиеттерінің толықтырылуын 
«даралық» түсінігімен сипаттайды. Даралық тəжірибенің, білімнің, 
пікірдің, сендірудің, мінездің əртүрлілігімен қызуқанды лығымен 
көрсетіледі жəне біз даралығымызды дəлелдейміз. Тұлғаның анықтамасы 
көп. Олардың тұлғаның мəселелерінің əр қырынан көрсетуіне қарамастан 
келесілері мейілінше дұрыс болып ұсынылады: 
 Б. Г. Ананьев : тұлға – еңбектің, танымның, қатынастың субъектісі. 
 И. С. Кон: тұлға – бұл əлеуметтік рольдердің интеграциялық қырлары. 
 А. Г. Ковалев: тұлға – бұл қоғамда өзіндік орыны бар жəне белгілі бір 
қоғамдық рөль атқарушы, пайымдаушы  жеке адам.  
Басқару субъектісі бойынша шешімдерді былайша бөлуге болады: 
- Əкімшілік шешімі. 
- Қоғамдық ұйымда шешімі т.б. 
Басқару объектісі бойынша шешімдерді жалпы жəне жекелей, күрделі 
жəне қарапайым деп бөледі. Жалпы шешім, əдетте, бүкіл шаруашылықтың 
мүддесін қозғайды. Жекелей шешімнің жедел сипаты болады, бұл көбінесе 
басқарудың төменгі буынына тəн. 
Ықпал ету объектісі бойынша шешімді сыртқы жəне ішкі деп бөледі. 
Сыртқы шешім халық шаруашылығы өндірісінің ерекшелігін 
айқындайды, əрі сол шаруашылықтың  жоғарғы ұйымдармен жəне 
органдармен, сондай-ақ ауыл шаруашылық өнімде рін өндейтін 
кəсіпорындармен қарым-қатынасын қарастырады. 
Ішкі шешім ауыл шаруашылығы кітапхананың өзіндегі қызмет 
саласына жатады. 
Уақыт өлшеміне қарай шешімді: перспективалық, күнделікті 
(ағымдағы), жəне жедел деп бөледі. 
Болашақ шешімнің орындалуына ұзақ уақыт (3-5 жыл жəне  одан 
астам) керек. Мəселен, ірі мал шаруашылық кешендерін салу, кəсіпорынды 
дамытудың əлеуметтік-мəдени жоспарлары т.б. перспективалық шешімге 
жатады. Мұндай мəселелер күрделі қаржы бөлуді, еңбек, материалдық жəне 
басқадай ресурстарды қамтиды. Перспективалық шешім бағдарламалық 
сипат алатындықтан, перспективалық жоспарларда көрсетіледі. 
Жедел шешім, əдетте қысқа уақыт ішінде (бірнеше апта, күн, ай) 
жүзеге асырылады. 
Басқару шешімі ұйымдастырылуына қарай жекелей алқалы жəне 
ұжымдық болып бөлінеді. 
Жекелей шешім – бұл басшының ұжыммен, немесе жекелеген 
адамдармен келісімінсіз, əрі ешбір талқылаусыз жеке өзінің шығарған 
шешімі. Бұл көбінесе ұсақ-түйек мəселелерді қозғайтын жедел шешім 
немесе өндірісті дамытудың принципті проблемаларын қоз ғамайтын 
шешім. Төтенше жағдайда мұның өзі ерекше маңызды шешім болуы 
мүмкін. Жекелей шешімнің сипаты мен мазмұны басқарудың орталықтану 
деңгейіне қарай айқындалады. 

Алқалы шешім – бұл мамандар тобымен жіне тиісті басшылармен 
(алқа, кеңес т.б.) бірлесіп, ақыылдасып отырып жасалатын шешім. Мұндай 
шешімге əдетте мұқият əзірленеді, əрі онда көптеген мəселелер қамтылады. 
Алқалы шешімде əр түрлі басшылардың жекелей жауапкершілігіне нұқсан 
келтіретін жайттар болмауы тиіс. 
Ұжымдық шешім барлық ұйым мүшелерінің жал пы жиналысында 
қарастырылып, сонда қабылданады. 
Қызметтік мақсатына орай шешімдерді жоспарлау -экономикалық, 
технологиялық қаржы жəне əкімшілік сипатта бөледі. 
А.И.Пригожин «Басқарудың əлеуметтік жағдайлары» кітабында 
басқару шешімдерін былайша жіктейді. 
Мұқият айқындалған типтік шешім, оның мазмұнына басшының 
дербес ерекшеліктері əсер етпейді немесе шамалы əсер етеді. Бұған кадр 
мəселелері (жұмысқа қабылдау жəне шығару), агрономиялық, инженерлік 
жəне зоотехникалық-малдəрегерлік жұмыстарды ұйымдастыру жəне т.б. 
жатады. Мұндай шешімдерді ойластырғанда алдыңғы тəжірибелер міндетті 
түрде ескеріледі. 
Ынталы шешім, яғни онша айқындалмаған шешім, мұнда басшының 
жекелей үлесі басым болуы мүмкін. 
Творчестволық шешім белгілі бір стратегиялық мақсатты жəне соған 
жетуді көздейді. Əдетте мұндай шешім ұжымның алдында тұрған күрделі 
мəселелрді қозғайды. Мұндай шешімнің мысалына кітапханадағы ғылыми-
техникалық прогресті оның əлеуметтік жағдайын дамыту бағдарламалары 
жатуы мүмкін. Атап көрсететін жайт, мұндай мəселелер бойынша шешім 
əзірлеуге міндетті түрде сол шаруашылықтың жұмыскерлері, оның 
қоғамдық ұйымдары кеңінен қатыстырылуы тиіс. 
Шет ел авторлары ұйымдық шешімдерді бағдарланған жəне 
бағдарланбаған деп жіктейді. 
Бағдарланған шешім дегеніміз жоспарлардың немесе іс-əрекеттердің 
белгілі бір жүйемен жүзеге асу нəтижесі, былайша айтқанда, шешімнің 
математикалық теңдеуі. Əдетте балама мүмкіндіктердің саны шектеулі, 
сондықтан да таңдау ісі ұйым белгілеген бағыт шебінде болуы тиіс. 
Бағдарланбаған шешім біршама жаңа, ішкі құрылымы қалыптастпаған 
немесе белгісіз факторлар жағдайында қабылданады. Мұндай шешімдерге 
мыналар жатады: ұйым мақсаты қандай болу керек, басқару бөлімшесінің 
құрылымын қалай жақсарту керек. 
Басқару – бұл адамның саналы белгілі бір бағытты қызметі, оны ң 
көмегімен адам қоғам, тірі жəне өлі табиғат, техника секілді ішкі ортаның 
элементтерін бағындырып, реттей алады. 
Басқару психологиясы – басқарушылық қызметтің психологиялық 
заңдылықтарын зерттейтін психология бөлімі. 

Басқару жүйесінің əрекеттері арқылы жүзеге асатын техника, процесс 
немесе адамдар ұжымы. Басқару құралдарына сигналдар, командалар 
немесе құжаттар, бұйрықтар, нұсқаулар жатады.  
Педагогикалық үрдісті басқару – қойылған мақсатқа сəйкес шешім 
қабылдау, ұйымдастыру, бақылау, басқару объектісін з ерттеу, алыған 
ақпараттарды талдау жəне қорытындылау ісəрекеті болып табылады. 
Басқару объектісі биолгиялық, техникалық, əлеуметтік жүйелер бола алады. 
Білім беру əлеуметтік жүйеге жатады жəне елдің, өлкенің, облыстың, 
қаланың жəне ауданның аумағында қызме т етеді. Сондықтан басқару 
субъектілері министрлік, облыстық, қалалық, аудандық білім беру 
басқармалары болып бөлінеді. 
Жалпы білім беретін мектептер күрделі динамикалық жүйе ретінде 
мектепішілік басқару объектісі болып табылады. Мектепішілік басқару – 
тиімді нəтижелерге қол жеткізу мақсатында тұтас педагогикалық үдерістің 
объективтік заңдылықтарын тануға негізделген оған қатысушылардың 
мақсатты, саналы өзара əсерлесуі. Тұтас педагогикалық үдеріс 
қатысушыларының оны басқарудағы өзара əсерлесуі өзара байланысты: 
педагогикалық талдау, мақсат қою жəне жоспарлау, ұйымдастыру, бақылау, 
реттеу мен түзету тəрізді əрекеттер мен функциялардан тұрады. 
Басқару объектісі ретінде келесілер алынуы мүмкін: биологиялық 
жүйе, табиғи орта, адамдық өркениет, əлемдік экономика, мемлекет, оның 
экономикасы, аймақ, сала, кəсіпорын адамдардың ұжымы, жанұя, жеке 
адам, техникалық жүйе немесе техникалық кұрал, көлік, əртүрлі 
құбылыстар, үрдістер, ресурстар жəне т.с.с. Осындай объекттердің барлығы 
өздеріне ғана тəн ерекшеліктерге ие болғанына қарамастан, оларды басқару 
жалпыға бірдей заңдарға, принциптерге, ережелерге жəне əдістерге 
бағынады. Басқару обьектісі Бұл басқарылатындард ың барлығы, яғни сала, 
кəсіпорын, бөлімшелер жəне т. б. Əр уақытта белгілі бір мақсатқа жету үшін 
өздерінің ісқызметтерін үйлес тіретін адамдар тобы. Жұмыс істеуі басқару 
жүйесінің əрекеттері арқылы жүзеге асатын техника, процесс немесе 
адамдар ұжымы. Басқарудың объектісі мен субъектісінің арасында тура 
жəне кері байланыс болады Тура байланыс – бұл басқару объектісіне 
субъектіден түсетін əмір (команда). Кері байланыс – бұл басқару 
субъектісіне объектіден əмірдің орындалғаны жəне оның жағдайы туралы 
түсетін ақпарат. Басқару объектісі мен субъектісінің жиынтығы тура жəне 
кері байланыстармен бірге басқару жүйесін құрайды. Басқару жүйесінде 
басқару объектісін басқарылылатын жүйелілік, ал субъектісін – басқаратын 
жүйелілік деп жиі айтылады. Басқару жүйесін бірқатар жалпы шарттары 
сипаттайды Басқару субъектісі объектіге берілген мақсатқа сəйкес ықпалын 
жүргізеді. Бұл үшін басқарылатын жүйе бөлігі басқару объектісіне 
көрсетілген ықпалынан кейін оның жағдайы қандай екенін анық білуі керек. 
Мақсатқа анық бет бұру үшін басқару субъектісіне объектіге ықпал 
көрсетілгенше жəне көрсетілгеннен кейінгі жағдайлары бойынша ақпарат 

түсіп отыруы қажет, басқаша айтқанда басқару жүйесінде тура жəне кері 
байланыс айқын түрде ұйымдастырылуы керек. Жүйелі тəсіл – бұл басқару 
объектісін жүйе реітнде зерттеуге негізделген ғылыми танып білу жəне 
əлеуметтік тəжірибе əдістемелінің бағыты. Бұл тəсіл басқару объектісінің 
жағдлайына жəне серпіндігіне ықпалын тигізетін барлық негізгі 
факторларды ескере отырып жүргізетін кешенді зерттеуге негізделген. 
Сонымен, педагогикалық үрдістің тиімділігін көрсететін маңызды 
көрсеткіштер – педагогикалық жəне оқушылар ұжымдарындағы 
моральдық-психологиялық климат, ата -аналар мен оқушылардың 
педагогикалық деңгейлері болып есептеледі. Басқару психологиясы 
əлеуметтік психологияның қазіргі кездегі негізгі тарауларының бірі, ол 
əртүрлі əлеуметтік құрылымдардағы адамдардың бір-бірімен қарым-
қатынас мəселесін зерттейді. 
Бекіту сұрақтары: 
1. Кішігірім топты басқарудағы  жауапкершілікті өз мойнына алатын, 
көп жағдайда топтың мақсат мүддесіне сəйкес жұмысты  жүргізу барысын 
түсіндір       
2. Топ мүшелеріне қиын сəтте  көмек көрсетуде  көрінетін 
көшбасшының компоненттерін сипаттаңыз   
3. Басқарудың стратегиялық  концепциясын түсіндіріңіз    
4. Басқару психологиясында арнайы жұмысшы, əлеуметтік топ, ұжым 
қарастырыңыз. 
 

`},{id:"lecture-5",category:"lecture",shortTitle:"5-дәріс",title:"§ 5 Еңбек мотивациясы",pdfFile:"./assets/docs/5sabak.pdf",numPages:3,textHtml:`<h3 class="chapter-subheading">§ 5 Еңбек мотивациясы Еңбек мотивациясы – бұл жұмыскерлердің еңбектік іс əрекет арқылы қажеттіліктерді қанағаттандыруға деген ұмтылысы. Еңбек мотивациясы теориясының негізін қалаушы А. Маслоу, Д. МакКлеплавд жəне Ф. Герцбергтер болып табылады. Еңбек мотивінің құрамына мыналар кіреді: • қызметкерді қанағаттандыратын- қажеттілік; • осы қажеттілікті қанағаттандыруға мүмкіндігі бар- игілік; • игілікті алуға қажет – еңбектік іс əрекет; • еңбектік іс əрекетті орындауға байланысты жұмсалған материалдық жəне моральдық тұрғыдағы шығындар – баға. Еңбек мотивацияларының негізгі теориялары - бұл: Күту теориясы 3 өзара байланысқа негізделеді: -еңбек шығыны – нəтижелері: жұмсалған күш пен алынған нəтижелердің қатынасы. Егер жұмысшы еңбек шығыны мен алыған нəтижелері арасында тікелей байланыстың жоқтығын сезінсе мотивация əлсірейді; -еңбек нəтижелері – сыйақы тағайындау: қол жеткізілген нəтиже арқылы тағайындалған мадақтау немесе сыйақыны күту. Егер алынған нəтиженің көлемі мен сыйақының арасында өзара байланыс болмаса онда əрекет мотивациясының салдары болмайды; -сыйақы – сыйақыға қанағаттану; сыйақының көлемі мен құндылығына салыстырмалы түрде қанағаттану немесе қанағаттанбау дəрежесі. Əділдік теориясы алынған сыйақы мен жұмсалған күшті жəне ұқсас жұмыстарды атқарушы басқа да жұмысшылардың сыйақы көлеміменсубъективті салыстыруға негізделеді. Əділдік теориясының негізгі қорытындысы: Жұмыс нəтижесі сыйақы деңгейіне сəйкес теңбе-тең бағалануы тиіс, болмаса мотивацияның ынталандыру ролі төмендейді. Портер-Лоулер моделі əділдік теориясы мен күту теориясының элементтерін өз ішіне алады. Моделдің негізгі тезисі: адам өз қажеттілігін өзінің еңбек үлесі үшін тағайындалған лайықты сыйақы арқылы қанағаттандырады. Еңбек мотивациясын мотив құрайды. Егер: адамның əлеуметтік қажеттіліктеріне сəйкес қоғамда қажетті игіліктер жиынтығы бар болса; осы игіліктерді алуға қызметкерлердің жеке еңбектік талпынысы болса; еңбектік іс əрекет қызметкерге бұл игіліктерді алу үшін аз материалдық жəне моральдық шығындарды жұмсауға мүмкіндік берген жағдайда еңбек мотивтері құрылады.</h3>
<p>Еңбек мотивтері: -еңбек мазмұндылығы; -оның қоғамдық пайдалылығы; -еңбектік іс əрекетінің жемістілігін қоғамның мойындауына байланысты -болатын мəртебелі мотивтер; -материалдық игіліктерді алу мотивтері; -жұмыстың белгілі бір қарқындылығына бағытталған мотивтер. Еңбек мотиві мен еңбек ынтасы өзара ұқсас. Еңбек мотиві - Еңбектік іс əрекет арқылы игілік алуға ұмтылған қызметкер жайлы əңгіме болады; Еңбек ынтасы - Еңбектік іс əрекет тиімділігі жағдайында ғана қызметкерге қажетті игілікті бере алатын басқару мекемесі жайлы сөз болады. Еңбек тəртібі мынадай мотивтерді сипаттайды: • қамтамасыз ету мотивтері – жұмысшының жəне оның отбасының жағдайының жақсы , жайлы болуы үшін қажетті материалдық жабдықтар жиынтығымен байланысты; материалдық қызығушылыққа негізделген, жалақыны бағытқа алған; • бейімділік мотиві – жұмысшының еңбек əрекеті процесіндегі ықтималды мүмкіндіктерін жүзеге асыруға ұмтылуы; • абырой мотиві – жұмысшылардың əлеуметтік мақсатын жүзеге асыруға, қоғамдық маңызды əрекеттерге қатысуға ұмтылуы. Кəсіпорын деңгейіндегі мотивация жүйесі төмендегілерге кепіл болуы тиіс: • барлық еңбекшілердің жүұмыспен қамтылуы; • кəсіптік жəне қызметтік көтерілуге тең мүмкіндік туғызу; • еңбекақы деңгейінің еңбек нəтижелерімен сəйкестігі; • еңбек қауіпсіздігі шарттарының құрылуы; • ұжымда жайлы психологиялық климаттың сақталуы. Мотивация əдістері жіктеледі: • экономикалық (тура) – уақытша жəне келісімді еңбекақы; еңбектің сапалы жəне сандық көрсеткіштері үшін сыйақы; кəсіпорын кірістеріне қатысы; оқу үшін төлемақы: • экономикалық (тура емес) – кəсіпорында тамақтануға, траспорттық қызметке, тұрғын үй төлемдеріне жеңілдіктер беру; • материалдық емес – еңбек тартымдылығынкөтеру, қызмет бабымен ілгерілеу, ең жоғары деңгейде шешім қабылдауға қатысу, біліктілікті арттыру, жұмысқа шығудың еркін графигі. Кəсіпорын жұмысшыларының мотивацияларының негізгі формалары: o еңбекақы – кəсіпорын əрекетінің нəтижесіндегі жұмысшының салымының объективті бағасы; o жұмысшыларға арналған ішкі фирмалық жеңілдіктерінің жүйесі – тиімді сыйақы беру; стажға төлем, кəсіорын есебінен жұмысшылардың денсаулығын сақтау, пайызсыз несие беру,</p>
<p>o ісшара, жұмысшының жауапкершілігі, тəелсіздігі, еңбегінің тартымдылығы мен маңыздылығы; o жұмысшылар арасындағы əкімшілік жəне психологиялық „кедергілерді” жою, ұжымда сенім мен өзара түсінушіліктің дамуы; o жұмысшыларды моральдік мадақтау; o жұмысшылардың біліктілігін арттыру мен жұмыс барысында ілгерілеуі. Бекіту сұрақтары: 1. Еңбек мотивациясының құрамын талдаңыз. 2. Күту теориясы өзара негізделетін байланыстарды атаңыз. 3. Портер-Лоулер моделінің тезисінің мəніне тоқталаңыз. 4. Мотивация əдістерінің жіктелуін талдаңыз.</p>`,rawText:`§ 5 Еңбек мотивациясы 
 
Еңбек мотивациясы – бұл жұмыскерлердің еңбектік іс əрекет арқылы 
қажеттіліктерді қанағаттандыруға деген ұмтылысы. Еңбек мотивациясы 
теориясының негізін қалаушы А. Маслоу, Д. МакКлеплавд жəне Ф. 
Герцбергтер болып табылады. Еңбек мотивінің құрамына мыналар кіреді: 
• қызметкерді қанағаттандыратын- қажеттілік; 
• осы қажеттілікті қанағаттандыруға мүмкіндігі бар- игілік; 
• игілікті алуға қажет – еңбектік іс əрекет; 
• еңбектік іс əрекетті орындауға байланысты жұмсалған материалдық 
жəне моральдық тұрғыдағы шығындар – баға. 
Еңбек мотивацияларының негізгі теориялары - бұл: 
Күту теориясы 3 өзара байланысқа негізделеді: 
-еңбек шығыны – нəтижелері: жұмсалған күш пен алынған 
нəтижелердің қатынасы. Егер жұмысшы еңбек шығыны мен алыған 
нəтижелері арасында тікелей байланыстың жоқтығын сезінсе мотивация 
əлсірейді; 
-еңбек нəтижелері – сыйақы тағайындау: қол жеткізілген нəтиже 
арқылы тағайындалған мадақтау немесе сыйақыны күту. Егер алынған 
нəтиженің көлемі мен сыйақының арасында өзара байланыс болмаса онда 
əрекет мотивациясының салдары болмайды; 
-сыйақы – сыйақыға қанағаттану; сыйақының көлемі мен 
құндылығына салыстырмалы түрде қанағаттану немесе қанағаттанбау 
дəрежесі. 
Əділдік теориясы алынған сыйақы мен жұмсалған күшті жəне ұқсас 
жұмыстарды атқарушы басқа да жұмысшылардың сыйақы 
көлеміменсубъективті салыстыруға негізделеді. 
Əділдік теориясының негізгі қорытындысы: 
Жұмыс нəтижесі сыйақы деңгейіне сəйкес теңбе-тең бағалануы тиіс, 
болмаса мотивацияның ынталандыру ролі төмендейді. 
Портер-Лоулер моделі əділдік теориясы мен күту теориясының 
элементтерін өз ішіне алады. 
Моделдің негізгі тезисі: адам өз қажеттілігін өзінің еңбек үлесі үшін 
тағайындалған лайықты сыйақы арқылы қанағаттандырады. 
Еңбек мотивациясын мотив құрайды. Егер:  адамның əлеуметтік 
қажеттіліктеріне сəйкес қоғамда қажетті игіліктер жиынтығы бар болса; 
осы игіліктерді алуға қызметкерлердің жеке еңбектік талпынысы болса;  
еңбектік іс əрекет қызметкерге бұл игіліктерді алу үшін аз материалдық 
жəне моральдық шығындарды жұмсауға мүмкіндік берген жағдайда еңбек 
мотивтері құрылады. 

Еңбек мотивтері: 
-еңбек мазмұндылығы;  
-оның қоғамдық пайдалылығы; 
-еңбектік іс əрекетінің жемістілігін қоғамның мойындауына байланысты 
-болатын мəртебелі мотивтер; 
-материалдық игіліктерді алу мотивтері; 
-жұмыстың белгілі бір қарқындылығына бағытталған мотивтер. 
Еңбек мотиві мен еңбек ынтасы өзара ұқсас. Еңбек мотиві - Еңбектік іс 
əрекет арқылы игілік алуға ұмтылған қызметкер жайлы əңгіме болады;  
Еңбек ынтасы - Еңбектік іс əрекет тиімділігі жағдайында ғана қызметкерге 
қажетті игілікті бере алатын басқару мекемесі жайлы сөз болады. 
Еңбек тəртібі мынадай мотивтерді сипаттайды: 
• қамтамасыз ету мотивтері – жұмысшының жəне оның отбасының 
жағдайының жақсы , жайлы болуы үшін қажетті материалдық жабдықтар 
жиынтығымен байланысты; материалдық қызығушылыққа негізделген, 
жалақыны бағытқа алған; 
• бейімділік мотиві – жұмысшының еңбек əрекеті процесіндегі 
ықтималды мүмкіндіктерін жүзеге асыруға ұмтылуы; 
• абырой мотиві – жұмысшылардың əлеуметтік мақсатын жүзеге 
асыруға,  қоғамдық маңызды əрекеттерге қатысуға ұмтылуы. 
Кəсіпорын деңгейіндегі мотивация жүйесі төмендегілерге кепіл болуы 
тиіс: 
• барлық еңбекшілердің жүұмыспен қамтылуы; 
• кəсіптік жəне қызметтік көтерілуге тең мүмкіндік туғызу; 
• еңбекақы деңгейінің еңбек нəтижелерімен сəйкестігі; 
• еңбек қауіпсіздігі шарттарының құрылуы; 
• ұжымда жайлы психологиялық климаттың сақталуы. 
Мотивация əдістері жіктеледі: 
• экономикалық (тура) – уақытша жəне келісімді еңбекақы; еңбектің 
сапалы жəне сандық көрсеткіштері үшін сыйақы; кəсіпорын 
кірістеріне қатысы; оқу үшін төлемақы: 
• экономикалық (тура емес) – кəсіпорында тамақтануға, траспорттық 
қызметке, тұрғын үй төлемдеріне жеңілдіктер беру; 
• материалдық емес – еңбек тартымдылығынкөтеру, қызмет бабымен 
ілгерілеу, ең жоғары деңгейде шешім қабылдауға қатысу, біліктілікті 
арттыру, жұмысқа шығудың еркін графигі. 
Кəсіпорын жұмысшыларының мотивацияларының негізгі формалары: 
o еңбекақы – кəсіпорын əрекетінің нəтижесіндегі жұмысшының 
салымының объективті бағасы; 
o жұмысшыларға арналған ішкі фирмалық жеңілдіктерінің жүйесі – 
тиімді сыйақы беру; стажға төлем, кəсіорын есебінен жұмысшылардың 
денсаулығын сақтау, пайызсыз несие беру, 

o ісшара, жұмысшының жауапкершілігі, тəелсіздігі, еңбегінің 
тартымдылығы мен маңыздылығы; 
o жұмысшылар арасындағы əкімшілік жəне  психологиялық 
„кедергілерді” жою, ұжымда сенім мен өзара түсінушіліктің дамуы; 
o жұмысшыларды моральдік мадақтау; 
o жұмысшылардың біліктілігін арттыру мен жұмыс барысында 
ілгерілеуі. 
 
Бекіту сұрақтары: 
1.  Еңбек мотивациясының құрамын талдаңыз. 
2. Күту теориясы өзара негізделетін байланыстарды атаңыз. 
3. Портер-Лоулер моделінің тезисінің мəніне тоқталаңыз. 
4. Мотивация əдістерінің жіктелуін талдаңыз. 
 

`},{id:"lecture-6",category:"lecture",shortTitle:"6-дәріс",title:"ІІ Бөлім. Ұжымның әлеуметтік-психологиялық ахуалын басқару. § 6 Ұжым. Ұжымның даму деңгейлері",pdfFile:"./assets/docs/6sabak.pdf",numPages:3,textHtml:`<p>2 Бөлім Ұжымның əлеуметтік-психологиялық ахуалын басқару § 6 Ұжым. Ұжымның даму деңгейлері Адамдардың əлеуметтік қауымдастығының ең жоғарғы формасы - ұжым. Ұжым - ол қоғамға пайдалы қызметте ортақ мақсатқа жұмыла еңбек ететін жəне психологиялық тұрғыда топтасқан адамдар тобы. Еңбек коллективі - өндірістің қоғамдық мəніне бағытталған ұйымдасқан адамдардың бірігуі. А.В.Петровский топ дамуының келесі схемасын шығарған. ОС векторы топтың əрекет құндылықтарының жанамалану дəрежесін көрсетеді( степень опосредования). ОА векторы жəне ОВ векторлары- жаналау бағытының мазмұнды жағы, топ əрекетінің бағыттылығын көрсетеді. Топ дамуының 5 дəрежесі: • Диффузды • Ассоциация • Кооперация • Корпорация • Коллектив Қарапайым орындаушылар арасында коллектив дамуына «кейіпкер жиыны» болуы мүмкін • «Ой генераторы» Коллективтегі жаңа пікірмен «қыздыратын» коллектив мүшесі. Əдетте бұл рөльге лидерлердің өздері тырысады.Егер басшы бұл рөлде болмаса осы генераторларға арқа сүйеулері дұрыс. Жəне қызғанбай, қарсыласпай, көлеңкесінде қалам ау деп уайымдамау керек. • «Оппозиционерлер». Əрқашан бəрінен күдіктеніп жүреді.коллективте ыңғайсыз сезінеді.Өткəр сөзімен ашуды келтіреді.Жағымсыз шындықты айтуды қорықпайды. Мұндай адам коллектив намысы ретінде қажет. Алайда ол жалғыз болуы тиіс. • «Сүйіктілер». Жалпыға ортақ ұнатулармен пайдаланады.Сырт келбеті сұлу,тартымды. Бұл адамда мінезі жақсы, ол адамдармен тіл табыса</p>
<p>біледі, тыңдай бəледі.Көңілін көтере біледі. Оған ішкі мəселемен немесе қуанышпен бөлісуге болады. Психологтардың ойынша еңбек коллективіндегі жаңартулар ұзақтығы шамамен 8-10℅. Коллектив – бұл өте динамикалық құралған əлеуметтік құрылым екенін көруге болады. Eңбек коллективінде 2 құрылым бар: формальды, формальды емес. Формальды құрылым жұмысшылардың ресми міндеттерінен , бұйрықтарынан құралады.Ол əр мүшесіне белгілі бір міндеттермен белгіленеді. Кейбір уақытта коллектив мүшелері формальды емес топты құрайды. Ол ресми емес қарым қатынасқа негізделеді. Мұндай құрылым формальды емес деп аталады. Ресми емес қарым-қатынас ресми құрылымның қосымшасы болып табылады. Олар ресми қарым-қатынасқа икемділік орнатады. Психологтар еңбек коллективінің ресми жəне ресми емес құрылымдардың жақындасуына көмектесетін фактор қатарын анықтады: • Тұлғааралық қарым-қатынастың сəйкес келуі мен басқару құрылымдарының структурасы, міндеттеріне байланысты адамдар бір- біріне сыпайылықпен қарап, ресми емес тұрғыда байланысады. • Топтың еңбек əрекеті кезінде мүшелеріне негативті қысымның болмауы. • Басшы мен жұмысшы арасындағы функционалды жағының жағдайы. Ресми структура жүйесі «басшы -жұмысшы» арасы қатаң, шектелегн тұлғалық қарым-қатынас. • Басшы мен жұмысшы арасындағы субординация неғүрлым үлкен əсерін тигізсе соғұрлым оның мазмұны өзгеше түрлі болаады жəне адами факторларға мақсатына, мотивіне сəйкес келеді., • Барлық басқару жүйесінің қызығушылықтарын есекере ресми икемділік пен басқару жүйесінің тұлғаралық қарым –қатынасының ресми қарым –қатынасты қатаң анықтайтын мəселелі ситуацияларды уақытында шешу • Басшының алатын орнына байланысты тұлғалық сапалары мен сол əрекеттегі жұмысшылардың тұлғалық сапаларымен сəйкес келуі. • Басшының мінез-құлқы мен əрекеті бұдан көргеніміздей еңбек коллективінде адамдармен қарым-қатынасы нəтижесінде ресми жəне ресми емес байланыста не жақындасу немесе алыстату орнайды Басқару əрекеттестігінің 7 сферасы: § Экспертті əрекеттестік § Сайланған сфера § Ұйымдастырылған сфера § Кадрлы сфера § Əлеуметтік –психологиялық климат § Коллективтің шарты мен еңбек режимі</p>
<h3 class="chapter-subheading">§ Ұйымдастырылған мəдениет Т. Е. Резник жəне Ю. М. Резник 3 негізгі өмірлік стратегияны бөліп көрсетеді. Өмірдің амандық стратегиясы. Өмірлік жетістік стратегиясы Өз қолжеткізу өмірлік стратегиясы. Қабілет – бұл адамдардың алған б ілімдерінің, ептілігі мен дағдыларының, əртүрлі қызметтерді жасай алу жетістігінің жеке ерекшеліктері. Қабілет – бұл адамның берілген қызмет барысында сатті орындаушылығының ерекшелігін көрсететін жеке – психологиялық ерекшелігі. Қызметінің қиындығы, əртүрлігі мен қоғамдық мағынасына байланысты қабілеттің 3 деңгейін ажыратады: - дарындылық – адамға қызметтің бірнеше түрімен айналысуға мүмкндік беретінекі топтың да қабілеттілігінің байланысы. - дарын – жаңашылдығымен, біртуарлығымен, жоғарғы жетістігімен ерекшеленетін еңбек өнімін алудағы қабілет жиынтығы. - біртуарлық – адамның қоғамдық маңызды, көтерілісті нəтижеге қол жеткізудегі дарындылықтың жоғарғы сатысы. Бекіту сұрақтары: 1. Еңбек ұжымы, ұжым ұғымдарына сипаттама беріңіз. 2. А.В.Петровскийдің топ дамуының схемасын түсіндіріңіз. 3. Басқару əрекеттестігінің сфераларын атаңыз.</h3>`,rawText:`2 Бөлім Ұжымның əлеуметтік-психологиялық ахуалын басқару 
§ 6 Ұжым. Ұжымның даму деңгейлері 
 
Адамдардың əлеуметтік қауымдастығының ең жоғарғы формасы - 
ұжым. Ұжым - ол қоғамға пайдалы қызметте ортақ мақсатқа жұмыла еңбек 
ететін жəне психологиялық тұрғыда топтасқан адамдар тобы.  Еңбек коллективі -  өндірістің қоғамдық мəніне бағытталған 
ұйымдасқан адамдардың бірігуі. 
А.В.Петровский топ дамуының келесі схемасын шығарған.  
 
ОС векторы  топтың əрекет құндылықтарының жанамалану дəрежесін 
көрсетеді( степень опосредования). ОА векторы жəне ОВ векторлары-  
жаналау бағытының мазмұнды жағы, топ əрекетінің бағыттылығын 
көрсетеді. 
Топ дамуының  5 дəрежесі: 
•  Диффузды 
•  Ассоциация 
•  Кооперация 
•  Корпорация 
•  Коллектив 
Қарапайым орындаушылар арасында коллектив дамуына «кейіпкер 
жиыны» болуы мүмкін 
•  «Ой генераторы» Коллективтегі  жаңа пікірмен «қыздыратын» 
коллектив мүшесі. Əдетте бұл рөльге лидерлердің өздері тырысады.Егер 
басшы бұл рөлде болмаса осы генераторларға арқа сүйеулері дұрыс. Жəне 
қызғанбай, қарсыласпай, көлеңкесінде қалам ау деп уайымдамау керек. 
•  «Оппозиционерлер». Əрқашан бəрінен күдіктеніп 
жүреді.коллективте ыңғайсыз сезінеді.Өткəр сөзімен ашуды 
келтіреді.Жағымсыз шындықты айтуды қорықпайды. Мұндай адам 
коллектив намысы ретінде қажет. Алайда ол жалғыз болуы тиіс. 
•  «Сүйіктілер». Жалпыға ортақ ұнатулармен пайдаланады.Сырт 
келбеті сұлу,тартымды. Бұл адамда мінезі жақсы, ол адамдармен тіл табыса 


біледі, тыңдай бəледі.Көңілін көтере біледі. Оған ішкі мəселемен немесе 
қуанышпен бөлісуге болады. 
Психологтардың ойынша еңбек коллективіндегі жаңартулар ұзақтығы 
шамамен 8-10℅. Коллектив – бұл өте динамикалық құралған əлеуметтік 
құрылым екенін көруге болады. 
Eңбек коллективінде 2 құрылым бар: формальды, формальды емес. 
Формальды құрылым жұмысшылардың ресми міндеттерінен , 
бұйрықтарынан құралады.Ол əр мүшесіне белгілі бір міндеттермен 
белгіленеді. Кейбір уақытта коллектив мүшелері формальды емес топты 
құрайды. Ол ресми емес қарым қатынасқа негізделеді. Мұндай құрылым 
формальды емес деп аталады. Ресми емес қарым-қатынас ресми 
құрылымның қосымшасы болып табылады. Олар ресми қарым-қатынасқа  
икемділік орнатады. 
Психологтар еңбек коллективінің ресми жəне ресми емес 
құрылымдардың жақындасуына көмектесетін фактор қатарын анықтады: 
•  Тұлғааралық қарым-қатынастың сəйкес келуі мен басқару 
құрылымдарының структурасы, міндеттеріне байланысты адамдар бір-
біріне сыпайылықпен қарап, ресми емес тұрғыда байланысады. 
•  Топтың еңбек əрекеті кезінде  мүшелеріне негативті қысымның 
болмауы. 
•  Басшы мен жұмысшы арасындағы функционалды жағының жағдайы. 
Ресми структура жүйесі «басшы -жұмысшы» арасы қатаң, шектелегн 
тұлғалық қарым-қатынас. 
•  Басшы мен жұмысшы арасындағы субординация неғүрлым үлкен 
əсерін тигізсе соғұрлым оның мазмұны  өзгеше түрлі болаады жəне  адами 
факторларға  мақсатына, мотивіне сəйкес келеді., 
•  Барлық басқару жүйесінің қызығушылықтарын есекере ресми 
икемділік пен басқару жүйесінің тұлғаралық қарым –қатынасының ресми 
қарым –қатынасты қатаң анықтайтын мəселелі  ситуацияларды уақытында 
шешу 
•  Басшының алатын орнына байланысты тұлғалық сапалары мен сол 
əрекеттегі жұмысшылардың тұлғалық сапаларымен сəйкес келуі. 
•  Басшының мінез-құлқы мен əрекеті бұдан көргеніміздей еңбек 
коллективінде адамдармен қарым-қатынасы нəтижесінде ресми жəне ресми 
емес байланыста не жақындасу немесе алыстату орнайды 
Басқару əрекеттестігінің 7 сферасы: 
§  Экспертті əрекеттестік 
§  Сайланған сфера 
§  Ұйымдастырылған сфера 
§  Кадрлы сфера 
§  Əлеуметтік –психологиялық климат 
§  Коллективтің шарты мен еңбек режимі 

§  Ұйымдастырылған мəдениет 
Т. Е. Резник жəне Ю. М. Резник 3 негізгі өмірлік стратегияны бөліп 
көрсетеді. Өмірдің амандық стратегиясы.  Өмірлік жетістік стратегиясы Өз 
қолжеткізу өмірлік стратегиясы. 
Қабілет – бұл адамдардың алған б ілімдерінің, ептілігі мен 
дағдыларының, əртүрлі қызметтерді жасай алу жетістігінің  жеке 
ерекшеліктері. 
Қабілет – бұл адамның берілген қызмет барысында сатті 
орындаушылығының ерекшелігін көрсететін жеке – психологиялық  
ерекшелігі. 
Қызметінің қиындығы, əртүрлігі мен қоғамдық мағынасына 
байланысты қабілеттің 3 деңгейін ажыратады: 
- дарындылық – адамға қызметтің бірнеше түрімен айналысуға 
мүмкндік беретінекі топтың да қабілеттілігінің байланысы. 
- дарын – жаңашылдығымен, біртуарлығымен, жоғарғы 
жетістігімен ерекшеленетін еңбек өнімін алудағы қабілет 
жиынтығы. 
- біртуарлық – адамның қоғамдық маңызды, көтерілісті нəтижеге 
қол жеткізудегі дарындылықтың жоғарғы сатысы. 
Бекіту сұрақтары: 
1.  Еңбек ұжымы, ұжым ұғымдарына сипаттама беріңіз. 
2. А.В.Петровскийдің топ дамуының схемасын түсіндіріңіз. 
3. Басқару əрекеттестігінің сфераларын атаңыз. 
 

`},{id:"lecture-7",category:"lecture",shortTitle:"7-дәріс",title:"§ 7 Басқару стилі және ұжымның психологиялық ахуалына әсері",pdfFile:"./assets/docs/7sabak.pdf",numPages:5,textHtml:`<h3 class="chapter-subheading">§ 7 Басқару стилі жəне ұжымның психологиялық ахуалына əсері Басқарушылық қызмет стилі саяси режимдерге байланысты жəне соған сəйкес қалыптасады. Осыған орай ғылыми əдебиеттерде бірнеше басқару стилдері қарастырылған, атап айтқанда, директивті (əкімшілік, автократиялық, авторитарлық), демократиялық (ұжымдық, кооперативтік) жəне либералдық. Директивті стильге биліктің шектен тыс орталықтандырылуы, көпшілікпен жəне бағыныштылармен санаспаушылық тəн, мұнда нені қалай істеу керектігін басшы өзі шешеді. Демократиялық стильде – бағыныштыларға еркіндік беру арқылы, олардың белсенді түрде араласуы нəтижесі нде шешімдер əзірленіп, қабылданады. Жұмысты орындауға қажетті алғышарттар жасалып, оның нəтижесі əділ бағаланады. Адамдармен сыйласымды қатынастар орнатылады. Либералдық стиль – басшының бағыныштылардың іс-əрекеттеріне араласпауымен сипатталады. Ол жауапкершіліктен қашқақтап, тіпті ұжым қызметінің ең күрделі мəселелерін шешуге де қатыспайды. Аталып өткен стильдерден басқа əркім нені жəне қалай істегісі келсе өз бетінше орындайтын анархиялық стиль; белгілі бір шараны орындау, атқару кезінде ғана аса белсенділік танытатын, келесі жағдайларға дейін салғыртсу, əрекетсіздік білдіретін кампаниялық стиль (кампанейский), көбінесе бұйрыққа, қызметтік тəуелділікке негізделіп, дөрекі психологиялық қысым жасалатын еріктілік стиль түрлері белгілі. Сонымен қатар нормативтік, яғни көпшілік мойындаған, қоғам қолдайтын жалпы ортақ стильді,нақтылы басқару қызметінің жағдайларына, түрлеріне жəне қызметкерлердің қабілетіне байланысты қалыптасатын жеке стильдерді де атауға болады. Американдық психолог Курт Левин (1890 -1947жж.) директивті басқарудағы қызметті ең өнімді деп санаған. Демократиялық басқару ең көп тараған жəне өнімділік пен сапа көрсеткіштеріне қол жеткізуге мүмкіндік туғызады. Басқарудың либералды стилі барлық жағынан н ашар болып шықты. Левин мінез-құлықтық бағыттың өкілі болып табылады, себебі оған дейін басқару тиімділігін басқарушының жеке қасиеттерімен емес, бағынышты қызметкерлерге қатысты жүріс-тұрыс үлгісімен анықтайтын тұлғалық жəне жағдайлық теориялар орын алған болатын. Осыған байланысты стильдер автократиялық жəне демократиялық болып жіктеледі. Авторлар сəйкесінше оларды «барлық күш -жігерін жұмысқа жұмылдырған» жəне «барлық күш-жігерін адамдарға бағыттаған» деп бөледі. Барлық күш-жігерін жұмысқа жұмылдырған басшы үнемі мəселенің дұрыс қойылуы мен еңбек өнімділігін арттыру жайлы ойлайды. Ал «барлық күш-жігерін адамдарға бағыттаған» басшы еңбек өнімділігінің өсуін тек</h3>
<p>адами қатынастарды жетілдіру жолдары арқылы ғана өз мақсаты етіп қояды.Бірақ басшы тек жұмысқа ғана өз назарын аударып, қызметкерлеріне мүлдем көңіл бөлмеуге болмайтындығы кейіннен белгілі болды. Ол қандай да бір дəрежеде адами қатынастарды ынталандыруға, қарамағандағылардың қажеттілігін қанағаттандыруға мəжбүрлі. Авторитарлық бағыттың да, адами қатын астар позициясын ұстанушылардың да жақтаушылары бар. Бұл екі бағыт та тəжірибе жүзінде оң қолдауға ие болды жəне олар жұмыспен қанағаттанушылық пен еңбек өнімділігінің жоғары болуы авторитарлық басқарудың нəтижесінде жəне керісінше, қарама-қарсы нəтижелер демократиялық басқару стилінде де болуы мүмкін. Қанағаттанушылық. «Жұмыспен қанағаттанушылық» термині индивидтің өз жұмысына деген қатысушылығын анықтайтын болады. Осылайша, жұмысына деген жоғары негізі бар адам өз жұмысына позитивті түрде қарайды . Себебі əрекеттерді оқу үшін қанағаттанушылық жоғары орынға ие. Жұмыспен қанағаттанушылықты анықтау үшін екі тəсілді қолданылады. Біріншісі жекеше бір аспектілерді қарастыру арқылы. Осы тəсіл жұмыскерлердің ойын «Сіз жұмыспен барлық көзқарастар негізінде қанағаттанасыз ба?» деген сұраққа жауап беру болып табылады. Екінші тəсіл едəуір жинақталған. Негізгі факторлар бұл жерде жұмыстағы элементтер болып табылады, олар басшылықтың қатынасына қарай негізделген. Қанағаттанушылық жəне абсентеизм. Айқын абсентеизмді анықтау оңай. Қызметкер жұмысқа кешігіп келеді, сұранып ертерек қайтып кетеді, түскі асты берілген уақыттан ұзақ ішеді, жұмыстан жиі сұранады, денсаулығының немесе мазасының жоқтығына жиі сүйенеді. Мұндай адамдар өте көп кездеседі. Абсентеизмнің бұл түрі оңай анықталады жəне басшы қызметкерге қатысты шара қолданып, абсентеизмді тыя алады. Ал жасырын абсентеизмге келгенде жағдай қиындай түседі. Қызметкер жұмысқа уақтылы келеді, белсенді жұмыс істеп жатқан адамның кейпін танытады, бірақ шын мəнісінде жұмыс процесіне қатты ат салыспайды. Əріптестерімен қызмет бойынша сөйлеспей, жақын таныстарымен жеке мəселе бойынша əңгімелеседі, əр сағат сайын темекі шегуге немесе телефонмен сөйлесуге шығып тұрады. Өнімділік Еңбек Өнімділігі Еңбек Өнімділігі - алынған өнім көлемінің оны дайындауға жұмсалған еңбекке қатынасы (еңбектің өндіріс үдерісіндегі тиімділігі). Уақыт өлшемінде өндірілген өнімнің мөлшерімен (өндіріммен) немесе өнім өлшеміне жұмсалған уақыт шығынымен (еңбек сыйымдылығымен) тұлғаланады. Жеке жəне қоғамдық еңбек өнімділігі түрлеріне бөлінеді.</p>
<p>Біріншісі нақты еңбек шығынын, екіншісі нақты жəне өткендегі (затандырылған) еңбек шығынын көрсетеді Өнімді өндіруге жұмсалған шығындар жанды еңбек шығындары мен өндіріс құрал-жабдықтарының шығындарынан тұрады. Ал соңғыларда, өз уақытында, соларды жасауға жұмсалған еңбек шығындары болып табылған. Сондықтан экономикалық теорияда өнімнің қандайына болмасын жанды (нақты) жəне зат түріндегі еңбек жұмсалады деп тұжырымдалады. Өткен (зат түріндегі) еңбек білім, информация т.с.с. түрде жинақталады. Өнімділік - осы жүйенің берілген уақыт мерзімінде өндірген өнімдерінің сол мерзімде жасалған, немесе еңдірілген өнімдер үшін тұтынылған ресурстардың санына арақатынасы. Егер ресурстардың аталған бір түрінің (еңбек, капитал, қуат, информация, материалдар) өнімділігін есептеу қажет болса, онда бұл есеп өнімділіктің жеке көрсеткіші болып табылады. Мысалы: ЕӨ = Өнім көлемі/Тірі еңбек шығындары Басқа көп түсініктер сияқты, өнімділік тиімділіктің көрсеткіштер жүйесін құруымен бірге к өптеген сан көрсеткіштермен белгіленеді. Өнімділіктің' шағын жəне кең мағынасы болады. Өнімділіктің шағын мағынасы деп, өндірістің негізгі мақсатына көзқарас бағыты нан өндірістік процестің тиімділігін сипаттайтын, бір көрсеткіш түсініледі. Негізгі мақсат осы өндірістік процестен тыс өткізілуге тағайындалған енімдермен жəне бір немесе бірнеше негізгі ресурстардың арасалмағы түрін алады. Бұндай көрсеткіште өндіріс шарттары (тапсырманың уақытында орындалуы, жұмысшылардың жарақаттарының саны жəне басқалар) көрсетілмейді. Өнімділікті өлшеудің негізгі екі тобы бар. Біріншіге өнімділіктің статикалық коэффициенттері жатады. Бұл жабайы тілмен айтсақ, белгілі уақыт мерзімінде жасалған шығындардын өлшеміне бөлінген өнімнің өлшемі. Екіншіге өнімділіктің динамикалық индексі жатады. Бұл өткен мерзімдегі өнімділіктің статикалық коэффициентіне бөлінген, белгілі мерзімдегі өнімділіктің статикалық коэффициенті. Тиімді басшылыққа деген жағдайлық тəсіл Тиімді басқаруға сəйкес келетін мінез-құлық тұрғылары мақсатты болжаудың құрылымы жəне негізгі өлшемдері іс -əрекеттің неғұрлым жалпыланған мақсаты міндетті іс (миссия) деп аталады. Ол адамның, топтың, ұйымның тіршілігін анықтайды. Міндетті іс ресми құрастырылып, ұйымның барлық мүшелеріне хабарланып, адамдарды ынталандыруы тиіс. Мақсаттар, бұл – ақырғы нəтижелерді немесе міндетті істі жүзеге асыруда орындалуы тиіс күйлер. Мақсаттардың орындалуына белгілі уақыт беріледі (мəселен, бір немесе бес жыл).</p>
<p>Міндеттер бұл мақсатқа жетуде қажет əрекеттер міндеттердің анықталуы мен үлестірілуінде өлшеу құралдары (мəселен, көлем, пайыздар, мерзімдер, пропорциялар) қолданылады. Сонымен бірге, кім, не жəне қай жерде жəне қашан еңбек ететіні белгіленеді. Жоспарлаудың мəні осында. Жоспарлау қойылған мақсатқа сүйенеді жəне міндеттердің орындалуына қажетті қорлар жайлы мəселені қарстырады. Кез келген жоспардың: 1) экономикалық негіздемесі, ақылға қонымдылығы болуы тиіс (ақырғы нəтижеге уақытты, қаржыны жəне қорларды аз мөлшерде жұмсай отырып жету); 2) шынайы мүмкіншіліктері болуы тиіс; 3) икемді болуы қажет (қойылған мақсатқа нұқсан келтірмей жету). Тиімді басқарудың ықтималды үлгісі Бұл теория төмендегідей алғышарттардан бастау алады: 1) Басқару стилі əрқашан басшының қол астындағы ұжымның тиімді қызмет етуіне байланысты. 2) Басқару стилі мен оның тиімділігінің арасындағы байланыс оған ықтимал сипатты таңып қоятын көрсеткіштердің (ұжымның жəне ондағы адамдардың ерекшеліктері жəне т.б.) тұтастай қатарымен міндеттелген. Əлеуметтік жəне басқару психологиясындағы танымал америкалық маман Ф.Филлердің құрастырған тиімді басқарудың ықтималды үлгісінің мəні мынада: 1) Басқарудың тиімділігі (оның стиліне немесе типіне қарамастан) басшының əрекет еткен жағдайды бақылау дəрежесімен анықталады. 2) Кез келген жағдай негізгі үш өлшемнің жиынтығы ретінде ұсынылуы мүмкін, олар: \0 Басшының қол астындағылармен қатынасының жағымдылық дəрежесі; \0 Басшының топтағы билігінің (ықпалының) көлемі; \0 Топтық міндеттің құрылымы (көзделген мақсаттың нақтылығы, оны шешу жолдары мен тəсілдерін көре білу жəне т.б.). Осы өлшемдердің жинақталған сандық деректері басшының жағдаятты бақылау дəрежесін білдіреді. Нақты өмірде аталмыш басқару стильдерінің ешбірі де таза күйінде көрініс таппайды. Əрбір басшының мінез-құлқынан (жүріс-тұрысынан) аталған үш стильдің барлығына тəн жалпы ерекшеліктерді кездестіруге болады. Əр түрлі адамдар мен ұжымдарды басқаруға сəйкес келе беретін əмбебап басқару стилі жоқ. Көбіне олар ұштасып, сабақтасып, қандай да бір стильдің басымдыққа ие болуымен сипатталады. Дегенмен мемлекеттік басқарудың демократиялық стилінің мақсатқа сай, нəтижелі жəне перспективалы екендігін тарихи тəжірибе көрсетіп отыр. Бұ л стиль</p>
<p>басқарушылық процестерді тұрақтандыруға жəне сол арқылы ұтымды əрі тиімді қоғамдық дамуды қамтамасыз етуге мүмкіндік береді. Бекіту сұрақтары: 1. Басқару стильдеріне анықтама беріңіз. 2. Американдық психолог Курт Левиннің пікірі қандай болды? 3. Тиімді басшылыққа деген жағдайлық тəсілдерді атаңыз. 4. Ф.Филлердің құрастырған тиімді басқарудың ықтималды үлгісінің мəнін ашыңыз</p>`,rawText:`§ 7 Басқару стилі жəне ұжымның  психологиялық ахуалына əсері 
 
Басқарушылық қызмет стилі саяси режимдерге байланысты жəне соған 
сəйкес қалыптасады. Осыған орай ғылыми əдебиеттерде бірнеше басқару 
стилдері қарастырылған, атап айтқанда, директивті (əкімшілік, 
автократиялық, авторитарлық), демократиялық (ұжымдық, кооперативтік) 
жəне либералдық. 
Директивті стильге биліктің шектен тыс орталықтандырылуы, 
көпшілікпен жəне бағыныштылармен санаспаушылық тəн, мұнда нені 
қалай істеу керектігін басшы өзі шешеді. 
Демократиялық стильде – бағыныштыларға еркіндік беру арқылы, 
олардың белсенді түрде араласуы нəтижесі нде шешімдер əзірленіп, 
қабылданады. Жұмысты орындауға қажетті алғышарттар жасалып, оның 
нəтижесі əділ бағаланады. Адамдармен сыйласымды қатынастар 
орнатылады. 
Либералдық стиль – басшының бағыныштылардың іс-əрекеттеріне 
араласпауымен сипатталады. Ол жауапкершіліктен қашқақтап, тіпті ұжым 
қызметінің ең күрделі мəселелерін шешуге де қатыспайды. 
Аталып өткен стильдерден басқа əркім нені жəне қалай істегісі келсе 
өз бетінше орындайтын анархиялық стиль; белгілі бір шараны орындау, 
атқару кезінде ғана аса белсенділік танытатын, келесі жағдайларға дейін 
салғыртсу, əрекетсіздік білдіретін кампаниялық стиль (кампанейский), 
көбінесе бұйрыққа, қызметтік тəуелділікке негізделіп, дөрекі 
психологиялық қысым жасалатын еріктілік стиль түрлері белгілі. Сонымен 
қатар нормативтік, яғни көпшілік мойындаған, қоғам қолдайтын жалпы 
ортақ стильді,нақтылы басқару қызметінің жағдайларына, түрлеріне жəне 
қызметкерлердің қабілетіне байланысты қалыптасатын жеке стильдерді де 
атауға болады. 
Американдық психолог Курт Левин (1890 -1947жж.) директивті 
басқарудағы қызметті ең өнімді деп санаған. Демократиялық басқару ең көп 
тараған жəне өнімділік пен сапа көрсеткіштеріне қол жеткізуге мүмкіндік 
туғызады. Басқарудың либералды стилі барлық жағынан н ашар болып 
шықты. Левин мінез-құлықтық бағыттың өкілі болып табылады, себебі оған 
дейін басқару тиімділігін басқарушының жеке қасиеттерімен емес, 
бағынышты қызметкерлерге қатысты жүріс-тұрыс үлгісімен анықтайтын 
тұлғалық жəне жағдайлық теориялар орын алған  болатын. Осыған 
байланысты стильдер автократиялық жəне демократиялық болып 
жіктеледі. Авторлар сəйкесінше оларды «барлық күш -жігерін жұмысқа 
жұмылдырған» жəне «барлық күш-жігерін адамдарға бағыттаған» деп 
бөледі. 
Барлық күш-жігерін жұмысқа жұмылдырған басшы үнемі мəселенің 
дұрыс қойылуы мен еңбек өнімділігін арттыру жайлы ойлайды. Ал «барлық 
күш-жігерін адамдарға бағыттаған» басшы еңбек өнімділігінің өсуін тек 

адами қатынастарды жетілдіру жолдары арқылы ғана өз мақсаты етіп 
қояды.Бірақ басшы тек жұмысқа ғана өз назарын аударып, қызметкерлеріне 
мүлдем көңіл бөлмеуге болмайтындығы кейіннен белгілі болды. Ол қандай 
да бір дəрежеде адами қатынастарды ынталандыруға, 
қарамағандағылардың қажеттілігін қанағаттандыруға мəжбүрлі. 
Авторитарлық бағыттың да, адами қатын астар позициясын 
ұстанушылардың да жақтаушылары бар. Бұл екі бағыт та тəжірибе жүзінде 
оң қолдауға ие болды жəне олар жұмыспен қанағаттанушылық пен еңбек 
өнімділігінің жоғары болуы авторитарлық басқарудың нəтижесінде жəне 
керісінше, қарама-қарсы нəтижелер демократиялық басқару стилінде де 
болуы мүмкін. 
Қанағаттанушылық. «Жұмыспен қанағаттанушылық» термині 
индивидтің өз жұмысына деген қатысушылығын анықтайтын болады. 
Осылайша, жұмысына деген жоғары негізі бар адам өз жұмысына позитивті 
түрде қарайды . Себебі əрекеттерді оқу үшін қанағаттанушылық жоғары 
орынға ие. Жұмыспен қанағаттанушылықты анықтау үшін екі тəсілді 
қолданылады. Біріншісі жекеше бір аспектілерді қарастыру арқылы. Осы 
тəсіл жұмыскерлердің ойын «Сіз жұмыспен барлық көзқарастар негізінде 
қанағаттанасыз ба?» деген сұраққа жауап беру болып табылады.  Екінші 
тəсіл едəуір жинақталған. Негізгі факторлар бұл жерде жұмыстағы 
элементтер болып табылады, олар басшылықтың қатынасына қарай 
негізделген. 
Қанағаттанушылық жəне абсентеизм. 
Айқын абсентеизмді анықтау оңай. Қызметкер жұмысқа кешігіп 
келеді, сұранып ертерек қайтып кетеді, түскі асты берілген уақыттан ұзақ 
ішеді, жұмыстан жиі сұранады, денсаулығының немесе мазасының 
жоқтығына жиі сүйенеді. Мұндай адамдар өте көп кездеседі. Абсентеизмнің 
бұл түрі оңай анықталады жəне басшы қызметкерге қатысты шара 
қолданып, абсентеизмді тыя алады. Ал жасырын абсентеизмге келгенде 
жағдай қиындай түседі. Қызметкер жұмысқа уақтылы келеді, белсенді 
жұмыс істеп жатқан адамның кейпін танытады, бірақ шын мəнісінде жұмыс 
процесіне қатты ат салыспайды. Əріптестерімен қызмет бойынша 
сөйлеспей, жақын таныстарымен жеке мəселе бойынша əңгімелеседі, əр 
сағат сайын темекі шегуге немесе телефонмен сөйлесуге шығып тұрады. 
Өнімділік 
Еңбек Өнімділігі 
Еңбек Өнімділігі - алынған өнім көлемінің оны дайындауға жұмсалған 
еңбекке қатынасы (еңбектің өндіріс үдерісіндегі тиімділігі). Уақыт 
өлшемінде өндірілген өнімнің мөлшерімен (өндіріммен) немесе өнім 
өлшеміне жұмсалған уақыт шығынымен (еңбек сыйымдылығымен) 
тұлғаланады. Жеке жəне қоғамдық еңбек өнімділігі түрлеріне бөлінеді. 

Біріншісі нақты еңбек шығынын, екіншісі нақты жəне өткендегі 
(затандырылған) еңбек шығынын көрсетеді 
Өнімді өндіруге жұмсалған шығындар жанды еңбек шығындары мен 
өндіріс құрал-жабдықтарының шығындарынан тұрады. Ал соңғыларда, өз 
уақытында, соларды жасауға жұмсалған еңбек шығындары болып 
табылған. Сондықтан экономикалық теорияда өнімнің қандайына 
болмасын жанды (нақты) жəне зат түріндегі еңбек жұмсалады деп 
тұжырымдалады. Өткен (зат түріндегі) еңбек білім, информация т.с.с. түрде 
жинақталады. 
Өнімділік - осы жүйенің берілген уақыт мерзімінде өндірген 
өнімдерінің сол мерзімде жасалған, немесе еңдірілген өнімдер үшін 
тұтынылған ресурстардың санына арақатынасы. Егер ресурстардың аталған 
бір түрінің (еңбек, капитал, қуат, информация, материалдар) өнімділігін 
есептеу қажет болса, онда бұл есеп өнімділіктің жеке көрсеткіші болып 
табылады. 
Мысалы: 
ЕӨ = Өнім көлемі/Тірі еңбек шығындары 
Басқа көп түсініктер сияқты, өнімділік тиімділіктің көрсеткіштер 
жүйесін құруымен бірге к өптеген сан көрсеткіштермен белгіленеді. 
Өнімділіктің' шағын жəне кең мағынасы болады. Өнімділіктің шағын 
мағынасы деп, өндірістің негізгі мақсатына көзқарас бағыты нан өндірістік 
процестің тиімділігін сипаттайтын, бір көрсеткіш түсініледі. Негізгі мақсат 
осы өндірістік процестен тыс өткізілуге тағайындалған енімдермен жəне бір 
немесе бірнеше негізгі ресурстардың арасалмағы түрін алады. Бұндай 
көрсеткіште өндіріс шарттары (тапсырманың уақытында орындалуы, 
жұмысшылардың жарақаттарының саны жəне басқалар) көрсетілмейді. 
Өнімділікті өлшеудің негізгі екі тобы бар. 
Біріншіге өнімділіктің статикалық коэффициенттері жатады. Бұл 
жабайы тілмен айтсақ, белгілі уақыт мерзімінде жасалған шығындардын 
өлшеміне бөлінген өнімнің өлшемі. 
Екіншіге өнімділіктің динамикалық индексі жатады. Бұл өткен 
мерзімдегі өнімділіктің статикалық коэффициентіне бөлінген, белгілі 
мерзімдегі өнімділіктің статикалық коэффициенті. 
Тиімді басшылыққа деген жағдайлық тəсіл 
Тиімді басқаруға сəйкес келетін мінез-құлық тұрғылары мақсатты 
болжаудың құрылымы жəне негізгі өлшемдері іс -əрекеттің неғұрлым 
жалпыланған мақсаты міндетті іс (миссия) деп аталады. Ол адамның, 
топтың, ұйымның тіршілігін анықтайды. Міндетті іс ресми құрастырылып, 
ұйымның барлық мүшелеріне хабарланып, адамдарды ынталандыруы тиіс. 
Мақсаттар, бұл – ақырғы нəтижелерді немесе міндетті істі жүзеге 
асыруда орындалуы тиіс күйлер. Мақсаттардың орындалуына белгілі уақыт 
беріледі (мəселен, бір немесе бес жыл). 

Міндеттер бұл мақсатқа жетуде қажет əрекеттер міндеттердің 
анықталуы мен үлестірілуінде өлшеу құралдары (мəселен, көлем, пайыздар, 
мерзімдер, пропорциялар) қолданылады. 
Сонымен бірге, кім, не жəне қай жерде жəне қашан еңбек ететіні 
белгіленеді. Жоспарлаудың мəні осында. 
Жоспарлау қойылған мақсатқа сүйенеді жəне міндеттердің 
орындалуына қажетті қорлар жайлы мəселені қарстырады. 
Кез келген жоспардың: 
1) экономикалық негіздемесі, ақылға қонымдылығы болуы тиіс 
(ақырғы нəтижеге уақытты, қаржыны жəне қорларды аз мөлшерде жұмсай 
отырып жету); 
2) шынайы мүмкіншіліктері болуы тиіс; 
3) икемді болуы қажет (қойылған мақсатқа нұқсан келтірмей жету). 
Тиімді басқарудың ықтималды үлгісі 
Бұл теория төмендегідей алғышарттардан бастау алады: 
1) Басқару стилі əрқашан басшының қол астындағы ұжымның тиімді 
қызмет етуіне байланысты. 
2) Басқару стилі мен оның тиімділігінің арасындағы байланыс оған 
ықтимал сипатты таңып қоятын көрсеткіштердің (ұжымның жəне ондағы 
адамдардың ерекшеліктері жəне т.б.) тұтастай қатарымен міндеттелген. 
Əлеуметтік жəне басқару психологиясындағы танымал америкалық 
маман Ф.Филлердің құрастырған тиімді басқарудың ықтималды үлгісінің 
мəні мынада: 
1) Басқарудың тиімділігі (оның стиліне немесе типіне қарамастан) 
басшының əрекет еткен жағдайды бақылау дəрежесімен анықталады. 
2) Кез келген жағдай негізгі үш өлшемнің жиынтығы ретінде 
ұсынылуы мүмкін, олар: 
\0 Басшының қол астындағылармен қатынасының жағымдылық 
дəрежесі; 
\0 Басшының топтағы билігінің (ықпалының) көлемі; 
\0 Топтық міндеттің құрылымы (көзделген мақсаттың нақтылығы, оны 
шешу жолдары мен тəсілдерін көре білу жəне т.б.). 
Осы өлшемдердің жинақталған сандық деректері басшының 
жағдаятты бақылау дəрежесін білдіреді. 
Нақты өмірде аталмыш басқару стильдерінің ешбірі де таза күйінде 
көрініс таппайды. Əрбір басшының мінез-құлқынан (жүріс-тұрысынан) 
аталған үш стильдің барлығына тəн жалпы ерекшеліктерді кездестіруге 
болады. Əр түрлі адамдар мен ұжымдарды басқаруға сəйкес келе беретін 
əмбебап басқару стилі жоқ. Көбіне олар ұштасып, сабақтасып, қандай да бір 
стильдің басымдыққа ие болуымен сипатталады. Дегенмен мемлекеттік 
басқарудың демократиялық стилінің мақсатқа сай, нəтижелі жəне 
перспективалы екендігін тарихи тəжірибе көрсетіп отыр. Бұ л стиль 

басқарушылық процестерді тұрақтандыруға жəне сол арқылы ұтымды əрі 
тиімді қоғамдық дамуды қамтамасыз етуге мүмкіндік береді.   
 
Бекіту сұрақтары: 
1. Басқару стильдеріне анықтама беріңіз. 
2. Американдық психолог Курт Левиннің пікірі қандай болды? 
3. Тиімді басшылыққа деген жағдайлық тəсілдерді атаңыз. 
4. Ф.Филлердің құрастырған тиімді басқарудың ықтималды үлгісінің 
мəнін ашыңыз 
 

`},{id:"lecture-8",category:"lecture",shortTitle:"8-дәріс",title:"§ 8 Жетекшілік және көшбасшылық. Көшбасшы теориясының қағидалары",pdfFile:"./assets/docs/8sabak.pdf",numPages:7,textHtml:`<h3 class="chapter-subheading">§ 8 Жетекшілік жəне көшбасшылық. Көшбасшы теориясының қағидалары Көшбасшылык пен ресми жетекшілік топ ic -əрекетіндегі айырмашылығы келесі жагдайлармен аныкталады: 1. Лидер топтағы тұлғааралық катынастарды, ал басшы топтың ресми карым-катынасын əлеуметік ұйым ретінде реттейді; 2 . Лидерлік – микроортаның элементі, басшылық – макроортаның элементі, өйткені ол қоғамдық катынастар жүйесімен байланысқан; 3. Лидерлік - стихиялық процесс, ал басшылық мақсатты бағытталған, өйткені əлеуметтік құрылым элементтерінің бақылауымен жүреді; 4. Басшылық - тұрақты құбылыс, лидерді ұсыну топтың көңіл күйіне байланысты, сондықтан лидерлілік құбылысының тұрақтылығы төмендеу; 5. Лидерлілікте жетекшілік игерген белгілі 6ip санкциялар жүйесі жоқ, ал басшылықта белгіленген санкциялар жүйесі бар; 6. Көшбасшы топтық ic -əрекетке тікелей катысты шешімдер кабылдайды, ал жетекшінің шешім қабылдау процесі көптеген, тіпті осы топка міндетті түрде топпен байланысы жоқ шешімдерді де қабылдауға мəжбүр; 7. Жетекшінің ic-əрекет саласы көшбасшыға қарағанда аукымды, өйткені ол топты əлдеқайда кең əлеуметтік жуйеде ұсынады. Басқару іс əрекетінің биліктік реттеушілері «жетекші стилі» ұғымымен белгіленеді жəне де қандай жеке сапалар адамға көшбасшы болуға көмектесетіні туралы сұрақтар - көшбасшылық теориясында қарастырылады. Көшбасшы тұжырымдамасының негізгі төрт тобы бар: • Сипаттар теориясы • Мінез құлықтық тəсіл • Жағдайлық тəсіл • Бейімді жетекшілік теориясы. Сипаттар теориясы. «ұлы адамдар теориясы» немесе «харизматикалық теория» ретінде белгіленетін тұлғалық сапалар тəсілі. Оның мəні тұлғалық сапалардың интеллект, жігер бастамашылық, сенімділік, қуаттылық, шешендік, т.с.с. белгілі бір жи ынтығын игерген адам ғана көшбасшы бола алатынында. Бұл сапа болашақта кажет бола отырып, адамды көшбасшы тұрғысына ұсыну үшін жеткілікті болып табылмайды. Мінез-құлықтық тəсіл. Бұл тəсіл басқару іс-əрекетінң тиімділігі, жетекшінің тек тұлғалық сапаларымен ғана емес, оның қарамағындағыларға қатысты мінез-құлық стилімен де анықталады. Басқару теориясында осы тəсілдің арқасында «жетекшілік стилі» ұғымы жəне жалпы басқару стильдері пайда болды. Бұл тэсіл көшбасшылық</h3>
<p>теориясында жетекші орын алады. Жағдайлык жəне бейімді тəсілдер оның жалғасы мен жетілуі болып дамыды. Бұл тəсілде жетекшіліктің бес стилі атап көрсетіледі. 1. Бірлескен басқару (кедейліктен корку). Жетекші барынша аз күш жұмсайды жəне басқалардан да жұмыстың орындалу сапасы жұмыстан босатуды болдырмайтындай ғана дəрежеде болуын талап етеді. 2. Қала сыртындағы клуб ретінде басқару (демалыс үйi). Жетекші қарамағындағылармен достық қарым-қатынасты ұсынады, тапсырманың ең тиімді орындалуына ұмтылмайды. 3. Билік-бағыну (үстемдік ету). Жетекші ұйымдағы жақсы қарым қатынасты ұстап тұруға аз зейін аударады, ол тиімді іс-əрекетпен қамтамасыз етуге толықтай берілген. 4. Ұйымдастыра басқару (ұйым). Қолжетімді сапаны камтамасыз етуге ұмтыла отырып, жетекші тиімділік балансы мен жақсы моральдык күй табады. 5. Топтық басқару (команда). Атқарушылар саналы турде ұйым мақсаттарына тартылады. Жетекші бұған жумыс тиімділігінеде, карамағындағыларға да бір мезгілде тұрақты зейін аудару барысында кол жеткізеді. Бұл жетекшінің ең табысты стилі, өйткені адами жақсы қарым қатынас пен ұйымдық қызметтің жоғары нəтижелері қамтамасыз етіледі. Жағдайлық тəсіл. Бірқатар оқиғаларда осы косымша жагдайлык факторлар жетекшілік тиімділігінде басшылық рол атқарады. Бұл басқарымдық іс-əрекет сипаты: орындалатын тапсырмалар типі; жетекшінің қарамағындағылармен қарым -қатынасы, қарамағындағылардың есею денгейі; олардың үстем қажеттіліктері, сыртқы жэне ішкі ұйымдастыру ортасының жағдайлары, т б. нəтижесінде ерекше жағдайлық тəсіл рəсңмделеді, басқарудың белгілі бір жағдайларына əлдқайда сай келетін мінез-құлық пен сапа стильдерін таңдау онын мақсаты болып табылады. Ф.Фидлердің жетекшіліктің жағдайлық моделі жағдайлық тұжырымдамалар арасындағы ең танымал жəне жетілген түрі болып табылады. Белгілі бір жағдайда жетекшінің мінез-құлқына ең күшті ықпал ететін жəне бір мезгілде жағдайдың өзін сипаттайтын негізгі үш факторы бар: - жетекші мен қол астындағылар арасындағы қарым-қатынас; - мəселе құрылымы, онын параметрлері - тұжырымның нақтылығы мен айқындылығы, құрылымдануы, əдеттілігі жəне түсініктіліг; - өзіне жетекшіге тиесілі заңды биліктің нормативтік көлемін жəне оны қол астындағылардың нақты қолдау көрсету деңгейін қосып алатын, кызметтік өкілеттіктер. Ф.Фидлер жағдайлар қолайлылығының жалпы көрсеткіші болып табылатын «жағдайлык бақылау» уғымын ұсынады. Ф.Фидлердің зерттеулері нəтижесінде мынадай басты заңдылык айкындалды: əртүрлі</p>
<p>стильдегі жетекшілерде басқару ic-əpeкeтiнiң тиімділігі əртүрлі. Мəселеге бағдарланған жетекші ең қиын жəне ең жақсы жағдайларда ерекше табысты жұмыс істейді. Қарым -қатынасқа бағдарланған жетекші жағдайға бакылаудың дəрежесі орташа шарттарда табыстырақ жұмыс істейді. Жағдайлық тəсіл жетекшілік теориясына үлкен үлес қосты. Ол басқару стильдерінің əртүрлі баламалықты игерген жəне басқару іс -əрекетінің əртүрлі жағдайларында əртүрлі тиімділік беретінін дəлелдеді. Бейімділік тəсіл. Жетекшілік нақты басқару шарттары мен жағдайларға бейімделуі болуы керек. Жетекші стильдердің неғұрлым көбірек репертуарын игерсе, оның іс-əрекеті соғұрлым тиімдірек болады. Ф. Фидлер 1923 жылы Венада дүниеге келген. 1938 жылы Америкаға кетеді. Жас кезінде Ф. Фидлер жиырмаға жуық мамандықты, соның ішінде сатушы, автомеханик, қарызды өндіру жөніндегі уəкіл жəне бухгалтерді сынап, түрлі еңбек тəжірибесін алды. Содан кейін ол төрт жыл бойы армияда жеке қызмет етті, содан кейін оқуға оралды, үйленді жəне келесі төрт жыл ішінде Чикаго университетінің клиникалық психология магистрі жəне гуманитарлық ғылымдар докторы дəрежесін алды. Дəл осы кезеңде ол тұлғааралық қатынастардың кейбір аспектілеріне жəне олардың тиімділік критерийлерінің əртүрлі түрлерімен байланысына тұрақты қызығушылық танытты. 1951 жылы Ф.Фидлер Иллинойс университетіне шақырылды, онда ол Ли Кронбахпен бірге жұмыс істеді, содан кейін психология факультетіне ауысып, сол жерде топтық тиімділікті зерттеу зертханасын құрды. Осы кезеңде ол өзінің бұрынғы ғылыми қызығушылықтарын ұмытпады, мысалы, топ мүшелерінің топтың қызметімен қарым-қатынасы (топтың бірлігі) жəне көшбасшылық пен топтық орындаудың жеке бейімделуінің басқа да мəселелерін зерттеді. Зерттеу бағдарламасы «мəдени ассимиляторды» дамыту жəне қолдану процесінде туындайтын мəдениаралық байланыстарды талдаудан басталды – қатынастарды жақсартудың оқу бағдарламасы. 1969 жылдан бастап Вашингтон университетінде психология профессоры болды. 1992 жылы зейнетке шықты, бірақ негізінен басшыларды даярлау саласында белсенді ғылыми жұмысын жалғастыруда. Ф.Фидлердің жағдайлық басшылық моделі Фред Фидлердің тиімді көшбасшылық моделі, оны ситуациялық модель деп те атайды, бұл команданың тиімділігі көп жағдайда əр жеке жағдайдың көшбасшының өз қызметкерлеріне бақылауды жүзеге асыруына жəне олардың жұмысына əсер етуіне мүмкіндік беру дəрежесіне байланысты екендігіне негізделген. Бұл модельдің негізгі идеясы - əр түрлі көшбасшылық стильдер əр түрлі жағдайда тиімді болады. Осыған байланысты бірнеше көшбасшылық стильдер мен əртүрлі жағдайлар анықталды жəне осы екі компоненттің ең оңтайлы үйлесімдері жасалды.</p>
<p>Фидлер моделін толық түсіну үшін, ең алдымен, оның бірінші компоненті - көшбасшылық стильдерін қарастырған жөн. Фидлердің көшбасшылық стилі Фидлердің пікірінше, табысты басқарудың маңызды факторы - бұл əрбір жеке басшы ұстанатын негізгі стиль. Бұл стиль не тапсырмаға, не бағыныштылармен қарым-қатынасқа бағытталуы мүмкін. Сондай-ақ Фидлер моделінің тағы бір қызықты ерекшелігі бар екенін айту маңызды: ғалымның пікірінше, адам көшбасшылығының басым стилі өзгермеген, яғни, барлық жағдайда өзгеріссіз қалады. Қысқаша айтқанда, егер сіз көшбасшы ретінде қарым -қатынасқа негізделген көшбасшы болсаңыз, сіз бұл стильді кез-келген уақытта, кез-келген жерде ұстанасыз. Мұны тапсырмаға бағытталған көшбасшылық стилін ұстанатын адамдар үшін де айтуға болады. Көшбасшылық стилін анықтауға мүмкіндік болғаннан кейін ғана жағдайларды бағалауға көшіп, осы жағдайлардың маңыздылығын жəне олардың əсерін анықтауға тура келеді. Фидлерге арналған жағдайлар Фидлер көптеген зерттеулер жүргізді, оның нəтижесі көшбасшының жұмысына əсер ететін үш негізгі ситуациялық параметрді анықтау болды: Менеджер мен бағынушылар арасындағы өзара əрекеттесу түрі Тапсырманың құрылымы Басшының билік формасы жəне осы биліктің мөлшері Фидлердің теориясы тиімді басшылықты қамтамасыз етуге байланысты екі маңызды фактіні жасады: жағымды жəне жағымсыз жағдайда топтың жоғары өнімділігін қамтамасыз ететін міндеттерді орындауға бағдарланған басшы. Аралық жағдайда топтың жоғары өнімділігін қамтамасыз ететін қатынасқа бағдарланған басшы; басшының жұмыс тиімділігі жағдайдың жағымдылық деңгейіне, көшбасшылықтың стиліне байланысты. Фидлер моделі бойынша көшбасшылыққа қатысты барлық жағдайларды осы үш өлшемді, ситуациялық айнымалылар деп бағалау керек. Оларды біріктіру арқылы кез-келген көшбасшы өздерін таба алатын сегіз негізгі жағдай туындайды. Бұл жағдайлар менеджер үшін өте қолайлы, орташа қолайлы жəне өте қолайсыз деп жіктеледі. Фред Фидлер əр ситуациялық санаттағы көшбасшылық стильдерінің əрқайсысының нəтижелерін бір-бірімен салыстырды. Нəтижесінде ғалым көшбасшылық стилі тапсырмаға бағытталған басшылар өте қолайлы жəне өте қолайсыз жағдайларда, ал көшбасшылық стилі бағытталған көшбасшылар тиімді болатынын анықтады. Қарым -қатынас орташа қолайлы жағдайларда тиімді. Алайда кез -келген басшыға көшбасшылықтың тиімділігін арттыруға мүмкіндік бар. Көшбасшылық стилінің тиімділігін арттыру</p>
<p>Жоғарыда айтылғандай, Фидлер негізгі көшбасшылық стилі барлық жағдайда бірдей болып қалады деп сендірді. Осыған сүйене отырып, көшбасшы көшбасшылық тиімділігін екі жолмен ғана жақсарта алады. Біріншісі - жағдайға сəйкес келетін стильге ие жа ңа басшыны тағайындау. Мысалы, егер командадағы жағдай өте қолайлы деп бағаланса, бірақ команданы көшбасшылық стилі қарым -қатынасқа бағытталған көшбасшы басқаратын болса, тапсырмаға бағытталған көшбасшылық стилі бар басқа көшбасшыны басына отырғызу арқылы топтың жұмысын арттыра аласыз. Екінші əдіс - жағдайды берілген басшының стиліне сəйкес келетін етіп өзгерту. Сіз, мысалы, тапсырмалардың құрылымын өзгертуге немесе өзіңіздің өкілеттіктеріңіздің ауқымын кеңейтуге / қысқартуға болады. Менеджерлік сипаттамалар. Менеджерлік сипаттамалар индивидтің қабілеттер функциясы ретінде болатын, бірақ олар бола алмайтын қасиеттері болып табылады. Олардың негізгілері болатындар: 1. Жас ерекшелігі факторы. Жетекшінің жасы мен иерархиялық деңгейі арасында байланыс бар. Кəсіби тəжірибенің байлығы ересек жастың функциясы болып табылады. Карьералық жылжу жасқа пропорционал. Жас өскен сайын басқарудың өнімді əдістері күшейеді, ал репродуктивті (өнімсіз) əдістері керісінше болады. Жетекшілік стилі қатаңданады. Басқару іс-əрекетінің тиімділігі серпінінің жалпы ағымы - позитивті. 2. Жыныстық фактор. Басқарудың қазіргі кездегі психологиясы - бұл «ер-жетекшілер психологиясы», бірақ əйел -жетекші соңғы уақытта зерттеушілер зейінін көбірек тартуда, ерлер басқарудың бір мəселелерін, əйелдер екіншілерін жақсы шешеді, дегенмен, жалпы алғанда, ерлер басымдыққа ие. 3. Мəдени білім беру деңгейінің факторы басқару іс-əрекеті тиімділігімен тура позитивтік байланыста. 4. Əлеуметтік-экономикалық мəртебе факторы. Егер адам компанияға иелік ететін компанияда дүниеге келсе, бұл Ф. Фидлер атап көрсеткендей, оның президенті болу үшін ең сенімді тəсіл. Тиімді менеджердің сипаттамаларының екінші тобы – қабілеттер функциясында болатын тұлғалық сапалар Ол төмендегідей басты менеджерлік сапаларды қамтиды доминанттылық, өзіне деген сенімділік, эмоционалдық тұрақтылық, күйзеліске тұрақтылық, креативтілік, жетістіктерге ұмтылыс, кəсіпкерлік, жауапкершілік, сенімділік, тұлғаның тəуелсіздігі, ашықтық, социобелділік (тұлғааралық байланысты тұрғызу шеберлігі жəне ауқы мды əлеуметтік түйісулер орнату қажеттілігі). Бұл сапалар мен сипаттамалардың барлығы табысты басқару іс - əрекетін қамтамасыз ету үшін қажетті қабілеттердің бүкіл тізімін тауыса алмайды. Басқару теориясында осы сияқты тізімдер көп.</p>
<p>Зерттеулердің бірі менеджерлік сипаттамалардың келесі жиынтығын келтіреді: A. Мінез -құлықтың концептуалдық қабілеттері мен стандарттары. 1. Көзқарастар ауқымдылығы, аса ауқымды тəсіл. 2. Ұзақ мерзімді болжау, икемділік. 3. Қуаттылық, бастамашылық жəне шешімділік (соның ішінде тəуекелдік жағдайында). 4. Табанды жұмыс жəне тұрақты оқу, білім. Ə. Тұлғалық сапалар. 5. Мақсаттар мен бағдарды нақты тұжырымдау. 6. Өзге пікірді тыңдауға дайындық. 7. Менменсіздік, құмарсыздық, бейқамдық. 8. Қызметкерлерді дұрыс орналастыру, адал санкциялар. 9. Жеке бастың əдемілігі. 10. Ұжым жəне ондағы үйлесімді құру білу шеберлігі. 11. Денсаулық. Əр адам өз өмірінің қожайны болу басты шарт болып табылады. Сондықтан барлығымызға берілген 24 сағатты тиімді пайдалана отырып, өз мақсатымызға жетуге мүмкіндікттің зор еекенін ескеруіміз қажет. Жетістікке жету үшін əр адам табиғатын тану, қызығушылығы мен қажеттілігін тану жəне оны өз мүмкіндігін тиімді пайдалануға уақыт бөлу. Уақытты тиімді пайдалану маңызды болып табылады. Уақытты өз игілігіне жұмсау туралы көптеген психологтар өз ұсыныстарын көруімізге болады. Біз өз тарапымыздан Брайн Трейсидің тұжырымын ұсынғымыз келіп отыр. Б.Трейсиге беделді компанияның басшысы аз уақытта көп шаруа үшін тайм-менеджменттің жақсы бағдарламасын құруға тапсырыс береді. Сол тапсырысты орындау үшін Б.Трейси саралап ақпарат тану үшін 10 кітап оқиды, əлемдік масштабта өткен 6 семинарға қатысады, 10 аудиолекция тыңдайды, жəне осының барлығын саралап, бағдарлама құруға 1 жыл уақыт кетеді. Керемет жемісті бағдарламасымен тайм-менеджмент психологиясы туралы өз кітаптарында бөліседі. Оның айтуынша кез-келген адам тайм- менеджментті меңгере алады, барлық адамға бір тəулікте бірдей 24 сағат беріледі сол уақытты үнемді басқарып дағдылану үшін басты өз ұсыныстарын жазады: 1. Визуализация. Кез-келген адам өз уақытын басқара ал атындай өзіне сенімді болу. 2. Өз құндылықтарыңызды анықтап, айқын мақсат қою – маңызды. Он шақты маңызды шаруаның ішінен маңыздырағын таңдай білу одан маңыздысын таңдап алу. 3. Бастаған шаруаны аяғына дейін сəтті жеткізу – басты шарт! Себебі, əр шаруаны сəтті аяқталған шаруа адам көңіліне қуаныш, бақыт сезімін оятады. Ал бұл сезімдер адам миынан эндорфин гармонының бөлінуіне</p>
<p>себепші екені белгілі. Осыны сезінген адам көңілінде қажеттілік туындап, жаңа жетістіктерді бағындыруға ұмтылады жəне бұл адам миына энергия болып, өзіне сенімділігі артады. 4. Барлығын мұқият ойластырып, ойыңызды қағазға түсіріп отыруға дағдыланыңыз, жоспарыңызды қағаз бетіне түсіріп орындау. Күнделікті жоспарыңызды құрудан бастау. 5. Жоспарыңыз бойынша бағытыңызды өзгертпеу, мүммкіндігінше əрине. 6. Уақытыңызды блоктар бойынша ұйымдастырыңыз жəне телефонды қысқартып, үзілістердің орнымен болуын қадағалау. Себебі, демалыс мидың өнімді жұмысы үшін өте маңызды болып табылады. 7. Атқарылу керек шаруаларды топтастырыңыз. А,Б,С деп үш топқа топтастырып, сəйкесінше аса маңызды, маңызды, маңыздырақ деп жəне аса маңызды шаруалардан бастап атқару. 8. Тез оқып, көп есте сақтауға тырысыңыз жəне өз жеке қабілеттеріңіздің өсуі мен дамуына инвестиция жасап тұрыңыз. Бекіту сұрақтары: 1. Көшбасшылык пен ресми жетекшілік топ ic-əрекетіндегі айырмашылықтарды ажыратыңыз. 2. Көшбасшы тұжырымдамасының негізгі топтарын атаңыз, сипаттаңыз. 3. Ф.Фидлердің еңбегіне тоқталыңыз. 4. Мінез-құлықтың концептуалдық қабілеттері мен стандарттары мен тұлғалық сапаларды атаңыз.</p>`,rawText:`§ 8 Жетекшілік жəне көшбасшылық. Көшбасшы теориясының 
қағидалары 
 
Көшбасшылык пен ресми жетекшілік топ ic -əрекетіндегі 
айырмашылығы келесі жагдайлармен аныкталады:  
1. Лидер топтағы тұлғааралық катынастарды, ал басшы топтың ресми 
карым-катынасын əлеуметік ұйым ретінде реттейді;  
2 . Лидерлік – микроортаның элементі, басшылық – макроортаның 
элементі, өйткені ол қоғамдық катынастар жүйесімен байланысқан;  
3. Лидерлік - стихиялық процесс, ал басшылық мақсатты бағытталған, 
өйткені əлеуметтік  құрылым элементтерінің бақылауымен жүреді;  
4. Басшылық - тұрақты құбылыс, лидерді ұсыну топтың көңіл күйіне 
байланысты, сондықтан лидерлілік құбылысының тұрақтылығы төмендеу;  
5. Лидерлілікте жетекшілік игерген белгілі 6ip санкциялар жүйесі жоқ, 
ал басшылықта  белгіленген санкциялар жүйесі бар;  
6. Көшбасшы топтық ic -əрекетке тікелей катысты шешімдер 
кабылдайды, ал жетекшінің шешім қабылдау процесі көптеген, тіпті осы 
топка міндетті түрде топпен байланысы жоқ шешімдерді де қабылдауға 
мəжбүр;  
7. Жетекшінің  ic-əрекет саласы көшбасшыға  қарағанда аукымды, 
өйткені ол топты əлдеқайда кең əлеуметтік жуйеде ұсынады. 
Басқару іс əрекетінің биліктік реттеушілері «жетекші стилі» ұғымымен 
белгіленеді жəне де  қандай жеке сапалар адамға көшбасшы болуға 
көмектесетіні туралы сұрақтар - көшбасшылық теориясында 
қарастырылады. 
Көшбасшы тұжырымдамасының негізгі төрт тобы бар:  
• Сипаттар теориясы 
• Мінез құлықтық тəсіл 
• Жағдайлық тəсіл  
• Бейімді жетекшілік теориясы. 
Сипаттар теориясы. «ұлы адамдар теориясы» немесе 
«харизматикалық теория» ретінде белгіленетін тұлғалық сапалар тəсілі. 
Оның мəні тұлғалық сапалардың интеллект, жігер бастамашылық, 
сенімділік, қуаттылық, шешендік, т.с.с. белгілі бір жи ынтығын игерген 
адам ғана көшбасшы бола алатынында. Бұл сапа болашақта кажет бола 
отырып, адамды көшбасшы тұрғысына ұсыну үшін жеткілікті болып 
табылмайды. 
Мінез-құлықтық тəсіл. Бұл тəсіл басқару іс-əрекетінң тиімділігі, 
жетекшінің тек тұлғалық сапаларымен  ғана емес, оның 
қарамағындағыларға қатысты мінез-құлық стилімен де анықталады. 
Басқару теориясында осы тəсілдің арқасында «жетекшілік стилі» ұғымы 
жəне жалпы басқару стильдері пайда болды.  Бұл тэсіл көшбасшылық 

теориясында жетекші орын алады. Жағдайлык жəне бейімді тəсілдер оның 
жалғасы мен жетілуі болып дамыды. 
Бұл тəсілде жетекшіліктің бес стилі атап көрсетіледі. 
1. Бірлескен басқару (кедейліктен корку). Жетекші барынша аз күш 
жұмсайды жəне басқалардан да жұмыстың орындалу сапасы жұмыстан 
босатуды болдырмайтындай ғана дəрежеде болуын талап етеді. 
2. Қала сыртындағы клуб ретінде басқару (демалыс үйi). Жетекші 
қарамағындағылармен достық қарым-қатынасты ұсынады, тапсырманың ең 
тиімді орындалуына ұмтылмайды.  
3. Билік-бағыну (үстемдік ету). Жетекші ұйымдағы жақсы қарым 
қатынасты ұстап тұруға аз зейін аударады, ол  тиімді іс-əрекетпен 
қамтамасыз етуге толықтай берілген.  
4. Ұйымдастыра басқару (ұйым). Қолжетімді сапаны камтамасыз етуге 
ұмтыла отырып, жетекші тиімділік балансы мен жақсы моральдык күй 
табады.  
5. Топтық басқару (команда). Атқарушылар саналы турде ұйым 
мақсаттарына тартылады. Жетекші бұған жумыс тиімділігінеде, 
карамағындағыларға да бір мезгілде тұрақты зейін аудару барысында кол 
жеткізеді. Бұл жетекшінің  ең табысты стилі, өйткені адами жақсы қарым 
қатынас пен ұйымдық қызметтің  жоғары нəтижелері қамтамасыз етіледі. 
Жағдайлық тəсіл. Бірқатар оқиғаларда осы косымша жагдайлык 
факторлар жетекшілік тиімділігінде басшылық рол атқарады.  
Бұл басқарымдық іс-əрекет сипаты: орындалатын тапсырмалар типі; 
жетекшінің қарамағындағылармен қарым -қатынасы, 
қарамағындағылардың есею денгейі; олардың үстем қажеттіліктері, сыртқы 
жэне ішкі ұйымдастыру ортасының жағдайлары, т б. нəтижесінде ерекше 
жағдайлық тəсіл рəсңмделеді, басқарудың белгілі бір жағдайларына 
əлдқайда сай келетін мінез-құлық пен сапа стильдерін таңдау онын мақсаты 
болып табылады. 
Ф.Фидлердің жетекшіліктің жағдайлық моделі жағдайлық 
тұжырымдамалар арасындағы ең танымал жəне жетілген түрі болып 
табылады. Белгілі бір жағдайда жетекшінің мінез-құлқына ең күшті ықпал 
ететін жəне бір мезгілде жағдайдың өзін сипаттайтын негізгі үш факторы 
бар:  
- жетекші мен қол астындағылар арасындағы қарым-қатынас;  
- мəселе құрылымы, онын параметрлері - тұжырымның нақтылығы мен 
айқындылығы, құрылымдануы, əдеттілігі жəне түсініктіліг;  
- өзіне жетекшіге тиесілі заңды биліктің нормативтік көлемін жəне оны 
қол астындағылардың нақты қолдау көрсету деңгейін қосып алатын, 
кызметтік өкілеттіктер. 
Ф.Фидлер жағдайлар қолайлылығының жалпы көрсеткіші болып 
табылатын «жағдайлык бақылау» уғымын ұсынады. Ф.Фидлердің 
зерттеулері нəтижесінде мынадай басты заңдылык айкындалды: əртүрлі 

стильдегі  жетекшілерде басқару ic-əpeкeтiнiң тиімділігі əртүрлі. Мəселеге 
бағдарланған жетекші ең қиын жəне ең жақсы жағдайларда ерекше табысты 
жұмыс істейді. Қарым -қатынасқа бағдарланған жетекші жағдайға 
бакылаудың дəрежесі орташа шарттарда табыстырақ жұмыс істейді.  
Жағдайлық тəсіл жетекшілік теориясына үлкен үлес қосты. Ол басқару 
стильдерінің əртүрлі баламалықты игерген жəне басқару іс -əрекетінің 
əртүрлі жағдайларында əртүрлі тиімділік беретінін дəлелдеді. 
Бейімділік тəсіл. Жетекшілік нақты басқару шарттары мен 
жағдайларға бейімделуі болуы керек. Жетекші стильдердің неғұрлым 
көбірек репертуарын игерсе, оның іс-əрекеті соғұрлым тиімдірек болады. 
Ф. Фидлер 1923 жылы Венада дүниеге келген. 1938 жылы Америкаға 
кетеді. 
Жас кезінде Ф. Фидлер жиырмаға жуық мамандықты, соның ішінде 
сатушы, автомеханик, қарызды өндіру жөніндегі уəкіл жəне бухгалтерді 
сынап, түрлі еңбек тəжірибесін алды. Содан кейін ол төрт жыл бойы 
армияда жеке қызмет етті, содан кейін оқуға оралды, үйленді жəне келесі 
төрт жыл ішінде Чикаго университетінің клиникалық психология магистрі 
жəне гуманитарлық ғылымдар докторы дəрежесін алды. Дəл осы кезеңде ол 
тұлғааралық қатынастардың кейбір аспектілеріне жəне олардың тиімділік 
критерийлерінің əртүрлі түрлерімен байланысына тұрақты қызығушылық 
танытты. 
1951 жылы Ф.Фидлер Иллинойс университетіне шақырылды, онда ол 
Ли Кронбахпен бірге жұмыс істеді, содан кейін психология факультетіне 
ауысып, сол жерде топтық тиімділікті зерттеу зертханасын құрды. Осы 
кезеңде ол өзінің бұрынғы ғылыми қызығушылықтарын ұмытпады, 
мысалы, топ мүшелерінің топтың қызметімен қарым-қатынасы (топтың 
бірлігі) жəне көшбасшылық пен топтық орындаудың жеке бейімделуінің 
басқа да мəселелерін зерттеді. Зерттеу бағдарламасы «мəдени 
ассимиляторды» дамыту жəне қолдану процесінде туындайтын 
мəдениаралық байланыстарды талдаудан басталды – қатынастарды 
жақсартудың оқу бағдарламасы. 1969 жылдан бастап Вашингтон 
университетінде психология профессоры болды. 1992 жылы зейнетке 
шықты, бірақ негізінен басшыларды даярлау саласында белсенді ғылыми 
жұмысын жалғастыруда. 
Ф.Фидлердің жағдайлық басшылық моделі 
Фред Фидлердің тиімді көшбасшылық моделі, оны ситуациялық 
модель деп те атайды, бұл команданың тиімділігі көп жағдайда əр жеке 
жағдайдың көшбасшының өз қызметкерлеріне бақылауды жүзеге асыруына 
жəне олардың жұмысына əсер етуіне мүмкіндік беру дəрежесіне 
байланысты екендігіне негізделген. Бұл модельдің негізгі идеясы - əр түрлі 
көшбасшылық стильдер əр түрлі жағдайда тиімді болады. Осыған 
байланысты бірнеше көшбасшылық стильдер мен əртүрлі жағдайлар 
анықталды жəне осы екі компоненттің ең оңтайлы үйлесімдері жасалды. 

Фидлер моделін толық түсіну үшін, ең алдымен, оның бірінші компоненті - 
көшбасшылық стильдерін қарастырған жөн. 
Фидлердің көшбасшылық стилі 
Фидлердің пікірінше, табысты басқарудың маңызды факторы - бұл 
əрбір жеке басшы ұстанатын негізгі стиль. Бұл стиль не тапсырмаға, не 
бағыныштылармен қарым-қатынасқа бағытталуы мүмкін. 
Сондай-ақ Фидлер моделінің тағы бір қызықты ерекшелігі бар екенін 
айту маңызды: ғалымның пікірінше, адам көшбасшылығының басым стилі 
өзгермеген, яғни, барлық жағдайда өзгеріссіз қалады. Қысқаша айтқанда, 
егер сіз көшбасшы ретінде қарым -қатынасқа негізделген көшбасшы 
болсаңыз, сіз бұл стильді кез-келген уақытта, кез-келген жерде ұстанасыз. 
Мұны тапсырмаға бағытталған көшбасшылық стилін ұстанатын адамдар 
үшін де айтуға болады. 
Көшбасшылық стилін анықтауға мүмкіндік болғаннан кейін ғана 
жағдайларды бағалауға көшіп, осы жағдайлардың маңыздылығын жəне 
олардың əсерін анықтауға тура келеді. 
Фидлерге арналған жағдайлар 
Фидлер көптеген зерттеулер жүргізді, оның нəтижесі көшбасшының 
жұмысына əсер ететін үш негізгі ситуациялық параметрді анықтау болды: 
Менеджер мен бағынушылар арасындағы өзара əрекеттесу түрі 
Тапсырманың құрылымы 
Басшының билік формасы жəне осы биліктің мөлшері 
Фидлердің теориясы тиімді басшылықты қамтамасыз етуге 
байланысты екі маңызды фактіні жасады: жағымды жəне жағымсыз 
жағдайда топтың жоғары өнімділігін қамтамасыз ететін міндеттерді 
орындауға бағдарланған басшы. Аралық жағдайда топтың жоғары 
өнімділігін қамтамасыз ететін қатынасқа бағдарланған басшы;  басшының 
жұмыс тиімділігі жағдайдың жағымдылық деңгейіне, көшбасшылықтың 
стиліне байланысты. 
Фидлер моделі бойынша көшбасшылыққа қатысты барлық 
жағдайларды осы үш өлшемді, ситуациялық айнымалылар деп бағалау 
керек. Оларды біріктіру арқылы кез-келген көшбасшы өздерін таба алатын 
сегіз негізгі жағдай туындайды. Бұл жағдайлар менеджер үшін өте 
қолайлы, орташа қолайлы жəне өте қолайсыз деп жіктеледі.  
Фред Фидлер əр ситуациялық санаттағы көшбасшылық стильдерінің 
əрқайсысының нəтижелерін бір-бірімен салыстырды. Нəтижесінде ғалым 
көшбасшылық стилі тапсырмаға бағытталған басшылар өте қолайлы жəне 
өте қолайсыз жағдайларда, ал көшбасшылық стилі бағытталған 
көшбасшылар тиімді болатынын анықтады. Қарым -қатынас орташа 
қолайлы жағдайларда тиімді. Алайда кез -келген басшыға 
көшбасшылықтың тиімділігін арттыруға мүмкіндік бар. 
Көшбасшылық стилінің тиімділігін арттыру 

Жоғарыда айтылғандай, Фидлер негізгі көшбасшылық стилі барлық 
жағдайда бірдей болып қалады деп сендірді. Осыған сүйене отырып, 
көшбасшы көшбасшылық тиімділігін екі жолмен ғана жақсарта алады. 
Біріншісі - жағдайға сəйкес келетін стильге ие жа ңа басшыны 
тағайындау. Мысалы, егер командадағы жағдай өте қолайлы деп бағаланса, 
бірақ команданы көшбасшылық стилі қарым -қатынасқа бағытталған 
көшбасшы басқаратын болса, тапсырмаға бағытталған көшбасшылық стилі 
бар басқа көшбасшыны басына отырғызу арқылы топтың жұмысын арттыра 
аласыз. 
Екінші əдіс - жағдайды берілген басшының стиліне сəйкес келетін етіп 
өзгерту. Сіз, мысалы, тапсырмалардың құрылымын өзгертуге немесе 
өзіңіздің өкілеттіктеріңіздің ауқымын кеңейтуге / қысқартуға болады. 
Менеджерлік сипаттамалар. 
Менеджерлік сипаттамалар индивидтің қабілеттер функциясы ретінде 
болатын, бірақ олар бола алмайтын қасиеттері болып табылады. Олардың 
негізгілері болатындар: 
1. Жас ерекшелігі факторы. Жетекшінің жасы мен иерархиялық 
деңгейі арасында байланыс бар. Кəсіби тəжірибенің байлығы ересек жастың 
функциясы болып табылады. Карьералық жылжу жасқа пропорционал. Жас 
өскен сайын басқарудың өнімді əдістері күшейеді, ал репродуктивті 
(өнімсіз) əдістері керісінше болады. Жетекшілік стилі қатаңданады. 
Басқару іс-əрекетінің тиімділігі серпінінің жалпы ағымы - позитивті. 
2. Жыныстық фактор. Басқарудың қазіргі кездегі психологиясы - бұл 
«ер-жетекшілер психологиясы», бірақ əйел -жетекші соңғы уақытта 
зерттеушілер зейінін көбірек тартуда, ерлер басқарудың бір мəселелерін, 
əйелдер екіншілерін жақсы шешеді, дегенмен, жалпы алғанда, ерлер 
басымдыққа ие. 
3. Мəдени білім беру деңгейінің факторы  басқару іс-əрекеті 
тиімділігімен тура позитивтік байланыста. 
4. Əлеуметтік-экономикалық мəртебе факторы.  Егер адам 
компанияға иелік ететін компанияда дүниеге келсе, бұл Ф. Фидлер атап 
көрсеткендей, оның президенті болу үшін ең сенімді тəсіл. 
Тиімді менеджердің сипаттамаларының екінші тобы – қабілеттер 
функциясында болатын тұлғалық сапалар 
Ол төмендегідей басты менеджерлік сапаларды қамтиды 
доминанттылық, өзіне деген сенімділік, эмоционалдық тұрақтылық, 
күйзеліске тұрақтылық, креативтілік, жетістіктерге ұмтылыс, кəсіпкерлік, 
жауапкершілік, сенімділік, тұлғаның тəуелсіздігі, ашықтық, социобелділік 
(тұлғааралық байланысты тұрғызу шеберлігі жəне ауқы мды əлеуметтік 
түйісулер орнату қажеттілігі). 
Бұл сапалар мен сипаттамалардың барлығы табысты басқару іс -
əрекетін қамтамасыз ету үшін қажетті қабілеттердің бүкіл тізімін тауыса 
алмайды. Басқару теориясында осы сияқты тізімдер көп.  

Зерттеулердің бірі менеджерлік сипаттамалардың келесі жиынтығын 
келтіреді: 
A. Мінез -құлықтың концептуалдық қабілеттері мен 
стандарттары. 
1. Көзқарастар ауқымдылығы, аса ауқымды тəсіл. 
2. Ұзақ мерзімді болжау, икемділік. 
3. Қуаттылық, бастамашылық жəне шешімділік (соның ішінде 
тəуекелдік жағдайында). 
4. Табанды жұмыс жəне тұрақты оқу, білім. 
Ə. Тұлғалық сапалар. 
5. Мақсаттар мен бағдарды нақты тұжырымдау. 
6. Өзге пікірді тыңдауға дайындық. 
7. Менменсіздік, құмарсыздық, бейқамдық. 
8. Қызметкерлерді дұрыс орналастыру, адал санкциялар. 
9. Жеке бастың əдемілігі. 
10. Ұжым жəне ондағы үйлесімді құру білу шеберлігі. 
11. Денсаулық. 
Əр адам өз өмірінің қожайны болу басты шарт болып табылады. 
Сондықтан барлығымызға берілген 24 сағатты тиімді пайдалана отырып, өз 
мақсатымызға жетуге мүмкіндікттің зор еекенін ескеруіміз қажет.  
Жетістікке жету үшін əр адам табиғатын тану, қызығушылығы мен 
қажеттілігін тану жəне оны өз мүмкіндігін тиімді пайдалануға уақыт бөлу. 
Уақытты тиімді пайдалану маңызды болып табылады. Уақытты өз игілігіне 
жұмсау туралы көптеген психологтар өз ұсыныстарын көруімізге болады. 
Біз өз тарапымыздан Брайн Трейсидің тұжырымын ұсынғымыз келіп отыр. 
Б.Трейсиге беделді компанияның басшысы аз уақытта көп шаруа үшін 
тайм-менеджменттің жақсы бағдарламасын құруға тапсырыс береді. Сол 
тапсырысты орындау үшін Б.Трейси саралап ақпарат тану үшін 10 кітап 
оқиды, əлемдік масштабта өткен 6 семинарға қатысады, 10 аудиолекция 
тыңдайды, жəне осының барлығын саралап, бағдарлама құруға 1 жыл уақыт 
кетеді. Керемет жемісті бағдарламасымен тайм-менеджмент психологиясы 
туралы өз кітаптарында бөліседі. Оның айтуынша кез-келген адам тайм-
менеджментті меңгере алады, барлық адамға бір тəулікте бірдей 24 сағат 
беріледі сол уақытты үнемді басқарып дағдылану үшін басты өз 
ұсыныстарын жазады: 
1. Визуализация. Кез-келген адам өз уақытын басқара ал атындай 
өзіне сенімді болу. 
2. Өз құндылықтарыңызды анықтап, айқын мақсат қою – маңызды. 
Он шақты маңызды шаруаның ішінен маңыздырағын таңдай білу одан 
маңыздысын таңдап алу. 
3. Бастаған шаруаны аяғына дейін сəтті жеткізу – басты шарт! Себебі, 
əр шаруаны сəтті аяқталған шаруа адам көңіліне қуаныш, бақыт сезімін 
оятады. Ал бұл сезімдер адам миынан эндорфин гармонының бөлінуіне 

себепші екені белгілі. Осыны сезінген адам көңілінде қажеттілік туындап, 
жаңа жетістіктерді бағындыруға ұмтылады жəне бұл адам миына энергия 
болып, өзіне сенімділігі артады.  
4. Барлығын мұқият ойластырып, ойыңызды қағазға түсіріп отыруға 
дағдыланыңыз, жоспарыңызды қағаз бетіне түсіріп орындау. Күнделікті 
жоспарыңызды құрудан бастау. 
5. Жоспарыңыз бойынша бағытыңызды өзгертпеу, мүммкіндігінше 
əрине. 
6. Уақытыңызды блоктар бойынша ұйымдастырыңыз жəне 
телефонды қысқартып, үзілістердің орнымен болуын қадағалау. Себебі, 
демалыс мидың өнімді жұмысы үшін өте маңызды болып табылады. 
7. Атқарылу керек шаруаларды топтастырыңыз. А,Б,С деп үш топқа 
топтастырып, сəйкесінше аса маңызды, маңызды, маңыздырақ деп жəне аса 
маңызды шаруалардан бастап атқару.  
8. Тез оқып, көп есте сақтауға тырысыңыз жəне өз жеке 
қабілеттеріңіздің  өсуі мен дамуына инвестиция жасап тұрыңыз.  
Бекіту сұрақтары: 
1. Көшбасшылык пен ресми жетекшілік топ ic-əрекетіндегі 
айырмашылықтарды ажыратыңыз. 
2. Көшбасшы тұжырымдамасының негізгі топтарын атаңыз, 
сипаттаңыз. 
3. Ф.Фидлердің еңбегіне тоқталыңыз. 
4. Мінез-құлықтың концептуалдық қабілеттері мен стандарттары мен 
тұлғалық сапаларды атаңыз. 
 

`},{id:"lecture-9",category:"lecture",shortTitle:"9-дәріс",title:"§ 9 Басқару шешімдерін қабылдау процесінің жалпы сипаттамасы",pdfFile:"./assets/docs/9sabak.pdf",numPages:16,textHtml:`<h3 class="chapter-subheading">§ 9 Басқару шешімдерін қабылдау процесінің жалпы сипаттамасы Басқару қызметі процесінде шешім қабылдау ең қиын мəселе. Шешім қабылдау басқару процесінің міндетті, қажетті бөлігі. Басшының кез келген əрекеті іс жүзінде белгілі бір шешім қабылдаудан басталады. Кəсіпорынның жəне ондағы бөлімшелер қызметінің нəтижесі басшының дер кезінде шешімді дұрыс қабылдау қабілетіне, əрі оны жүзеге асыра білуіне, ал оның жеделдігі мен дұрыстығы басшының тəжірибесі мен біліміне байланысты. Егер ол өндірісті, технологияны жəне адамдард ы жақсы білетін болса, жұмыс тəжірибесі мол болса, онда оған шешім қабылдау қиынға түспейді. Қабылданған шешім бүкіл ұжымның экономикалық жəне əлеуметтік нəтижелеріне, əрбір жұмыскерге қолайлы немесе қолайсыз əсер етуі мүмкін. Сондықтанда шешім қабылдаған адам өзіне үлкен жауапкершілік жүктейді. «Басқару шешімі» термині екі негізгі мəнде қолданылады. Бірінші жағдайда ол белгіленген басқару актісін, қабылдаған іс-əрекет жоспарын, қаулы-қатарларды, т.б.; екінші жағдайда- мəселелер мен міндеттер шешімін қабылдаудың жəне жүзеге асырудың ең қолайлы нұсқасын білдіреді. Басқару шешімінің ең маңызды белгісі - өндіріс немесе басқару жүйесінің өзі болып саналады. Шешім туындаған мəселе болған жағдайда қабылданады. Мəселе дегеніміз- жүйенің қажетті жəне қолданылып жүрге н қалпының арасындағы сипатталатын жағдай. Басқару шешімін қабылдауға жүйелік тұрғыдан қараудың, пайда болған мəселелерді шешудің жүйелігін сақтаудың зор маңызы бар. Əрбір жаңа шешім алдыңғы шешімдерді өрістету үшін қабылдануы өрістік міндеттерді кезең-кезеңімен орындауды қамтамасыз етуі тиіс. Басқару шешімінің маңызды талабы- соңылылығы. Күрделі өндірістік жағдайда, əсіресе жұмыстың қауырт кезінде, егер барлық факторларды ескеруге көп уақыт кететін болса, онда шешім қабылдауды қысқартып, жұмыстың орындалуына кедергі жасамау керек. Басқару шешімінің маңызды талаптарының бірі- мақсаткерлік. Шешім ұжымның мақсатын, басты міндеттерін білдіреді, кез келген жұмысты тікелей орындаушыларға берілетін тапсырмаларды айқындайды. Ірі шаруашылық шешімдері бірнеше мақсатты айқындайды. Кез-келген шешім ауызша немесе жазбаша түрде қабылданса да, дəл нақты, айқын, дəлелді болуы тиіс. Шешімде тапсырманың мəні, оның көлемі, мерзімі, жүзеге асыру əдісі, орындауға жауаптылар көрсетілуі тиіс. Шешім қабылдау барлық психологтармен дерлік басқарудың орталық сəті болып мойындалады. Сондықтан да осы критерий бойынша еңбек процесіндегі басты ролдер анықталады: басшының жəне бағынушының. Шешімді жоспарлауда (іздеу мен шешім қабылдау процессінде, сонымен</h3>
<p>қатар мақсаттарды, міндеттерді жəне оларға қол жеткізу құралдарын анықтау), ұйымдастыруда (шешім, əртүрлі ресурстар түрінің бірігуіне жəне адамдардың ортақ іс-əрекетіне бағытталған), мотивацияларды басқаруда, бақылауда жəне т.б. көрініс табады. Шешім қабылдау — бұл мəселені түсінуді, адекватты мақсаттарды бекіту жəне осы мақсатты іске асыру үшін құралдарды таңдауды болжайтын күрделі ой процессі. Өкінішке орай, айтылған бұл процесс сыртқы орта жағдайлары мен жоға рғы басшылардың қысымының салдарынан жиі жағдайда стихиалы түрде жүреді. Сондықтан да оның іске асырылуы күрделі жүреді. Профессор Л.Зайверт, уақытты рационалды қолдану неміс институтының жетекшісі көптеген менеджерлер келесілерді дұрыс көреді дейді: • дұрыс жұмыстар жасағанның орнына дұрыс жұмыс жасау; • шығармашылық альтернатива жасағанның орнына мəселелерді шешу; • қолданған құралдарды оптимизациялаудың орнына құралдарды жинақтау; • нəтижелерге қол жеткізгеннің орнына міндеттерді атқару; • пайданы арттырудың орнына шығындарды азайту. Бұлардың барлығы — дұрыс шешім қабылдамаудың нəтижесі. Дұрыс шешім қабылдамау неге мүмкін болады? Жəне – осы сынды басқарудағы есептен жаңылыс ықтималдылығын қалай төмендетуга болады? Бұны түсіну үшін, адамдардың психологиялық ерешеліктеріне көңіл аудару керек, яғни осы əрекет қандай психологиялық ерекшеліктің арқасында жүзеге асты. Шешім қабылдауда адамның білімі, қызығушылығы, дүниетанымы көрініс табады жəне бір адамның ғана емес. Бұл процесстің маңызды ерекшелігін адамдар мен жағдайларға қарсы тұра алатын, күрделі, өзгермелі жағдайларда белгіленген мақсатты іске асыруды қолдап отыратын адамның еріктік мінезі құрайды. Бұл процесс қысқа уақыт аралығында басшыға көптеген əртүрлі бағыттағы шешімдерді қабылдауға тура келетінімен күрделенеді. Шешім қабылдауды əр түрлі негіздер бойынша классификациялау қабылданған: - Қамту аймағы бойынша (ортақ жəне жеке); - Əрекет уақыты бойынша жəне болашақ шешімге əсер ету дəрежесі бойынша (жылдам, тактикалық жəне стратегиялық); - Функционалды белгілері бойынша (шешім, жоспарлауды, ұйымдастыруды, мотивацияны, бақылауды шыңдауға арналған); - Мазмұны бойынша (политикалық, техникалық, технологиялық); - Жаңалық дəреже бойынша (екішілдікке негізделген, стандартты, шығармашылық, бірегей);</p>
<p>- Шешім қабылдау шешетін мəселенің анықтылық дəрежесіне байланысты (шешім, анықтылық шарттарында, тəуекел шарттарында қабылданған); - Тұлғаның интелектуалы немесе эмоционалды-еріктік сферасына бағытталуы бойынша (интеллектуалды, еріктік, эмоционалды). Интуитівті шешім «жақтаушы» мен «қарсы» анализінсіз шешімнің дұрыстығын сезу негізінде қабылданады. Интуитівті шешімнің үлесі жұмысқа жаңа қызметкерді қабылдауда жоғары: бұл жерде үміткердің дайындығы ғана емес, тəжірибесі жəне талаптарға сай келу де маңызды, Прагматикалық бағдарланған шешім, бұл білімге, жинақталған тəжірибеге негізделген таңдау. Ең алдымен, мұндай тəсіл технологиялық шешімге сипатты. Рационалды шешім өткен тəжірибеге байланысты емес, ол аналитикалық шешімге негізделген. Мұндай көзқарас стратегиялық шешімдерде анықтаушы болуы керек. Шындығында шешім қабылдау процесі кезінде барлық үш тəсіл де күшіне енеді, оның біреуі басым болып табылады. Сонымен қатар, басшы əр түрлі жағдайларда əр қилы əрекет етеді. Шешім қабылдауда тиісті анализ жүргізу үшін əрқашан толық ақпарат бола бермейді. Мұндай кезде істің барысына интуиция, сезім енеді, тіпті оған рационалды түсіндірулер болмаса да оқиғаның дұрыс жүрісін ойға салады. Мысалы, адам патенциалды серіктесімен қандайда бір келісімшартқа отырар алдында бір нəрсенің дұрыс еместігін сезеді, соның əсерінен келісім шартқа отырмауы мүмкін. Ал технологиялық шешім қабылдау процессі білім мен тəжірибеге негізделген, бірақ мұнда да интуитивті шешімге орын бар. Стратегиялық таңдау рационалды тəсілді талап етеді. Ол шешім қабылдаушы адамның мотивациясы мен дұрыс ойына сүйенеді. Шешім қабылдау жұмысы аз дегенде үш негізгі құраушыдан тұрады: • Тұлғалық (нақты топтың қызығушылығын ескере отырып, шешім қабылдаушы басшының мақсаттары мен ұйым мақсаттарын салыстыру); • Рəсімдік (нақты мəселелердің ағымды жағдайын анықтау, алда болатын өзгерістер дəрежесін анықтау, сонымен қатар олардың қарым - қатынасының үзілуін жеңіп шығатын іс-шара ұйымдастыру); • Технологиялық (нəтиже мен оның көрсеткішін анықтау, тəуекелге баруды болжау, ресурстарды іздеу жəне т.б.) Стратегиялық шешім қабылдау кезінде қоғамға арналған миссияның қалыптасуын көрсететін интегративті құраушыны ескеру қажет. Басшы сонымен қатар оптималды шешімді іздеу барысында коллективті де бұл іске тартуы мүмкін. М ұндай жағдайда əр түрлі жақтардың өзара əрекет етуі шешім қабылдаудың тиімділін жоғарылатады, ұйымшылдық артып, əлеуметтік-психологиялық климат жақсарады, еңбек процесі нəтижесіндегі тұлғаның өз еңбегіне қанағаттануы күшейеді, сонымен қатар қабылданған шешімге жауапкершілік бөлінеді. Көптеген</p>
<p>психологтар соның ішінде К.Левин, топтық шешім қабылдау процессі анағұрлым тиімді деп есептейді. Қазіргі уақытта басқару шешімдерін өңдеу тəсілдерінің көптеген түрлері жинақталған. Əртүрлі белгілер негіз болған 3.Янчан, М.Естрон, Г.Добров, В.Глюминский ұсынған шешім қабылдау тəсілдерінің классификациясы белгілі. Тəсілдердің үш класын В.Лисичкин атап көрсетті: 1. Жалпығылымдық ( логистикалық жəне эвристикалық сипаттағы тəсілдер – бақылау, тəжірибе, анализ, синтез, индукция, дедукция, экспертті бағалар, ойдың ұжымдық генерациясы); 2. Интерғылыми ( барлыған жалпылайтын сипатқа ие емес тəсілдер, бірақ əртүрлі іс-əрекет сфера объектілерінің кең шеңберінде қолданылады: математикалық статистика, моделдеу жəне т.б.); 3. Жеке (бір объектіге немесе білім саласына тəн тəсілдер). Көптеген ғалымдар сонымен қатар шешім қабылдауда қолданылған тəсілдерді қолданған аппараттың қалыптасу белгілерене қарай үш топқа бөледі: 1. Формальды тəсілдер (статистикалық, экономико-математикалық, сонымен қатар экономико-математикалық моделдер); 2. Эвристикалық тəсілдер ( аналогиялық жəне имитационды моделдеу тəсілдері); 3. Экспертті баға тəсілдері ( қазіргі уақытта кең қолданылатын тəсілдердің қатарына енеді). Күрделі объектілерді зерттеу барысында экспертті бағалар шартты анализ құралы немесе басқа тəсілдермен сəйкестендірілетін жеке дара тəсіл ретінде есептеледі. Шешім қабылдау процессін қалай жүзеге асыру қажет - бұл менеджменттің міндеті. Басқару психологиясы бұл процесстің ішкі шарттарын ашуға, шешім қабылдаудың субъективті негізін ашуға ұмтылады. Ең алдымен, шешім қабылдау барлық психикалық функциялардың ( қарапайым сезім сияқты функциялардан бастап жоғарғы қабылдау, ес, ойлау, қиялдау функцияларына дейін) көмегімен жүзеге асады. Берілген тарауды ой процессінің бір аспектісін ғана анализдейміз – ойлау мəселенің шешімі ретінде. Айта кететіні, шешім қабылдау процессі психологиялық механизмдерге негізделуіне қарамастан ол анағұрлым күрделі процесс болып табылады. К.К.Платонов ұсынған шешім қабылдау сызбасын қарастырайық. Этаптары сызбада көрсетілген кез келген ой əрекеті, қандай да бір мəселенің туындауынан пайда болад ы. Мəселені шешуді ой əрекеті аяқтайды. Дегенмен, табылған шешім жаңа ой əрекетінің немесе күрделі, ұзақ ойлау процессінің бастауы болатын жаңа сұрақтарды туындатуы мүмкін. Қалыпты жағдайдағы адамның психикасы үшін мəселені шешу білім, біліктілік жəне тəжірибеге байланысты.</p>
<p>Бірақ В.А.Розанованың көрсетуі бойынша басқару міндеттері өзіне тəн сипаттарға ие: 1.Міндеттер анықталмаған, кей жағдайларда қарама-қарсы сипатта болуы мүмкін; 2.Міндеттерде оны шешуге мүмкін болатын құралдар туралы ақпарат жеткілікті түрде болмауы; 3.Міндетті шешуде оған сəкес нақты шешім алгоритмінің болмауы; 4.Міндеттер жиі уақыт тапшылығы шартында шешіледі. Американдық психологтар В.Врум жəне Ф.Йеттен шешім қабылдау кезіндегі басшының мінез-құлқына əсер ететін негізгі алты факторды бөліп көрсетті: 1.Басшы тұлғасының индивидуалды-психологиялық ерекшеліктері (темперамент, міндет, қабілеттер), өмірлік тəжірибе, құндылықтарға бағытталуы. 2.Шешімнің құрылымы, мəселенің құрылымдық дəрежесі. 3.Индивидуалды шектеулер. Мынандай жағдайлар кездеседі, егер басқарушыға қызметкерлер білмейтін қосымша ақпаратты басқа жақтан іздестіру қажет болатын. Басқарушы бұл ақпараттың қаншалықты керектігін жəне ол ақпаратты алу қажет па жок па соны шешуі тиіс. 4.Шешім қабылдау ортасы, яғни шешімдер анықталған, тəуекел немесе анықталмаған жағдайларда қабылданып жатыр ма. Шешім қабылдаудың уақыты да маңызды. 5.Шешімдердің өзара байланысы. Ұйымдастыруда қандайда бір амалмен шешімдер өзара байланысты болады. Біріңғай маңызды шешім қабылдау көптеген ұсақ шешімдерді қабылдауды талап етуі мүмкін. 6.Бағынушылардың қабылданған шешімге қарым-қатынасы. Бұнда ұжымның дайындық дəрежесі, оның кəсіби біліктілігі, əлеуметтік - психологиялық климат, бағынушылардың мотивациясы, қабылданған шешімге қатысты келіспеушіліктер ықтималдылығы маңызға ие. Осы айтылғандарға мыналарды қоса кетуге болады, жиі жағдайда қандайда бір шешім нақты бір адамның тағдырына əсер етуі мүмкін. Мысалы, жұмыстан шығару, мадақтау немесе басқа қызметке, басқа топқа ауыстыру жəне т.б. Сондықтан осыны ескере келіп басшыдан белгілі бір шешімді күтетін бағынушылар оған белсенді əсер етулері мүмкін. Н.И.Кабушкиннің айтуы бойынша тұлға, теңіздегі тамшы сияқты, өзінің шешімінде бейнеленеді. Осы мағынада белгілі бір қызығушылық басқарушылық шешімдегі тұлғаның профилін ұсынады, яғни басшының индивидуалды ерекшеліктерінің бірлестігін. Оның көрсетуінше ғылымда келесідей шешімнің тұлғалық профильдері бар: 1. Байсалды типтегі шешімдер – мəселеге шарттар мен міндеттердің алдын ала анализ нəтижесінен қалыптасқан қорытынды ойымен кірісетін адамдарға тəн. Шешім қабылдаудың мұндай тəсілі нəтижелі болып табылады.</p>
<p>2. Импульсивті шешімдер – гипотезаны құру процесінен оның анализі басым болатын адамдарға тəн. Тиісінше мұндай адам ойларды жеңіл тудырады, олардың бағасы туралы аз ойланады. Сондықтан шешім қабылдау процессі негіздеуді жəне тексеруді секірмелі түрде өтіп кетіп отырады. 3. Инертті шешімдер – өте сенімсіз жəне абайлықпен іздеу нəтижесі болып табылады. Қажетті гипотеза ұсынылған соң оның нақтылануы өте баяу жүреді. Басшы жеке гипотезаларды, өзінің əр қадамын бірнеше қайтара өте сыншылдықпен қарастырады. Бұл шешім қабылдау процессін ұзаққа созады. 4. Тəуекелді шешімдер – импульсивті шешімдерді еске салады, бірақ, кейбір индивидуалды тактика ерекшеліктеріме н өзгешеленеді. Егер импульсивті шешімдер гипотезаны негіздеуде этаптардан секіріп өтіп кететін болса, ал тəуекелді шешімдер оларды секіріп өтпейді, бірақ адам іс- əрекетті жүзеге асыру үшін қажетті жəне бар шарттардың арасында үйлеспеушілік анықталған соң ғана бағалауға келеді. Нəтижесінде, кешігіп болса да гипотезаны құрастыру элементтері жəне оларды тексеру теңестіріледі. 5. Абайлылық сипатындағы шешімдер – гипотезаны тыңғылықты бағалаумен сипатталады, оның анализіне өте сыншылдықпен қарайды. Басшы, ең алдымен қорытындыға келмес бұрын, көптеген дайындық əрекеттерін жүргізеді. Абайлылықпен əрекет ететін адамдарды жетістік қуандырғанның орнына қателіктер қорқытады. Сондықтан абайлылық пен əрекетет етін адамдардың тактикасы - қателіктерді болдырмау. Шешім қабылдау жолында жиі жағдайда белгілі бір психологиялық сипаттағы кедергілер туындап отырады. Оларды білмеу елеулі қателіктерге алып келеді, кеселге ұшырататын салмақты шығындарға ұшыратуы мүмкін. Р.И.Мокшанцев келесідей кедергілер мен шектеулерді сипаттайды: 1.Асығыстық. Дəл осы асығыстық көптеген қате шешімдердің қабылдануына себепші болады. Ол əдетте уақыт тапшылығының салдарынан болады. Уақыт жетіспегендіктен ақпарат толық анализденбейді, соның əсерінен маңызды мағлұматтар назардан тыс қалады. Асығыстық нұсқалардың барлық жиынын қарастыруға мүмкіндік бермейді, нəтижесінде олардың көбі ескерілмей қалады. Осындай жағдайда əдетте дұрыс деп саналған бірінші шешім қабылданады. 2.Эмоционалды əсерленгіштік. Асығыс шешімге күшті эмоционалды əсердің негізінде келуге болады. Егер адам ашулы немесе қапаланған күйде шешім қабылдаса онда ол қабылдаған шешім орындалмайтын болып шығуы мүмкін. Эмоционалды əсерленгіштік тек қана негативті эмоция түрінде емес сонымен қатар позитивті эмоция түрінде де болуы мүмкін. Энтузиазм да дəл осылай адамды соқыр етуі мүмкін, ол жиі жағдайда кездеседі.</p>
<p>3. Баяулылық. Бұл шешім қабылдау барысындағы өте күшті тосқауыл. Кем дегенде адамдарды шешім қабылдауда баялылыққа итермелейтін алты себепті көрсетуге болады: • мəселені шешуден жалтару; • барға риза болу, сондықтан пайда болған мəселені дер кезінде шешпей, мəселе ауқымды сипат алғанша онымен айналыспау; • мəселені коллегиалды түрде шешу туралы жабысқақ ойлар; • меселеге байланысты ақпараттың тым коп болуы, жиі жағдайда басшы бұл ақпараттарды өңдеуге күші жетпейді; • қандай жолмен болсада болашақты болжау, кездейсоқ пайда болған нұсқаларды шешім қабылдауда елемеу; • шешім қабылдар алдындағы сенімсіздік. 4. Өзінің қателіктерін мойындай алмаушылық. Адам қиын сəтте озінің мінез-құлқын ертерек түсінсе, ол сол қиын сəттен тезірек шығады. Негұрлым шынайы болу керек, адам қателік жіберген кезде оны түзетіп, ары қарай жылжуы керек – бұл шешім қабылдау кезіндегі осы кедергімен күресудің шынайы құралы. 5. Шамадан тыс өз-өзіне деген сенімділік. Кейбір басшылар бар, өздерінікін ғана дұрыс деп, басқалардыкін дұрыс емес деп есептейтін, өзгелермен санаспайтын. Бұлай ойлау шешім қабылдау жолындағы салмақты қателіктердің бірі. Басқару шешімдерін жіктеудің теориялық жəне практикалық мəні зор. Басқару шешімдерінің табиғаты алуан түрлі. Олардың əр түрлілігін жіктеу, реттеу үшін белгілер бойынша жіктейді. Басқару субъектісі бойынша шешімдерді бөлуге болады: - əкімшілік - қоғамдық ұйымдар шешімі, т.б. Басқару объектісі бойынша шешімдерді жалпы жəне жекелей, күрделі жəне қарапайым деп бөледі. Жалпы шешім, əдетте, бүкіл шаруашылықтың мүддесін қозғайды. Жекелей шешімнің жедел сипаты болады, ол көбінесе басқарудың төменгі буынына тəн. Уақыт өлшеміне қарай шешімді: перспективалық, күнделікті, жедел деп бөледі. Перспективалық шешімнің орындалуына ұзақ уақыт керек( 3-5 жыл жəне одан да көп). Күнделікті шешім көбінесе 1-2 жыл аралығында жүзеге асырылады. Жедел шешім қысқа уақыт ішінде жүзеге асырылады( бірнеше апта, күн, ай). Басқару шешімі ұйымдастырылуына қарай ж екелей, алқалы жəне ұжымдық болып бөлінеді. Жекелей шешім – бұл басшының ұжыммен немесе жекелеген адамдармен келісімсіз, əрі ешбір талқылаусыз жеке өзінің шығарған шешімі. Бұл көбінесе ұсақ-түйек мəселелерді қозғайтын жедел шешімдер.</p>
<p>Мұндай шешімнің мазмұны мен сипаты басқарудың орталықтану деңгейіне қарай айқындалады. Алқалы шешім- бұл мамандар тобымен жəне тиісті басшылармен бірлесіп, ақылдасып отырып жасалатын шешім. Мұндай шешімдер, əдетте, мұқият əзірленеді, əрі онда көптеген мəселелер қамтылады. Алқал ы шешімде əр түрлі басшылардың жекелей жаупкершілігіне нұқсан келтіретін жайттар болмауы тиіс. Ұжымдық шешім барлық ұйым мүшелерінің жалпы жиналысында қарастырылып қабылданады. Функционалдық мақсатына орай шешімдерді жоспарлау - экономикалық, технологиялық, қаржы жəне əкімшілік сипатта бөледі. «Басқарудың əлеуметтік жағдайлары» кітабында Пригожин басқару шешімдерін жіктейді: 1) мұқият айқындалған типтік шешім, оның мазмұнына басшының дербес ерекшеліктері əсер етпейді немесе шамалы əсер етеді. Бұған кадр мəселесі, жұмыстарды ұйымдастыру, бөлімшелердің жұмыстарын ұйымдастыру, т.б. жатады. 2) ынталы шешім, яғни онша айқындалмаған шешім, мұнда басшының жекелей үлесі басым болуы мүмкін. 3) творчестволық шешім белгілі бір стратегиялық мақсатты жəне соған жетуді көздейді. Əдетте мұндай шешім ұжымның алдында тұрған күрделі мəселелерді қозғайды. Шетелдік авторлары ұжымдық шешімдерді бағдарланған жəне бағдарланбаған деп жіктейді. Бағдарланған шешім дегеніміз жоспарлардың немесе іс-əрекеттердің белгілі бір жүйемен жүзеге асу нəтижесі, яғни шешімнің математикалық теңдеуі болып табылады. Бағдарланбаған шешім біршама жаңа ішкі құрылымы қалыптаспаған немесе белгісіз факторлардың жағдайында қабылданады. Мұндай шешімдерге мыналар жатады: ұйым мақсаты қандай болу керек, басқару бөлімшесінің құрылымын қалай жақсарту керек. Практикада таза түрінде бағдарланған жəне бағдарланбаған шешімдер сирек кездеседі, барлық шешімдер шектеулі варианттардың аралығында болады. Басқару шешімдерінің ішкі мазмұнының біртұтастығы мəселе қалай шешілу керек деген сауалға жауап береді. Бұл- шешімнің маңызды бөлігі. Шешімнің ұйымдық бөлігіне мынадай мəселелер жатады: іс-əрекеттің реттілігі, календарлық мерзімдер (аралық, ақырғы), орындауға жауаптылар, орындаушылар арасындағы үйлестіру жəне өзара əрекеттесу мəселелері есеп беру тəртібі. Шешімдерді шығару жəне қабылдау теориясы. Шешім қабылдау процесінің интуитивтік, пайымдауға негізделген жəне тиімді сипаты болады.</p>
<p>Интуитивтік шешім- бұл бір нəрсенің дұрыстығын сезуге негізделген таңдау. Мұндайда шешім қабылдайтын адамдар əрбір балама варианттарға «келісу» жəне «қарсы болу» жағын қарастырып жатпайды. Пайымдауға негізделген шешім- бұл білімге немесе жинақталған тəжірибеге негізделген таңдау. Пайымдау негізінде шешімді тікелей басшының өзі қ абылдайтындықтан, оны қабылдаудың біршама артықшылықтары бар. Шешімді жасау процесі үш негізгі кезеңнен тұрады: шешімді əзірлеу, қабылдау жəне жүзеге асыру. Шешім қабылдау процесі кезекті кезеңдер қатарынан тұрады, циклдерді қалыптастыра отырып, тікелей немесе кері байланыстар ретінде бір-бірімен біріктірілуі мүмкін. Шешімді өңдеу жəне қабылдау процесі кезеңдердің келесі кезектілігінде іске асырылады: 1. Проблеманы қалыптастыру жəне негіздеу, 2. Шешім қабылдау үшін шектеулер жəне критерийлерді қалыптастыру, 3. Шешімнің мүмкін варианттарын қалыптастыру жəне тандау 4. Шешімнің ең жақсы вариантын тандау. Шешімдер варианттарын салыстыру нəтижесі бойынша алдыға қойылған мақсаттарға неғұрлым тиімді жетуді қамтамасыз ететін, нақты жағдай үшін мақсатты вариант таңдалады. Шарт бойынша бұл проблема жөніндегі шешім қабылдау болып табылады. Жағдайдың қалыптасу сипатына қарай қабылданатын басқару шешімінің де өзіндік типі болады. Жағдайды дер кезінде бағалау жəне дұрыс түсіну көбінесе басқару шешімін қабылдау шешіміне байланысты. Дұрыс шешім қабылдау жеткілікті, əрі айқын мəліметтер болғанда ғана мүмкін болады. Қабылданатын шешімнің нəтижелік критерийін таңдау- күрделі, əрі жауапты кезең. Критерий дегеніміз- қабылданатын шешімнің əр түрлі варианттарының тиімділігін салыстыруға мүмкіндік беретін көрсеткіш немесе бірнеше көрсеткіш. Мақсатты тұжырымдау мен критерийді таңдау арасында басқару шешімі үшін əрқашанда тікелей байланыс болуы керек. Ми шабуылы тəсілі- бұл эксперттер негізінде жəне мəселедегі əр түрлі көзқарастарды ескере отырып мəселені дəл тұжырымдау, оны шешу амалдарын қарастыру. Шешім қабылдауға бейсананың əсері. Шешім қабылдау тек ғана саналы негізде ғана емес, сонымен қатар белгілі бір деңгейде бейсаналы деңгейде де жүреді. Адам барлық уақытта өзінің əрбір əрекетін айқын түрде түсіндіріп бере алғанымен неге басқадай емес дəл осылай жасағанын əр уақытта біле бермейді. Бұл феноменді XIX жəне XX ғасыр тоғысында австрия психологы З.Фрейд ашқан болатын. Ол</p>
<p>біздің көптеген бейсаналы əрекеттеріміз өз «Менін» психологиялық қорғау нəтижесінде болады деп түсіндіреді. Ол неге болады? Қалыпты өмір сүру үшін адам өзін жеткілікті түрде жақсымын деп есептеуі керек, сондықтан адам өзінің кез келген соның ішінде ең жаман деген қылықтарын ақтауға тырысады. Тіпті адам өлтіруші болған жағдайда өзін емес осы əрекетке итермелеген құрбанды кінəлəйді. Тұлға өзінің əрекетін өзі қорғайды. Сипатталған психологиялық қорғаныс механзмдерін З.Фрейд пен оның қызы Анна түсіндірген болатын. Психологиялық қорғаныс адамның мінез- құлқы өз ойындағыдай, өзін қалай ұстау керек екендігін елестеткендей болмаған жағдайда қосылады. Психологиялық қорғаныс өте көп, əр адам өзінікін таңдайды, бірақ классикалық түрлері болып келесілер есептелінеді: 1.Рационализация. Адам өз əрекетін өзінікі дұрыс деп есептеуіне байланысты түсіндіреді. Егер қызметшіге дауыс көтерсе, ол басқалай түсінбейді деп ақталады. 2.Репрессия. Адам өзінің жағымсыз да жағымды да эмоцияларының шығуына тиым салады. Мысалы басшы қызметкерге ашулы болса да оған дауыс көтермейді, ал қорқыныш бейж айлылық бейнесінің астында жасырын қалады. Бірақ бұл эмоциялар ешқайда кетпейді, ол бəрібір адамды мазалайды, тіпті физикалық ауырпашылықтар əкеледі. 3.Регрессия. Бұл қорғаныс мінез-құлықты еріктік бақылаудың əлсіреуі жағдайында пайда болады. Адам жауап қайтарудың анағұрлым қарапайым түрлерін жəне балаларға тəн түрлерін таңдайды: жылайды, дауыс көтереді, төбелеске ұмтылады, өзінің мəселесі жайлы өзгелерге шағымданады. 4.Жоққа шығару. Адам мəселені шешудің орнына мəселе жоқ деп хабарлама жасағанда пайда болатын. Басшының бейсаналы түрде өзінің шығармашылық деңгейіне, құзыреттілігіне деген алаңдаушылығы өзінің қызметкерлерін интенсивті түрде жұмыс жасауға итермелейді. 5. Оқшаулану. Қатты стресс жағдайында пайда болады, адам болып жатқан жағдайға сырттан қарайды, өзінің басынан өтіп жатпағандай, бұл бір қорқынышты түстей, жақын арада аяқталатындай көрінеді. 6. Реактивтивті пайда болулар бір нəрсеге қолы жетпейтінін түсінген адам тура қарама-қарсы бағытта əрекет ете бастағанда пайда болады. Кейде реактивті пайда болулар керсінше адамды итермелеуші күшке қарама - қарсы жасау тенденциясында пайда болады. 7. Проекция немесе бұл қорғаныс түрін «проекция феномені» деп те атайды. Белгілі бір жобамен айналысушы басшы өзінің қажеттіліктерін, сезімдерін, қызығушылықтарын, ойлары мен тіпті мінез сипатын басқа адамдармен ұқсас деп ойлауы. 8. Сублимация. Жиі жағдайда қол жетпейтін мақсат басқасымен, шынымен атқарылған əрекеттен қанағаттанарлық əсер алатын мақсаттарға ауысқанда көрініс табады.</p>
<p>Психологиялық қорғаныс мəселені шешу процессі кезінде көрінеді, осы процесске енеді, оны күрделендіреді, кейде тіпті өзгертуі мүмкін. Бірақ бұл – оны жеңіп шығуға болатын, ұжымдық пікірмен сақтандыруға болатын индивидуалды мəселе. Өзгертуші əсерлер, оның үстіне саналы т үрдегі нақты адамдар əсер ететін болса, онда ол басқа мəселе. 5. Шешім қабылдау процессі кезінде адамдардың бір-біріне əсер етуі Адамдардың бір-біріне əсер етуінің негізгі үш механизмі бар: хабарлама, сендіру, иландыру. Хабарламада əсер етуші ақпараттың өзі болып табылады, оны қабылдаған адам өзінің мінез-құлқын түзейді, пікірін қалыптастырады, берілген ақпараттың негізінде тиісті шешімді қабылдайды. Сендіру кезінде адам ақпаратты құндылықтардың, ұстанымдардың жəне басқа ададардың өзгеруіне əсер ететін дей етіп ұйымтастырып ұсынады. Бұл жағдайда дəлелдер жүйесін немесе растаушы мəліметтерді келтіреді немесе беделді адамдар пікіріне жүгінеді. Шешім қабылдау үшін ең қауіпті иландыру арқылы əсер ету болып табылады. Олар əртүрлі болуы мүмкін. Иландыру элементтері кез келген коммуникацияда бар: бұл имидж жəне материалды беруді ұйымдастыру еркешелігі, сонымен қатар қарым-қатынастың вербалды емес құралдары жəне т.б. Манипуляция түсінігінің негізінде адресаттан жасырын, оның қандай да бір затқа деген қарым -қатынасын өзгерту, шешім қабылдау мен əрекеттерді орындауына ықпал ету арқылы матипуляциялаушы адам өз мақсаттарына жетуі жатыр. Адам қуыршақ (марионетка) сияқты əрекет етеді, оны қуыршақ ойнатушы əртіс басқарып отырғандай болады. Манипуляцияның міндетті шарты, сырттан енгізбей адресаттың өз бетінше шешім қабылдауын сақтау. Сонымен қатар адресат өз іс -əрекетіне жауапкершілікті өз мойнына алады. Манипуляцияның психологиялық негізі қандай? Ф.Перлздің айтуы бойынша, біздің əр қайсысымызда екі бастау бар, оларды шартты түрде «үстіндегі ит» жəне «астындағы ит» деп атайды. «Үстіндегі ит» бұл белсенді бастау, бұйыруға, бағындыруға бедел арқылы қысым жасауға ұмтылудан көрініс табады. «Астындағы ит» бұл пассивті бастау, біздің бағынуға, келісуге, біреудің сөзін тыңдауға деген қажеттіліктерімізден көрінеді. Осы бастаулардың əрқайсысы немесе манипулятивті немесе шығармашылық сипатта көрініс табады. Э. Шостром манипуляцияның негізгі сегіз сызбасын ұсынды. Оның айтуы бойынша, біздің əрқайсысымызда манипулятор отыр, тіпті бірнеше типі бірақ олардың біреуі басым болады. 1. Диктатор. Ол əлбетте өз күшін асыра бағалайды, басымдылық етеді, бұйрық береді, беделді тұлғаларды дəйектейді, қысқасы басқару үшін құрбанына барлығын жасайды. Диктатордың өзге түрлері: бастық, босс, кіші құдайлар жəне т.б.</p>
<p>2. Жігерсіз (ерік күші төмен адам). Диктатордың құрбаны, оған тікелей қарама-қарсы адам. Жігерсіз диктатормен өзара қарым -қатынасқа түсу арқылы үлкен шеберлілікті дамытады. Ол өзінің сезімталдылығын асыра сілтейді. Оларға тəн сипаттар: ұмыту, естімей қалу, пассивті түрде үндемеу. Жігерсіздердің өзге түрлері: күмəндəнғыш, ақылсыз, құбылмалы, конформист, ұялшақ, шегінуге бейім. 3. Калькулатор. Бəрін жəне барлығын бақылауда ұстау қажеттілігін тым арттырады. Ол алдайды, өтірік айтады, жалт арады, бір жағынан айласын асыруға, бір жағынан басқа жолға салуға тырысады. Өзге түрлері: епті (пысық), аферист, покер ойнаушы, жарнама жасаушы, бопсалаушы. 4. Жабысқақ. Калькулаторға полярлы қарама -қарсы адам. Өзінің тəуелділігін бар күшімен асыра сілтейді. Бұл тұлға, қамқорлылықтың заты болуды аңсайды. Пайдалануға да мүмкіндік береді, өз жұмысын өзгелердің орындауларына мəжбүрлейді. Өзге түрлері: паразит, қыңқылдауық, мəңгі бала, ипохондрик, біреудің асырауындағы жан, қорғансыз. 5. Бұзақы. Өзінің агрессивтілігін, зұлымдығын, ізгіліксіздігін асыра сілтейді. Əр түрдегі қауіп көрсетудің көмегімен басқарады. Өзге түрлері: балағаттаушы, жек көруші, гангстер, қауіп төндіруші. 6. Сүйкімді жігіт. Өзінің қамқорлығын, махаббатын, көңіл бөлушілігін асыра сілтейді. Ол мейірімділігімен көзге түседі. Кей мағынада онымен жолығу бұзақымен жолыққаннан да қиындау. Сіз сүйкімді жігітпен күресуде жеңе алмайсыз. Қызық жайт, кез келген бұзақы мен сүйкімді жігіт арасындағы конфликтіде бұзақы жеңіліс табады. Өзге түрлері: жағымпаз, ізгі істі, моралист, ұйымшыл адам. 7. Сот. Өзінің сыншылдығын асыра сілтейді. Ол ешкімге сенбейді, күнəға, наразылыққа толы, кешіруі қиын. Өзге түрлері: бəрінбілгіш, күнəмшіл, айғақ жинаушы, масқаралайтын, бағашыл, кекшіл, күнəсін мойындауға мəжбүрлегіш. 8. Қорғаушы. Сотқа қарама-қарсы адам. Ол өзінің қолдау көрсете алуы мен қателіктерге жұмсақтығын асыра сілтейді. Ол өзінің шамадан тыс аяушылдығы мен өзі қорғаушы адамның өз аяғына тұрып, өз бетінше өсуіне мүмкіндік бермеуі арқылы басқаларды бұзады. Өз ісімен айналысқанның орнына басқалардың қажеттілігі жайлы көбірек ойлайды. Өзге түрлері: балапан басқан тауық, жұбатушы, қамқоршы, азап шегуші, көмекші, жанкешті. Манипуляцияның түрлерін талқылап болған соң, енді олардың қалай əсер ететіндігін қарастырайық. Э.Шостром манипуляторлы жүйенің төрт типін бөліп көрсетті: 1.Белсенді манипулятор басқаларды белсенді əдістер көмегімен басқаруға тырысады. Ол ешқашан да өзінің əлсіздігін көрсетпейді, керсінше өте күшті, жігерлі адамның ролін ойнайды. Ережеге сай, бұл адам өзінің əлеуметтік статусын немесе дəрежесін қолданады: ата-ана, аға сержант, мұғалім.</p>
<p>2.Пассивті манипулятор – белсендіге қарама-қарсы. Ол қорғансыз, аңқау күй танытады. Ол кезде белсенді манипулятор жеңіс табады. Бірақ пассивті манипулятор өз есебінен белсенді манипуляторға ойлап жəне жұмыс жасауға мүмкіндік бергендіктен олда жеңіске жетеді, себебі белсенді манипулятордың жұмысы тікелей пассивті манипулят ордың көмегімен жүзеге асады. 3.Жарысушы манипулятор өмірді тоқтаусыз турнир ретінде, онда үнемі «жеңіс» пен «жеңіліс» тізбегі таусылмайды деп қабылдайды. Ол үшін өмір – бітпес күрес, ал адамдар – бір біріне шынай немесе потенциалды қарсыластар тіпті жаулар. 4.Селқос манипулятор. Ол немқұрайлылық пен салғырттықта ойнайды. Кетіп қалуға, конфликтен алшақтауға ұмтылады. Оның девизі «маған бəрібір». Оның əдістері бірде пассивті, бірде белсенді. Э.Берннің ойынша, манипуляцияның көптеген түрлері ойынға туыстас. Ойын – психологиялық маневр, мақсаты басқа адамның тарапынан қанағаттану сезімін алу. Психологтардың ойынша мұндай ойындар еңбек ұжымына сипатты. Басқару шешімдерін қабылдауда аталған манипуляциялардың жағымсыз əсерлері кейді қақтығыстар туғызуы мүмкін . Латын тілінен аударғанда «конфликт» термині қақтығысты білдіреді. Осы жалпылама мағынада бұл термин психологиялық əдебиеттерде де қолданылады. Сонымен бірге, психологияда қақтығыстың табиғаты туралы бірыңғайланған, белгілі бір көзқарас жоқ екенін атап өткен жөн. Бұл жағдай жеке тұлғаның құрылымына, адамның табиғатына көзқарастардың өзгермелілігіне байланысты. Концептуалды негіздемелердің алуан түрлілігі осы ұғымның көптеген басқа түсіндірмелерін туындатады: қақтығысты Мен, Ол жəне Менмендік арасындағы шешілмейтін антагонизм ретіндегі психоаналитикалық түсіндіруден бастап (З.Фрейд) қақ тығысты құндылықтар дəмесін қанағаттандыруға қажет ресурстар үшін күрес ретінде түсінуге дейін. Қақтығыстардың көптеген жіктемесінің негіздемелері мыналар болып табылады: болу сипаты, көрініс табатын түрі, қақтығыс көзі, мазмұны, маңыздылығы, шешу түрі, білдіру формасы, өзара қарым-қатынас құрылымының түрі, əлеуметтік нəтиже жəне басқалары. Түрлерінің алуандығына қарамастан, қақтығыстардың өту кезеңдерінің шартты ортақ нəрсесі бар: қарама-қайшылықтар пайда болды, бірақ оларды өзара іс -қимыл қатысушылары əлі де мойындамайды; • қатысушылар позициялардың антагонизмін түсінеді; • қақтығысты əрекеттер; • қақтығысты аяқтау (жою немесе шешу). Кəсіби қызмет əртүрлі мақсаттар мен мүдделердің ерекше өткір қарама-қайшылығымен, ресурстарды бөлудегі теңсіздікпен (оның ішінде билік құзыреті) жəне олар үшін күреспен сипатталады, сондықтан мұнда</p>
<p>қақтығыстар ең өткір жəне айқын көрініс табады. Мұндай қақтығыстарға тəн белгі-қосарлылық, өйткені олар деструктивті жəне конструктивті функцияларды орындай алады. Ғалымдардың пікірінше, қақтығыстар жай ғана қажет нəрсе емес, олар ұйымға пайдалы, өйткені олар оның тиімділігін арттыруға алып келеді. Қақтығыстардың алдын алу немесе басқаруға қатысты басшының қызметі олардың пайда пайда болу себептерін (көздерін) білмеген кезде сəтті бола қоймайды. Басқару психологиясының өкілі Р. Л. Кричевский қақтығыстарды тудыратын себептердің үш негізгі тобын атап өтеді: бірінші топ іс - əрекет процесімен байланысты, екіншісі адами қатынастардың психологиялық ерекшеліктерімен байланысты, үшінші топ топ мүшелерінің жеке ерекшелігімен байланысты. Басқару социологиясы тұрғысынан С. С. Фролов осындай төрт себепті бөліп көрсетеді: • ұйым мүшелерінің (жеке қызметкерлер немесе əлеуметтік топтар) мотивтерінің айырмашылығы немесе қиылысы; • жеке жəне топтық құндылық бағдарларындағы айырмашылықтар; • сыйақыны бөлудің немесе əлеуметтік қатынастардың қабылданған немесе саналы əділетсіздігі; ұйымның құрылымдық бөлімшелерінің мəртебелік немесе рөлдік қанағаттанбаушылығы. Менеджерлік əдебиетте қақтығыстарды туындататын себептерді мынадай топтарға бөледі: ресурстарды бөлу, міндеттердің өзара тəуелділігі, мақсаттардағы, идеялар мен құндылықтардағы, мінез-құлық пен өмірлік тəжірибелердегі айырмашылықтар, қанағаттандырмайтын байланыстар. Қорытындылай келе, əр көзқараста қақтығыстың пайда болу көздері (алғышарттары) ретінде А бөлімінде қарастырылға н психологиялық қасиеттер мен жеке қасиеттерді бөліп қарастыратынын атап өтеміз. «Басшы-бағынышты» қақтығысы ерекше назар аударуға тұрады. Зерттеушілер (А.Я. Анцупов, А. B. Шипилов жəне т. б.) мұндай қақтығыстардың көздерін түрге бөлу кезінде дəстүрлі түрд е бірлескен қызмет процесіне байланысты объективті жəне субъективті себептерді ажыратады. Алайда, субъективті себептердің алуан түрлілігін конфликтогендік əрекеттердің үш түрінің біріне дейін азайтуға болады: артықшылыққа ұмтылу, агрессивтілік жəне өзімшіл діктің көрінісі. Теоретиктердің де, практиктердің де пікірінше, қақтығыс шешімін қақтығысты жағдайды өзгерту арқылы табу керек. Өзгерту əдістері əртүрлі жəне көбінесе қақтығыстардағы мінез -құлық стиліне байланысты. К.Томастың, Р.Килменнің қақтығыстардағы м інез-құлық стильдерін жалтару, бейімделу, бəсекелестік, ымыра жəне ынтымақтастық деген түрге бөлулері барынша танымал. Бірқатар тəжірибешілер тағы екі стратегияны бөліп көрсетеді: басу жəне келіссөздер. Қазіргі уақытта қақтығыстардың алдын-алу мен шешудің кең таралған тəсілі медиация болып табылады (теңгерімді баламаларды таңдау мүмкіндігі, жанжалды өзара тиімді аяқтау үшін ымыралы шешімдер). Қақтығысты басқарудың тиімділігі мен</p>
<p>конструктивтілігі жанжал жағдайындағы адам мінез-құлқының моделі мен детерминантына байланысты екенін атап өткен жөн. Мінез-құлық үлгісі (Е. Мелибурда, В.Зигерт жəне Л. Ланг) қақтығысты қабылдаудың ақылға қонымдылығы, ашықтық жəне адалдық сияқты факторларды қамтиды Власова Н. М. былай деп бөледі: позитивті жүріс -тұрыс, психика жұмысының ұтымды тəртібі, теріс эмоционалды əсерге реакцияның болмауы, шағымдарды қалыптан шықпай негіздеу, қалыптасқан жағдайдан қалай шығуды бірлесіп іздеу, қарсыластың қылықтарын емес əрекеттерін бағалау, қабылданған уағдаластықтарды ресімдеу жəне т.б. Емельянов C. V.төрт сатылы алгоритмді ұсынады: қақтығыстың себептерін зерттеу, қатысушылардың санын шектеу, қосымша талдау жəне онда əр қадам мақсатқа жетудің нақты тəсілдері мен əдістеріне сəйкес келетін шешімдер қабылдау. Қақтығыс тараптарының қарым-қатынасы мен байланысын ескере отырып, басшы ойлау стилінің типологиясын (А. Харрисон, Р. Брамсон) жəне оларға сəйкес мінез-құлық реакцияларын түсінуі керек, өйткені қарым-қатынас кезінде өзара түсіністік пен өзара əсер ету əдістері көбінесе басым түсетін ойлау стиліне байланысты жəне əр қақтығысушы тарап жағынан барынша айқын көрініс табады. Олардың өкілдерінің ойлау жəне мінез-құлқының бес стилі бар: синтезатор, идеалист, прагматик, аналитик, реалист. Іс жүзінде басқарушы қақтығысқа тап болған кезде оның қатысушыларын ғылыми əдебиетте көрсетілген қандай да бір түрге жатқыза алмайды. Басшы олардың қақтығыс тараптарының жеке бас ерекшеліктерімен немесе табиғатымен байланысты туындайтын қарсылықты сезіне алады. Бұл жағдайда жанжалшыл немесе қиын адамдар туралы сөз болып отыр. Жанжалшыл тұлғаларының типологиясы (В. П. Шейнов бойынша): • қылықты-əрдайым назарда болуға, табысты болып көрінуге талпынады, осылай көзге түсу үшін қақтығысқа түседі, * қаттылық-өршіл, өзін — өзі жоғары бағалайтын, қалыптасқан пікірі өзгеретін жағдайларға қайшы келген кезде қақтығысқа түседі; басқарылмайтын — импульсивті, болжау мүмкін емес, өзін-өзі бақылаудың төмен деңгейімен сипатталады; • аса тиянақты-сыртқы, əсіресе басшылық тарапынан бағалауға өте сезімтал адал қызметкерлер. Олар бəрін (ең алдымен өздерін) жоғары талаптар тұрғысынан бағалауға бейім, ал оларға (талаптарға) жауап бермейтін адамдарды қатаң сынға алады; • рационалистер — ақылды, жеке мақсаттарға жету үшін əрдайым қақтығысқа түсуге дайын; • ерік-жігері əлсіздер — өздерінің принциптері мен сенімдерінің болмауына байланысты əсер ету жəне манипуляцияларға ұшырайды. «Рационалистер» жəне «ерік-жігері əлсіздер» - «жағдайға қарайтын» типтер болып табылады, яғни белгілі бір қақтығысты жағдай туындағанда ғана көзге түседі, қалған типтер қақтығысты өздері бастайды.</p>
<p>Р.Брамсон «Общение с трудными людьми» еңбегінде мынадай түрлерге бөледі: озбыр, шағымшыл, ашулы бала, максималист, үндемес, жұмбақ кек алушы, жалған альтруист, үнемі айыптаушы. В.Ратников ұсынған типологиясы қызығушылық тудырады: • бумен жүретін каток - өзіне əркім мойынсұнуы тиіс деп ойлайтын, өзгелердің пікірімен санаспайтын, айналасындағылармен үнемі қақтығысып жүретін оспадар жəне дөрекі адам; • жасырын агрессор (снайпер) - адамдарға сахна сыртындағы айла - амалдар, шағып сөйлеу, агрессияның жасырын көріністері арқылы қиындық туғызады; • үндемес - оның жымысқылығының, жабықтығының себептері белгісіз, жанжалдың пайда болуы тұрғысынан əлеуетті қауіп төндіреді; • жарғыш, немесе ашулы бала-күтпеген жерден ашуға беріледі, жарылады, сондықтан жағымсыз жағдай тудырушы болып табылады; Конфликтологияның негіздері жəне қиын адамдармен қарым - қатынас • өте икемді-қарым-қатынаста қиындықтар туғызбайды, əрқашан бəріне жолын береді жəне кез-келген істе көмектесуге уəде береді, бірақ уəделерді орындамайды, өйткені оның бəрін орындауға күші де, уақыты да жоқ. Əңгімелесуші жанжалшыл немесе "қиын" адамдардың қандай түріне жататынын анықтап, басшы ұйым шешетін міндеттердің мүдделері үшін оған тиімді ықпал ете алады. Бекіту сұрақтары: 1. «Басқару шешімі» терминінің мəнін ашыңыз. 2. В.Лисичкин атаған тəсілдердің үш класын көрсетіңіз. 3. Э.Шостром жасаған манипуляторлы жүйенің төрт типін атаңыз. 4. Жанжалшыл тұлғаларының В. П. Шейнов бойынша типологиясын жіктеңіз.</p>`,rawText:`§ 9 Басқару шешімдерін қабылдау процесінің жалпы сипаттамасы 
 
Басқару қызметі процесінде шешім қабылдау ең қиын мəселе. Шешім 
қабылдау басқару процесінің міндетті, қажетті бөлігі. Басшының кез келген 
əрекеті іс жүзінде белгілі бір шешім қабылдаудан басталады. 
Кəсіпорынның жəне ондағы бөлімшелер қызметінің нəтижесі 
басшының дер кезінде шешімді дұрыс қабылдау қабілетіне, əрі оны жүзеге 
асыра білуіне, ал оның жеделдігі мен дұрыстығы басшының тəжірибесі мен 
біліміне байланысты. Егер ол өндірісті, технологияны жəне адамдард ы 
жақсы білетін болса, жұмыс тəжірибесі мол болса, онда оған шешім 
қабылдау қиынға түспейді. 
Қабылданған шешім бүкіл ұжымның экономикалық жəне əлеуметтік 
нəтижелеріне, əрбір жұмыскерге қолайлы немесе қолайсыз əсер етуі 
мүмкін. Сондықтанда шешім қабылдаған адам өзіне үлкен жауапкершілік 
жүктейді. 
«Басқару шешімі» термині екі негізгі мəнде қолданылады. Бірінші 
жағдайда ол белгіленген басқару актісін, қабылдаған іс-əрекет жоспарын, 
қаулы-қатарларды, т.б.; екінші жағдайда- мəселелер мен міндеттер шешімін 
қабылдаудың жəне жүзеге асырудың ең қолайлы нұсқасын білдіреді. 
Басқару шешімінің ең маңызды белгісі - өндіріс немесе басқару 
жүйесінің өзі болып саналады. 
Шешім туындаған мəселе болған жағдайда қабылданады. Мəселе 
дегеніміз- жүйенің қажетті жəне қолданылып жүрге н қалпының 
арасындағы сипатталатын жағдай. 
Басқару шешімін қабылдауға жүйелік тұрғыдан қараудың, пайда 
болған мəселелерді шешудің жүйелігін сақтаудың зор маңызы бар. Əрбір 
жаңа шешім алдыңғы шешімдерді өрістету үшін қабылдануы өрістік 
міндеттерді кезең-кезеңімен орындауды қамтамасыз етуі тиіс. 
Басқару шешімінің маңызды талабы- соңылылығы. Күрделі өндірістік 
жағдайда, əсіресе жұмыстың қауырт кезінде, егер барлық факторларды 
ескеруге көп уақыт кететін болса, онда шешім қабылдауды қысқартып, 
жұмыстың орындалуына кедергі жасамау керек. 
Басқару шешімінің маңызды талаптарының бірі- мақсаткерлік. Шешім 
ұжымның мақсатын, басты міндеттерін білдіреді, кез келген жұмысты 
тікелей орындаушыларға берілетін тапсырмаларды айқындайды. Ірі 
шаруашылық шешімдері бірнеше мақсатты айқындайды. 
Кез-келген шешім ауызша немесе жазбаша түрде қабылданса да, дəл 
нақты, айқын, дəлелді болуы тиіс. Шешімде тапсырманың мəні, оның 
көлемі, мерзімі, жүзеге асыру əдісі, орындауға жауаптылар көрсетілуі тиіс.  
Шешім қабылдау барлық психологтармен дерлік басқарудың орталық 
сəті болып мойындалады. Сондықтан да осы критерий бойынша еңбек 
процесіндегі басты ролдер анықталады: басшының жəне бағынушының. 
Шешімді жоспарлауда (іздеу мен шешім қабылдау процессінде, сонымен 

қатар мақсаттарды, міндеттерді жəне оларға қол жеткізу құралдарын 
анықтау), ұйымдастыруда (шешім, əртүрлі ресурстар түрінің бірігуіне жəне 
адамдардың ортақ іс-əрекетіне бағытталған), мотивацияларды басқаруда, 
бақылауда жəне т.б. көрініс табады.  
Шешім қабылдау — бұл мəселені түсінуді, адекватты мақсаттарды 
бекіту жəне осы мақсатты іске асыру үшін құралдарды таңдауды 
болжайтын күрделі ой процессі. Өкінішке орай, айтылған бұл процесс 
сыртқы орта жағдайлары мен жоға рғы басшылардың қысымының 
салдарынан жиі жағдайда стихиалы түрде жүреді. Сондықтан да оның іске 
асырылуы күрделі жүреді. Профессор Л.Зайверт, уақытты рационалды 
қолдану неміс институтының жетекшісі көптеген менеджерлер келесілерді 
дұрыс көреді дейді: 
• дұрыс жұмыстар жасағанның орнына дұрыс жұмыс жасау; 
• шығармашылық альтернатива жасағанның орнына мəселелерді 
шешу; 
• қолданған құралдарды оптимизациялаудың орнына құралдарды 
жинақтау; 
• нəтижелерге қол жеткізгеннің орнына міндеттерді атқару; 
• пайданы арттырудың орнына шығындарды азайту.  
Бұлардың барлығы — дұрыс шешім қабылдамаудың нəтижесі. Дұрыс 
шешім қабылдамау неге мүмкін болады? Жəне – осы сынды басқарудағы 
есептен жаңылыс ықтималдылығын қалай төмендетуга болады?  Бұны  
түсіну үшін, адамдардың психологиялық ерешеліктеріне көңіл аудару 
керек, яғни осы əрекет қандай психологиялық ерекшеліктің арқасында 
жүзеге асты.   
Шешім қабылдауда адамның білімі, қызығушылығы, дүниетанымы 
көрініс табады жəне бір адамның ғана емес. Бұл процесстің маңызды 
ерекшелігін адамдар мен жағдайларға қарсы тұра алатын, күрделі, 
өзгермелі жағдайларда белгіленген мақсатты іске асыруды қолдап 
отыратын адамның еріктік мінезі құрайды. Бұл процесс қысқа уақыт 
аралығында басшыға көптеген əртүрлі бағыттағы шешімдерді қабылдауға 
тура келетінімен күрделенеді.  
Шешім қабылдауды əр түрлі негіздер бойынша классификациялау 
қабылданған: 
- Қамту аймағы бойынша (ортақ жəне жеке); 
- Əрекет уақыты бойынша жəне болашақ шешімге əсер ету дəрежесі 
бойынша (жылдам, тактикалық жəне стратегиялық); 
- Функционалды белгілері бойынша (шешім, жоспарлауды, 
ұйымдастыруды, мотивацияны, бақылауды шыңдауға арналған); 
- Мазмұны бойынша (политикалық, техникалық, технологиялық); 
- Жаңалық дəреже бойынша (екішілдікке негізделген, стандартты, 
шығармашылық, бірегей); 

- Шешім қабылдау шешетін мəселенің анықтылық дəрежесіне 
байланысты (шешім, анықтылық шарттарында, тəуекел шарттарында 
қабылданған); 
- Тұлғаның интелектуалы немесе эмоционалды-еріктік сферасына 
бағытталуы бойынша (интеллектуалды, еріктік, эмоционалды). 
Интуитівті шешім «жақтаушы» мен «қарсы» анализінсіз шешімнің 
дұрыстығын сезу негізінде қабылданады. Интуитівті шешімнің үлесі 
жұмысқа жаңа қызметкерді қабылдауда жоғары: бұл жерде үміткердің 
дайындығы ғана емес, тəжірибесі жəне талаптарға сай келу де маңызды,   
Прагматикалық бағдарланған шешім, бұл білімге, жинақталған 
тəжірибеге негізделген таңдау. Ең алдымен, мұндай тəсіл технологиялық 
шешімге сипатты. 
Рационалды шешім өткен тəжірибеге байланысты емес, ол 
аналитикалық шешімге негізделген. Мұндай көзқарас  стратегиялық 
шешімдерде анықтаушы болуы керек. 
Шындығында шешім қабылдау процесі кезінде барлық үш тəсіл де 
күшіне енеді, оның біреуі басым болып табылады. Сонымен қатар, басшы 
əр түрлі жағдайларда əр қилы əрекет етеді. Шешім қабылдауда тиісті анализ 
жүргізу үшін əрқашан толық ақпарат бола бермейді. Мұндай кезде істің 
барысына  интуиция, сезім енеді, тіпті оған рационалды түсіндірулер 
болмаса да оқиғаның дұрыс жүрісін ойға салады. Мысалы, адам 
патенциалды серіктесімен қандайда бір келісімшартқа отырар алдында бір 
нəрсенің дұрыс еместігін сезеді, соның əсерінен келісім шартқа отырмауы 
мүмкін. Ал технологиялық шешім қабылдау процессі білім мен тəжірибеге 
негізделген, бірақ мұнда да интуитивті шешімге орын бар. Стратегиялық 
таңдау рационалды тəсілді талап етеді. Ол шешім қабылдаушы адамның 
мотивациясы мен дұрыс ойына сүйенеді. 
 Шешім қабылдау жұмысы аз дегенде үш негізгі құраушыдан тұрады:  
• Тұлғалық (нақты топтың қызығушылығын ескере отырып, шешім 
қабылдаушы басшының мақсаттары мен ұйым мақсаттарын салыстыру); 
• Рəсімдік (нақты мəселелердің ағымды жағдайын анықтау, алда 
болатын өзгерістер дəрежесін анықтау, сонымен қатар олардың қарым -
қатынасының үзілуін жеңіп шығатын іс-шара ұйымдастыру); 
• Технологиялық (нəтиже мен оның көрсеткішін анықтау, тəуекелге 
баруды болжау, ресурстарды іздеу жəне т.б.) 
Стратегиялық шешім қабылдау кезінде қоғамға арналған миссияның 
қалыптасуын көрсететін интегративті құраушыны ескеру қажет.  
Басшы сонымен қатар оптималды шешімді іздеу барысында 
коллективті де бұл іске тартуы мүмкін. М ұндай жағдайда əр түрлі 
жақтардың өзара əрекет етуі шешім қабылдаудың тиімділін жоғарылатады, 
ұйымшылдық артып, əлеуметтік-психологиялық климат жақсарады, еңбек 
процесі нəтижесіндегі тұлғаның өз еңбегіне қанағаттануы күшейеді, 
сонымен қатар қабылданған шешімге жауапкершілік бөлінеді. Көптеген 

психологтар соның ішінде К.Левин, топтық шешім қабылдау процессі 
анағұрлым тиімді деп есептейді.   
Қазіргі уақытта басқару шешімдерін өңдеу тəсілдерінің көптеген 
түрлері жинақталған. Əртүрлі белгілер негіз болған 3.Янчан, М.Естрон, 
Г.Добров, В.Глюминский ұсынған шешім қабылдау тəсілдерінің 
классификациясы белгілі. Тəсілдердің үш класын В.Лисичкин атап 
көрсетті: 
1. Жалпығылымдық ( логистикалық жəне эвристикалық сипаттағы 
тəсілдер – бақылау, тəжірибе, анализ, синтез, индукция, дедукция, экспертті 
бағалар, ойдың ұжымдық генерациясы); 
2. Интерғылыми ( барлыған жалпылайтын сипатқа ие емес тəсілдер, 
бірақ əртүрлі іс-əрекет сфера объектілерінің кең шеңберінде қолданылады: 
математикалық статистика, моделдеу жəне т.б.); 
3. Жеке (бір объектіге немесе білім саласына тəн тəсілдер). 
Көптеген ғалымдар сонымен қатар шешім қабылдауда қолданылған 
тəсілдерді қолданған аппараттың қалыптасу белгілерене қарай үш топқа 
бөледі: 
1. Формальды тəсілдер (статистикалық, экономико-математикалық, 
сонымен қатар экономико-математикалық моделдер); 
2. Эвристикалық тəсілдер ( аналогиялық жəне имитационды моделдеу 
тəсілдері); 
3. Экспертті баға тəсілдері ( қазіргі уақытта кең қолданылатын 
тəсілдердің қатарына енеді). Күрделі объектілерді зерттеу барысында 
экспертті бағалар шартты анализ құралы немесе басқа тəсілдермен 
сəйкестендірілетін жеке дара тəсіл ретінде есептеледі.   
Шешім қабылдау процессін қалай жүзеге асыру қажет  - бұл 
менеджменттің міндеті. Басқару психологиясы бұл процесстің ішкі 
шарттарын ашуға, шешім қабылдаудың субъективті негізін ашуға 
ұмтылады. Ең алдымен, шешім қабылдау барлық психикалық 
функциялардың ( қарапайым сезім сияқты функциялардан бастап жоғарғы 
қабылдау, ес, ойлау, қиялдау функцияларына дейін) көмегімен жүзеге 
асады. Берілген тарауды ой процессінің бір аспектісін ғана анализдейміз – 
ойлау мəселенің шешімі ретінде. Айта кететіні, шешім қабылдау процессі 
психологиялық механизмдерге негізделуіне қарамастан ол анағұрлым 
күрделі процесс болып табылады. 
К.К.Платонов ұсынған шешім қабылдау сызбасын қарастырайық. 
Этаптары сызбада көрсетілген кез келген ой əрекеті, қандай да бір 
мəселенің туындауынан пайда болад ы. Мəселені шешуді ой əрекеті 
аяқтайды. Дегенмен, табылған шешім жаңа ой əрекетінің немесе күрделі, 
ұзақ ойлау процессінің бастауы болатын жаңа сұрақтарды туындатуы 
мүмкін. Қалыпты жағдайдағы адамның психикасы үшін мəселені шешу 
білім, біліктілік жəне тəжірибеге байланысты. 

Бірақ В.А.Розанованың көрсетуі бойынша басқару міндеттері өзіне тəн 
сипаттарға ие: 
1.Міндеттер анықталмаған, кей жағдайларда қарама-қарсы сипатта 
болуы мүмкін; 
2.Міндеттерде оны шешуге мүмкін болатын құралдар туралы ақпарат  
жеткілікті түрде болмауы; 
3.Міндетті  шешуде оған сəкес нақты шешім алгоритмінің болмауы; 
4.Міндеттер жиі уақыт тапшылығы шартында шешіледі. 
Американдық психологтар В.Врум жəне Ф.Йеттен шешім қабылдау 
кезіндегі басшының мінез-құлқына əсер ететін негізгі алты факторды бөліп 
көрсетті: 
1.Басшы тұлғасының индивидуалды-психологиялық ерекшеліктері 
(темперамент, міндет, қабілеттер), өмірлік тəжірибе, құндылықтарға 
бағытталуы. 
2.Шешімнің құрылымы, мəселенің құрылымдық дəрежесі. 
3.Индивидуалды шектеулер. Мынандай жағдайлар кездеседі, егер 
басқарушыға қызметкерлер білмейтін қосымша ақпаратты басқа жақтан  
іздестіру қажет болатын. Басқарушы бұл ақпараттың қаншалықты 
керектігін жəне ол ақпаратты алу қажет па жок па соны шешуі тиіс.  
4.Шешім қабылдау ортасы, яғни шешімдер анықталған, тəуекел немесе 
анықталмаған жағдайларда қабылданып жатыр ма. Шешім қабылдаудың 
уақыты да маңызды.  
5.Шешімдердің өзара байланысы. Ұйымдастыруда қандайда бір 
амалмен  шешімдер өзара байланысты болады. Біріңғай маңызды шешім 
қабылдау көптеген ұсақ шешімдерді қабылдауды талап етуі мүмкін.  
6.Бағынушылардың қабылданған шешімге қарым-қатынасы. Бұнда 
ұжымның дайындық дəрежесі, оның кəсіби біліктілігі, əлеуметтік -
психологиялық климат, бағынушылардың мотивациясы, қабылданған 
шешімге қатысты келіспеушіліктер ықтималдылығы маңызға ие.  
Осы айтылғандарға мыналарды қоса кетуге болады, жиі жағдайда 
қандайда бір шешім нақты бір адамның тағдырына əсер етуі мүмкін. 
Мысалы, жұмыстан шығару, мадақтау немесе басқа қызметке, басқа топқа 
ауыстыру жəне т.б. Сондықтан осыны ескере келіп басшыдан белгілі бір 
шешімді күтетін бағынушылар оған белсенді əсер етулері  мүмкін.  
Н.И.Кабушкиннің айтуы бойынша тұлға, теңіздегі тамшы сияқты, 
өзінің шешімінде бейнеленеді. Осы мағынада белгілі бір қызығушылық 
басқарушылық шешімдегі тұлғаның профилін ұсынады, яғни басшының 
индивидуалды ерекшеліктерінің бірлестігін. Оның көрсетуінше ғылымда 
келесідей шешімнің тұлғалық профильдері бар:  
1. Байсалды типтегі шешімдер – мəселеге шарттар мен міндеттердің 
алдын ала анализ нəтижесінен қалыптасқан қорытынды ойымен кірісетін 
адамдарға тəн. Шешім қабылдаудың мұндай тəсілі нəтижелі болып 
табылады. 

2. Импульсивті шешімдер – гипотезаны құру процесінен оның анализі 
басым болатын адамдарға тəн. Тиісінше мұндай адам ойларды жеңіл 
тудырады, олардың бағасы туралы аз ойланады. Сондықтан шешім 
қабылдау процессі негіздеуді жəне тексеруді секірмелі түрде өтіп кетіп 
отырады.  
3. Инертті шешімдер – өте сенімсіз жəне абайлықпен іздеу нəтижесі 
болып табылады. Қажетті гипотеза ұсынылған соң оның нақтылануы өте 
баяу жүреді. Басшы жеке гипотезаларды, өзінің əр қадамын бірнеше 
қайтара өте сыншылдықпен қарастырады. Бұл шешім қабылдау процессін 
ұзаққа созады. 
4. Тəуекелді шешімдер – импульсивті шешімдерді еске салады, бірақ, 
кейбір индивидуалды тактика ерекшеліктеріме н өзгешеленеді. Егер 
импульсивті шешімдер гипотезаны негіздеуде этаптардан секіріп өтіп 
кететін болса, ал тəуекелді шешімдер оларды секіріп өтпейді, бірақ адам іс-
əрекетті жүзеге асыру үшін қажетті жəне бар шарттардың арасында 
үйлеспеушілік анықталған соң ғана бағалауға келеді. Нəтижесінде, кешігіп 
болса да гипотезаны құрастыру элементтері жəне оларды тексеру 
теңестіріледі.  
5. Абайлылық сипатындағы шешімдер – гипотезаны тыңғылықты 
бағалаумен сипатталады, оның анализіне өте сыншылдықпен  қарайды. 
Басшы, ең алдымен қорытындыға келмес бұрын, көптеген дайындық 
əрекеттерін жүргізеді. Абайлылықпен əрекет ететін адамдарды жетістік 
қуандырғанның орнына қателіктер қорқытады. Сондықтан абайлылық пен 
əрекетет етін адамдардың тактикасы - қателіктерді болдырмау.  
Шешім қабылдау жолында жиі жағдайда белгілі бір психологиялық 
сипаттағы кедергілер туындап отырады. Оларды білмеу елеулі қателіктерге 
алып келеді, кеселге ұшырататын салмақты шығындарға ұшыратуы мүмкін. 
Р.И.Мокшанцев келесідей кедергілер мен шектеулерді сипаттайды: 
1.Асығыстық. Дəл осы асығыстық көптеген қате шешімдердің 
қабылдануына себепші болады. Ол əдетте уақыт тапшылығының 
салдарынан болады. Уақыт жетіспегендіктен ақпарат толық 
анализденбейді,  соның əсерінен маңызды мағлұматтар назардан тыс 
қалады. Асығыстық нұсқалардың барлық жиынын қарастыруға мүмкіндік 
бермейді, нəтижесінде олардың көбі ескерілмей қалады. Осындай жағдайда 
əдетте дұрыс деп саналған бірінші шешім қабылданады. 
2.Эмоционалды əсерленгіштік. Асығыс шешімге күшті эмоционалды 
əсердің негізінде келуге болады. Егер адам ашулы немесе қапаланған күйде 
шешім қабылдаса онда ол қабылдаған шешім орындалмайтын болып 
шығуы мүмкін. Эмоционалды əсерленгіштік тек қана негативті эмоция 
түрінде емес сонымен қатар позитивті эмоция түрінде де болуы мүмкін. 
Энтузиазм да дəл осылай адамды соқыр етуі мүмкін, ол жиі жағдайда 
кездеседі. 

3. Баяулылық. Бұл шешім қабылдау барысындағы өте күшті тосқауыл. 
Кем дегенде адамдарды шешім қабылдауда баялылыққа итермелейтін алты 
себепті көрсетуге болады:  
• мəселені шешуден жалтару; 
• барға риза болу, сондықтан пайда болған мəселені дер кезінде 
шешпей, мəселе ауқымды сипат алғанша онымен айналыспау; 
• мəселені коллегиалды түрде шешу туралы жабысқақ ойлар; 
• меселеге байланысты ақпараттың тым коп болуы,  жиі жағдайда 
басшы бұл ақпараттарды өңдеуге күші жетпейді; 
• қандай жолмен болсада болашақты болжау, кездейсоқ пайда болған 
нұсқаларды шешім қабылдауда елемеу; 
• шешім қабылдар алдындағы сенімсіздік.  
4. Өзінің қателіктерін мойындай алмаушылық. Адам қиын сəтте озінің 
мінез-құлқын ертерек түсінсе, ол сол қиын сəттен тезірек шығады. 
Негұрлым шынайы болу керек, адам қателік жіберген кезде оны түзетіп, 
ары қарай жылжуы керек – бұл шешім қабылдау кезіндегі осы кедергімен 
күресудің шынайы құралы. 
5. Шамадан тыс өз-өзіне деген сенімділік. Кейбір басшылар бар, 
өздерінікін ғана дұрыс деп, басқалардыкін дұрыс емес деп есептейтін, 
өзгелермен санаспайтын. Бұлай ойлау шешім қабылдау жолындағы 
салмақты қателіктердің бірі. 
Басқару шешімдерін жіктеудің теориялық жəне практикалық мəні зор. 
Басқару шешімдерінің табиғаты алуан түрлі. Олардың əр түрлілігін жіктеу, 
реттеу үшін белгілер бойынша жіктейді. 
Басқару субъектісі бойынша шешімдерді бөлуге болады: 
- əкімшілік 
- қоғамдық ұйымдар шешімі, т.б. 
Басқару объектісі бойынша шешімдерді жалпы жəне жекелей, күрделі 
жəне қарапайым деп бөледі. Жалпы шешім, əдетте, бүкіл шаруашылықтың 
мүддесін қозғайды. Жекелей шешімнің жедел сипаты болады, ол көбінесе 
басқарудың төменгі буынына тəн. 
Уақыт өлшеміне қарай шешімді: перспективалық, күнделікті, жедел 
деп бөледі. 
Перспективалық шешімнің орындалуына ұзақ уақыт керек( 3-5 жыл 
жəне одан да көп). Күнделікті шешім көбінесе 1-2 жыл аралығында жүзеге 
асырылады. Жедел шешім қысқа уақыт ішінде жүзеге асырылады( бірнеше 
апта, күн, ай). 
Басқару шешімі ұйымдастырылуына қарай ж екелей, алқалы жəне 
ұжымдық болып бөлінеді. 
Жекелей шешім – бұл басшының ұжыммен немесе жекелеген 
адамдармен келісімсіз, əрі ешбір талқылаусыз жеке өзінің шығарған 
шешімі. Бұл көбінесе ұсақ-түйек мəселелерді қозғайтын жедел шешімдер. 

Мұндай шешімнің мазмұны мен сипаты басқарудың орталықтану деңгейіне 
қарай айқындалады. 
Алқалы шешім- бұл мамандар тобымен жəне тиісті басшылармен 
бірлесіп, ақылдасып отырып жасалатын шешім. Мұндай шешімдер, əдетте, 
мұқият əзірленеді, əрі онда көптеген мəселелер қамтылады. Алқал ы 
шешімде əр түрлі басшылардың жекелей жаупкершілігіне нұқсан келтіретін 
жайттар болмауы тиіс. 
Ұжымдық шешім барлық ұйым мүшелерінің жалпы жиналысында 
қарастырылып қабылданады. 
Функционалдық мақсатына орай шешімдерді жоспарлау -
экономикалық, технологиялық, қаржы жəне əкімшілік сипатта бөледі. 
«Басқарудың əлеуметтік жағдайлары» кітабында Пригожин басқару 
шешімдерін жіктейді: 
1) мұқият айқындалған типтік шешім, оның мазмұнына басшының 
дербес ерекшеліктері əсер етпейді немесе шамалы əсер етеді. Бұған кадр 
мəселесі, жұмыстарды ұйымдастыру, бөлімшелердің жұмыстарын 
ұйымдастыру, т.б. жатады. 
2) ынталы шешім, яғни онша айқындалмаған шешім, мұнда басшының 
жекелей үлесі басым болуы мүмкін. 
3) творчестволық шешім белгілі бір стратегиялық мақсатты жəне соған 
жетуді көздейді. Əдетте мұндай шешім ұжымның алдында тұрған күрделі 
мəселелерді қозғайды. 
Шетелдік авторлары ұжымдық шешімдерді бағдарланған жəне 
бағдарланбаған деп жіктейді. Бағдарланған шешім дегеніміз жоспарлардың 
немесе іс-əрекеттердің белгілі бір жүйемен жүзеге асу нəтижесі, яғни 
шешімнің математикалық теңдеуі болып табылады.  
Бағдарланбаған шешім біршама жаңа ішкі құрылымы қалыптаспаған 
немесе белгісіз факторлардың жағдайында қабылданады. Мұндай 
шешімдерге мыналар жатады: ұйым мақсаты қандай болу керек, басқару 
бөлімшесінің құрылымын қалай жақсарту керек. 
Практикада таза түрінде бағдарланған жəне бағдарланбаған шешімдер 
сирек кездеседі, барлық шешімдер шектеулі варианттардың аралығында 
болады. 
Басқару шешімдерінің ішкі мазмұнының біртұтастығы мəселе қалай 
шешілу керек деген сауалға жауап береді. Бұл- шешімнің маңызды бөлігі. 
Шешімнің ұйымдық бөлігіне мынадай мəселелер жатады: іс-əрекеттің 
реттілігі, календарлық мерзімдер (аралық, ақырғы), орындауға жауаптылар, 
орындаушылар арасындағы үйлестіру жəне өзара əрекеттесу мəселелері 
есеп беру тəртібі. 
Шешімдерді шығару жəне қабылдау теориясы. 
Шешім қабылдау процесінің интуитивтік, пайымдауға негізделген 
жəне тиімді сипаты болады. 

Интуитивтік шешім- бұл бір нəрсенің дұрыстығын сезуге негізделген 
таңдау. Мұндайда шешім қабылдайтын адамдар əрбір балама варианттарға 
«келісу» жəне «қарсы болу» жағын қарастырып жатпайды. 
Пайымдауға негізделген шешім- бұл білімге немесе жинақталған 
тəжірибеге негізделген таңдау. Пайымдау негізінде шешімді тікелей 
басшының өзі қ абылдайтындықтан, оны қабылдаудың біршама 
артықшылықтары бар. 
Шешімді жасау процесі үш негізгі кезеңнен тұрады: шешімді əзірлеу, 
қабылдау жəне жүзеге асыру. 
Шешім қабылдау процесі кезекті кезеңдер қатарынан тұрады, 
циклдерді қалыптастыра отырып, тікелей немесе кері байланыстар ретінде 
бір-бірімен біріктірілуі мүмкін. 
Шешімді өңдеу жəне қабылдау процесі кезеңдердің келесі 
кезектілігінде іске асырылады: 
1. Проблеманы қалыптастыру жəне негіздеу, 
2. Шешім қабылдау үшін шектеулер жəне критерийлерді 
қалыптастыру, 
3. Шешімнің мүмкін варианттарын қалыптастыру жəне тандау 
4. Шешімнің ең жақсы вариантын тандау. 
Шешімдер варианттарын салыстыру нəтижесі бойынша алдыға 
қойылған мақсаттарға неғұрлым тиімді жетуді қамтамасыз ететін, нақты 
жағдай үшін мақсатты вариант таңдалады. Шарт бойынша бұл проблема 
жөніндегі шешім қабылдау болып табылады. 
Жағдайдың қалыптасу сипатына қарай қабылданатын басқару 
шешімінің де өзіндік типі болады. Жағдайды дер кезінде бағалау жəне 
дұрыс түсіну көбінесе басқару шешімін қабылдау шешіміне байланысты. 
Дұрыс шешім қабылдау жеткілікті, əрі айқын мəліметтер болғанда ғана 
мүмкін болады. 
Қабылданатын шешімнің нəтижелік критерийін таңдау- күрделі, əрі 
жауапты кезең. Критерий дегеніміз- қабылданатын шешімнің əр түрлі 
варианттарының тиімділігін салыстыруға мүмкіндік беретін көрсеткіш 
немесе бірнеше көрсеткіш.  
Мақсатты тұжырымдау мен критерийді таңдау арасында басқару 
шешімі үшін əрқашанда тікелей байланыс болуы керек.  
Ми шабуылы тəсілі- бұл эксперттер негізінде жəне мəселедегі əр түрлі 
көзқарастарды ескере отырып мəселені дəл тұжырымдау, оны шешу 
амалдарын қарастыру. 
Шешім қабылдауға бейсананың əсері. 
Шешім қабылдау тек ғана саналы негізде ғана емес, сонымен қатар 
белгілі бір деңгейде бейсаналы деңгейде де жүреді. Адам барлық уақытта 
өзінің əрбір əрекетін айқын түрде түсіндіріп бере алғанымен неге басқадай  
емес дəл осылай жасағанын əр уақытта біле бермейді. Бұл феноменді XIX 
жəне XX ғасыр тоғысында австрия психологы З.Фрейд ашқан болатын. Ол 

біздің көптеген бейсаналы əрекеттеріміз өз «Менін» психологиялық қорғау 
нəтижесінде болады деп түсіндіреді. Ол неге болады? Қалыпты өмір сүру 
үшін адам өзін жеткілікті түрде жақсымын деп есептеуі керек, сондықтан 
адам өзінің кез келген соның ішінде ең жаман деген қылықтарын ақтауға 
тырысады. Тіпті адам өлтіруші болған жағдайда өзін емес осы əрекетке 
итермелеген құрбанды кінəлəйді. Тұлға өзінің əрекетін өзі қорғайды. 
Сипатталған психологиялық қорғаныс механзмдерін З.Фрейд пен оның 
қызы Анна түсіндірген болатын. Психологиялық қорғаныс адамның мінез-
құлқы өз ойындағыдай, өзін қалай ұстау керек екендігін елестеткендей 
болмаған жағдайда қосылады.  
Психологиялық қорғаныс өте көп, əр адам өзінікін таңдайды, бірақ 
классикалық түрлері болып келесілер есептелінеді: 
1.Рационализация. Адам өз əрекетін өзінікі дұрыс деп есептеуіне  
байланысты түсіндіреді. Егер қызметшіге дауыс көтерсе, ол басқалай 
түсінбейді деп ақталады. 
2.Репрессия. Адам өзінің  жағымсыз да жағымды да эмоцияларының 
шығуына тиым салады. Мысалы басшы қызметкерге ашулы болса да оған 
дауыс көтермейді, ал қорқыныш бейж айлылық бейнесінің астында 
жасырын қалады. Бірақ бұл эмоциялар ешқайда кетпейді, ол бəрібір адамды 
мазалайды, тіпті физикалық ауырпашылықтар əкеледі. 
3.Регрессия. Бұл қорғаныс мінез-құлықты еріктік бақылаудың əлсіреуі 
жағдайында пайда болады. Адам жауап қайтарудың анағұрлым қарапайым 
түрлерін жəне балаларға тəн түрлерін таңдайды: жылайды, дауыс көтереді, 
төбелеске ұмтылады, өзінің мəселесі жайлы өзгелерге шағымданады. 
4.Жоққа шығару. Адам мəселені шешудің орнына мəселе жоқ деп 
хабарлама жасағанда пайда болатын. Басшының  бейсаналы түрде өзінің 
шығармашылық деңгейіне, құзыреттілігіне деген алаңдаушылығы өзінің 
қызметкерлерін интенсивті түрде жұмыс жасауға итермелейді. 
5. Оқшаулану. Қатты стресс жағдайында пайда болады, адам болып 
жатқан жағдайға сырттан қарайды, өзінің басынан өтіп жатпағандай, бұл 
бір қорқынышты түстей, жақын арада аяқталатындай көрінеді.  
6. Реактивтивті пайда болулар бір нəрсеге қолы жетпейтінін түсінген 
адам тура қарама-қарсы бағытта əрекет ете бастағанда пайда болады. Кейде 
реактивті пайда болулар керсінше адамды итермелеуші күшке қарама -
қарсы жасау тенденциясында пайда болады. 
7. Проекция немесе бұл қорғаныс түрін «проекция феномені» деп те 
атайды. Белгілі бір жобамен айналысушы басшы өзінің қажеттіліктерін, 
сезімдерін, қызығушылықтарын, ойлары мен тіпті мінез сипатын басқа 
адамдармен ұқсас деп ойлауы. 
8. Сублимация. Жиі жағдайда қол жетпейтін мақсат басқасымен, 
шынымен атқарылған əрекеттен қанағаттанарлық əсер алатын мақсаттарға 
ауысқанда көрініс табады.  

Психологиялық қорғаныс мəселені шешу процессі кезінде көрінеді, 
осы процесске енеді, оны күрделендіреді, кейде тіпті  өзгертуі мүмкін. Бірақ 
бұл – оны жеңіп шығуға болатын, ұжымдық пікірмен сақтандыруға болатын 
индивидуалды мəселе. Өзгертуші əсерлер, оның үстіне саналы т үрдегі 
нақты адамдар əсер ететін болса, онда ол басқа мəселе.    
5. Шешім қабылдау процессі кезінде адамдардың бір-біріне əсер етуі 
Адамдардың бір-біріне əсер етуінің негізгі үш механизмі бар: 
хабарлама, сендіру, иландыру. 
Хабарламада əсер етуші ақпараттың  өзі болып табылады, оны 
қабылдаған адам өзінің мінез-құлқын түзейді, пікірін қалыптастырады, 
берілген ақпараттың негізінде тиісті шешімді қабылдайды.  
Сендіру кезінде  адам ақпаратты құндылықтардың, ұстанымдардың 
жəне басқа ададардың өзгеруіне əсер ететін дей етіп ұйымтастырып 
ұсынады. Бұл жағдайда дəлелдер жүйесін немесе растаушы мəліметтерді 
келтіреді немесе беделді адамдар пікіріне жүгінеді.  
Шешім қабылдау үшін ең  қауіпті иландыру арқылы əсер ету болып 
табылады. Олар əртүрлі болуы мүмкін. Иландыру элементтері кез келген 
коммуникацияда бар: бұл имидж жəне материалды беруді ұйымдастыру 
еркешелігі, сонымен қатар қарым-қатынастың вербалды емес құралдары  
жəне т.б.  
Манипуляция түсінігінің негізінде адресаттан жасырын, оның қандай 
да бір затқа деген қарым -қатынасын өзгерту, шешім қабылдау мен 
əрекеттерді орындауына ықпал ету арқылы матипуляциялаушы адам өз 
мақсаттарына жетуі жатыр. Адам қуыршақ (марионетка) сияқты əрекет 
етеді, оны қуыршақ ойнатушы əртіс басқарып отырғандай болады. 
Манипуляцияның міндетті шарты, сырттан енгізбей адресаттың өз бетінше 
шешім қабылдауын сақтау. Сонымен қатар адресат өз іс -əрекетіне 
жауапкершілікті өз мойнына алады. 
Манипуляцияның психологиялық негізі қандай? Ф.Перлздің айтуы 
бойынша, біздің əр қайсысымызда екі бастау бар, оларды шартты түрде 
«үстіндегі ит» жəне «астындағы ит» деп атайды. «Үстіндегі ит» бұл 
белсенді бастау, бұйыруға, бағындыруға бедел арқылы қысым жасауға 
ұмтылудан көрініс табады. «Астындағы ит» бұл пассивті бастау, біздің 
бағынуға, келісуге, біреудің сөзін тыңдауға деген қажеттіліктерімізден 
көрінеді. Осы бастаулардың əрқайсысы немесе манипулятивті немесе 
шығармашылық сипатта көрініс табады.  
Э. Шостром манипуляцияның негізгі сегіз сызбасын ұсынды. Оның 
айтуы бойынша, біздің əрқайсысымызда манипулятор отыр, тіпті  бірнеше 
типі бірақ олардың біреуі басым болады. 
1. Диктатор. Ол əлбетте өз күшін асыра бағалайды, басымдылық етеді, 
бұйрық береді, беделді тұлғаларды дəйектейді, қысқасы басқару үшін 
құрбанына барлығын жасайды. Диктатордың өзге түрлері: бастық, босс, 
кіші құдайлар жəне т.б.  

2. Жігерсіз (ерік күші төмен адам). Диктатордың құрбаны, оған тікелей 
қарама-қарсы адам. Жігерсіз диктатормен өзара қарым -қатынасқа түсу 
арқылы  үлкен шеберлілікті дамытады. Ол өзінің сезімталдылығын асыра 
сілтейді. Оларға тəн сипаттар: ұмыту, естімей қалу, пассивті түрде үндемеу. 
Жігерсіздердің өзге түрлері: күмəндəнғыш, ақылсыз, құбылмалы, 
конформист, ұялшақ, шегінуге бейім.  
3. Калькулатор. Бəрін жəне барлығын бақылауда ұстау қажеттілігін 
тым арттырады. Ол алдайды, өтірік айтады, жалт арады, бір жағынан 
айласын асыруға, бір жағынан басқа жолға салуға тырысады. Өзге түрлері: 
епті (пысық), аферист, покер ойнаушы, жарнама жасаушы, бопсалаушы. 
4. Жабысқақ. Калькулаторға полярлы қарама -қарсы адам. Өзінің 
тəуелділігін бар күшімен асыра сілтейді. Бұл тұлға, қамқорлылықтың заты 
болуды аңсайды. Пайдалануға да мүмкіндік береді, өз жұмысын өзгелердің 
орындауларына мəжбүрлейді. Өзге түрлері: паразит, қыңқылдауық, мəңгі 
бала, ипохондрик, біреудің асырауындағы жан, қорғансыз. 
5. Бұзақы. Өзінің агрессивтілігін, зұлымдығын, ізгіліксіздігін асыра 
сілтейді. Əр түрдегі қауіп көрсетудің көмегімен басқарады. Өзге түрлері: 
балағаттаушы, жек көруші, гангстер, қауіп төндіруші.   
6. Сүйкімді жігіт. Өзінің қамқорлығын, махаббатын, көңіл бөлушілігін 
асыра сілтейді. Ол мейірімділігімен көзге түседі. Кей мағынада онымен 
жолығу бұзақымен жолыққаннан да қиындау. Сіз сүйкімді жігітпен 
күресуде жеңе алмайсыз. Қызық жайт, кез келген бұзақы мен сүйкімді жігіт 
арасындағы конфликтіде бұзақы жеңіліс табады. Өзге түрлері: жағымпаз, 
ізгі істі, моралист, ұйымшыл адам.   
7. Сот. Өзінің сыншылдығын асыра сілтейді. Ол ешкімге сенбейді, 
күнəға, наразылыққа толы, кешіруі қиын. Өзге түрлері: бəрінбілгіш, 
күнəмшіл, айғақ жинаушы, масқаралайтын, бағашыл, кекшіл, күнəсін 
мойындауға мəжбүрлегіш. 
8. Қорғаушы. Сотқа қарама-қарсы адам. Ол өзінің қолдау көрсете алуы 
мен қателіктерге жұмсақтығын асыра сілтейді. Ол өзінің шамадан тыс 
аяушылдығы мен өзі қорғаушы адамның өз аяғына тұрып, өз бетінше өсуіне 
мүмкіндік бермеуі арқылы басқаларды бұзады. Өз ісімен айналысқанның 
орнына басқалардың қажеттілігі жайлы көбірек ойлайды. Өзге түрлері: 
балапан басқан тауық, жұбатушы, қамқоршы, азап шегуші, көмекші, 
жанкешті. 
Манипуляцияның түрлерін талқылап болған соң, енді олардың қалай 
əсер ететіндігін қарастырайық. Э.Шостром манипуляторлы жүйенің төрт 
типін бөліп көрсетті: 
1.Белсенді манипулятор басқаларды белсенді əдістер көмегімен 
басқаруға тырысады. Ол ешқашан да өзінің əлсіздігін көрсетпейді, керсінше 
өте күшті, жігерлі адамның ролін ойнайды. Ережеге сай, бұл адам өзінің 
əлеуметтік статусын немесе дəрежесін қолданады: ата-ана, аға сержант, 
мұғалім.  

2.Пассивті манипулятор – белсендіге қарама-қарсы. Ол қорғансыз, 
аңқау күй танытады. Ол кезде белсенді манипулятор жеңіс табады. Бірақ 
пассивті манипулятор өз есебінен белсенді манипуляторға ойлап жəне 
жұмыс жасауға мүмкіндік бергендіктен олда жеңіске жетеді, себебі 
белсенді манипулятордың жұмысы тікелей пассивті манипулят ордың 
көмегімен жүзеге асады. 
3.Жарысушы манипулятор өмірді тоқтаусыз турнир ретінде, онда 
үнемі «жеңіс» пен «жеңіліс» тізбегі таусылмайды деп қабылдайды. Ол үшін 
өмір – бітпес күрес, ал адамдар – бір біріне шынай немесе потенциалды 
қарсыластар тіпті жаулар. 
4.Селқос манипулятор. Ол немқұрайлылық пен салғырттықта 
ойнайды. Кетіп қалуға, конфликтен алшақтауға ұмтылады. Оның девизі 
«маған бəрібір». Оның əдістері бірде пассивті, бірде белсенді. 
Э.Берннің ойынша, манипуляцияның көптеген түрлері ойынға 
туыстас. Ойын – психологиялық маневр, мақсаты басқа адамның тарапынан 
қанағаттану сезімін алу. Психологтардың ойынша мұндай ойындар еңбек 
ұжымына сипатты. 
Басқару шешімдерін қабылдауда аталған манипуляциялардың 
жағымсыз əсерлері кейді қақтығыстар туғызуы мүмкін . Латын тілінен 
аударғанда «конфликт» термині қақтығысты білдіреді. Осы жалпылама 
мағынада бұл термин психологиялық əдебиеттерде де қолданылады. 
Сонымен бірге, психологияда қақтығыстың табиғаты туралы 
бірыңғайланған, белгілі бір көзқарас жоқ екенін атап өткен жөн. Бұл жағдай 
жеке тұлғаның құрылымына, адамның табиғатына көзқарастардың 
өзгермелілігіне байланысты. Концептуалды негіздемелердің алуан түрлілігі 
осы ұғымның көптеген басқа түсіндірмелерін туындатады: қақтығысты 
Мен, Ол жəне Менмендік арасындағы шешілмейтін антагонизм ретіндегі 
психоаналитикалық түсіндіруден бастап (З.Фрейд) қақ тығысты 
құндылықтар дəмесін қанағаттандыруға қажет ресурстар үшін күрес 
ретінде түсінуге дейін. Қақтығыстардың көптеген жіктемесінің 
негіздемелері мыналар болып табылады: болу сипаты, көрініс табатын түрі, 
қақтығыс көзі, мазмұны, маңыздылығы, шешу түрі, білдіру формасы, өзара 
қарым-қатынас құрылымының түрі, əлеуметтік нəтиже жəне басқалары. 
Түрлерінің алуандығына қарамастан, қақтығыстардың өту 
кезеңдерінің шартты ортақ нəрсесі бар:  
қарама-қайшылықтар пайда болды, бірақ оларды өзара іс -қимыл 
қатысушылары əлі де мойындамайды;  
• қатысушылар позициялардың антагонизмін түсінеді;  
• қақтығысты əрекеттер; 
 • қақтығысты аяқтау (жою немесе шешу). 
 Кəсіби қызмет əртүрлі мақсаттар мен мүдделердің ерекше өткір 
қарама-қайшылығымен, ресурстарды бөлудегі теңсіздікпен (оның ішінде 
билік құзыреті) жəне олар үшін күреспен сипатталады, сондықтан мұнда 

қақтығыстар ең өткір жəне айқын көрініс табады. Мұндай қақтығыстарға 
тəн белгі-қосарлылық, өйткені олар деструктивті жəне конструктивті 
функцияларды орындай алады. Ғалымдардың пікірінше, қақтығыстар жай 
ғана қажет нəрсе емес, олар ұйымға пайдалы, өйткені олар оның тиімділігін 
арттыруға алып келеді. Қақтығыстардың алдын алу немесе басқаруға 
қатысты басшының  қызметі олардың пайда пайда болу себептерін 
(көздерін) білмеген кезде сəтті бола қоймайды. Басқару психологиясының 
өкілі Р. Л. Кричевский қақтығыстарды тудыратын себептердің үш негізгі 
тобын атап өтеді: бірінші топ іс - əрекет процесімен байланысты, екіншісі 
адами қатынастардың психологиялық ерекшеліктерімен байланысты, 
үшінші топ топ мүшелерінің жеке ерекшелігімен байланысты.  
Басқару социологиясы тұрғысынан С. С. Фролов осындай төрт 
себепті бөліп көрсетеді:  
• ұйым мүшелерінің (жеке қызметкерлер немесе əлеуметтік топтар) 
мотивтерінің айырмашылығы немесе қиылысы; 
 • жеке жəне топтық құндылық бағдарларындағы айырмашылықтар;  
• сыйақыны бөлудің немесе əлеуметтік қатынастардың қабылданған 
немесе саналы əділетсіздігі; ұйымның құрылымдық бөлімшелерінің 
мəртебелік немесе рөлдік қанағаттанбаушылығы.  
Менеджерлік əдебиетте қақтығыстарды туындататын себептерді 
мынадай топтарға бөледі: ресурстарды бөлу, міндеттердің өзара тəуелділігі, 
мақсаттардағы, идеялар мен құндылықтардағы, мінез-құлық пен өмірлік 
тəжірибелердегі айырмашылықтар, қанағаттандырмайтын байланыстар. 
Қорытындылай келе, əр көзқараста қақтығыстың пайда болу көздері 
(алғышарттары) ретінде А бөлімінде қарастырылға н психологиялық 
қасиеттер мен жеке қасиеттерді бөліп қарастыратынын атап өтеміз. 
«Басшы-бағынышты» қақтығысы ерекше назар аударуға тұрады. 
Зерттеушілер (А.Я. Анцупов, А. B. Шипилов жəне т. б.) мұндай 
қақтығыстардың көздерін түрге бөлу кезінде дəстүрлі түрд е бірлескен 
қызмет процесіне байланысты объективті жəне субъективті себептерді 
ажыратады. Алайда, субъективті себептердің алуан түрлілігін 
конфликтогендік əрекеттердің үш түрінің біріне дейін азайтуға болады: 
артықшылыққа ұмтылу, агрессивтілік жəне өзімшіл діктің көрінісі. 
Теоретиктердің де, практиктердің де пікірінше, қақтығыс шешімін 
қақтығысты жағдайды өзгерту арқылы табу керек. Өзгерту əдістері əртүрлі 
жəне көбінесе қақтығыстардағы мінез -құлық стиліне байланысты. 
К.Томастың, Р.Килменнің қақтығыстардағы м інез-құлық стильдерін 
жалтару, бейімделу, бəсекелестік, ымыра жəне ынтымақтастық деген түрге 
бөлулері барынша танымал. Бірқатар тəжірибешілер тағы екі стратегияны 
бөліп көрсетеді: басу жəне келіссөздер. Қазіргі уақытта қақтығыстардың 
алдын-алу мен шешудің кең таралған тəсілі медиация болып табылады 
(теңгерімді баламаларды таңдау мүмкіндігі, жанжалды өзара тиімді аяқтау 
үшін ымыралы шешімдер). Қақтығысты басқарудың тиімділігі мен 

конструктивтілігі жанжал жағдайындағы адам мінез-құлқының моделі мен 
детерминантына байланысты екенін атап өткен жөн. Мінез-құлық үлгісі (Е. 
Мелибурда, В.Зигерт жəне Л. Ланг) қақтығысты қабылдаудың ақылға 
қонымдылығы, ашықтық жəне адалдық сияқты факторларды қамтиды 
Власова Н. М. былай деп бөледі:   позитивті жүріс -тұрыс, психика 
жұмысының ұтымды тəртібі, теріс эмоционалды əсерге реакцияның 
болмауы, шағымдарды қалыптан шықпай негіздеу, қалыптасқан жағдайдан 
қалай шығуды бірлесіп іздеу, қарсыластың қылықтарын емес əрекеттерін 
бағалау, қабылданған уағдаластықтарды ресімдеу жəне т.б. Емельянов C. 
V.төрт сатылы алгоритмді ұсынады: қақтығыстың себептерін зерттеу, 
қатысушылардың санын шектеу, қосымша талдау жəне онда əр қадам 
мақсатқа жетудің нақты тəсілдері мен əдістеріне сəйкес келетін шешімдер 
қабылдау. Қақтығыс тараптарының қарым-қатынасы мен байланысын 
ескере отырып, басшы ойлау стилінің типологиясын (А. Харрисон, Р. 
Брамсон) жəне оларға сəйкес мінез-құлық реакцияларын түсінуі керек, 
өйткені қарым-қатынас кезінде өзара түсіністік пен өзара əсер ету əдістері 
көбінесе басым түсетін ойлау стиліне байланысты жəне əр қақтығысушы 
тарап жағынан барынша айқын көрініс табады. Олардың өкілдерінің ойлау 
жəне мінез-құлқының бес стилі бар: синтезатор, идеалист, прагматик, 
аналитик, реалист. Іс жүзінде басқарушы қақтығысқа тап болған кезде оның 
қатысушыларын ғылыми əдебиетте көрсетілген қандай да бір түрге жатқыза 
алмайды. Басшы олардың қақтығыс тараптарының жеке бас  
ерекшеліктерімен немесе табиғатымен байланысты   туындайтын 
қарсылықты сезіне алады. Бұл жағдайда  жанжалшыл немесе қиын адамдар 
туралы сөз болып отыр.  
Жанжалшыл тұлғаларының типологиясы (В. П. Шейнов бойынша):  
• қылықты-əрдайым назарда болуға, табысты болып көрінуге 
талпынады, осылай көзге түсу үшін қақтығысқа түседі, * қаттылық-өршіл, 
өзін — өзі жоғары бағалайтын, қалыптасқан пікірі өзгеретін жағдайларға 
қайшы келген кезде қақтығысқа түседі; басқарылмайтын — импульсивті, 
болжау мүмкін емес, өзін-өзі бақылаудың төмен деңгейімен сипатталады;  
• аса тиянақты-сыртқы, əсіресе басшылық тарапынан  бағалауға өте 
сезімтал адал қызметкерлер. Олар бəрін (ең алдымен өздерін) жоғары 
талаптар тұрғысынан бағалауға бейім, ал оларға (талаптарға) жауап 
бермейтін адамдарды қатаң сынға алады; • рационалистер — ақылды, жеке 
мақсаттарға жету үшін əрдайым қақтығысқа түсуге дайын;  
• ерік-жігері əлсіздер — өздерінің принциптері мен сенімдерінің 
болмауына байланысты əсер ету жəне манипуляцияларға ұшырайды. 
«Рационалистер» жəне «ерік-жігері əлсіздер» - «жағдайға қарайтын» типтер 
болып табылады, яғни белгілі бір қақтығысты жағдай туындағанда ғана 
көзге түседі, қалған типтер қақтығысты өздері бастайды.  

Р.Брамсон «Общение с трудными людьми» еңбегінде мынадай 
түрлерге бөледі: озбыр, шағымшыл, ашулы бала, максималист, үндемес, 
жұмбақ кек алушы, жалған альтруист, үнемі айыптаушы.  
В.Ратников ұсынған типологиясы қызығушылық тудырады: 
• бумен жүретін каток - өзіне əркім мойынсұнуы тиіс деп ойлайтын, 
өзгелердің пікірімен санаспайтын, айналасындағылармен үнемі 
қақтығысып жүретін оспадар жəне дөрекі адам;  
• жасырын агрессор (снайпер) - адамдарға сахна сыртындағы айла - 
амалдар, шағып сөйлеу, агрессияның жасырын көріністері арқылы 
қиындық туғызады;  
• үндемес - оның жымысқылығының, жабықтығының себептері 
белгісіз, жанжалдың пайда болуы тұрғысынан əлеуетті қауіп төндіреді; • 
жарғыш, немесе ашулы бала-күтпеген жерден ашуға беріледі, жарылады, 
сондықтан жағымсыз жағдай тудырушы болып табылады;  
Конфликтологияның негіздері жəне қиын адамдармен қарым - қатынас  
• өте икемді-қарым-қатынаста қиындықтар туғызбайды, əрқашан 
бəріне жолын береді жəне кез-келген істе көмектесуге уəде береді, бірақ 
уəделерді орындамайды, өйткені оның бəрін орындауға күші де, уақыты да 
жоқ. Əңгімелесуші жанжалшыл немесе "қиын" адамдардың қандай түріне 
жататынын анықтап, басшы ұйым шешетін міндеттердің мүдделері үшін 
оған тиімді ықпал ете алады. 
 
Бекіту сұрақтары: 
1. «Басқару шешімі» терминінің мəнін ашыңыз. 
2. В.Лисичкин атаған тəсілдердің үш класын көрсетіңіз. 
3. Э.Шостром жасаған  манипуляторлы жүйенің төрт типін атаңыз. 
4. Жанжалшыл тұлғаларының В. П. Шейнов бойынша типологиясын 
жіктеңіз. 
 

`},{id:"lecture-10",category:"lecture",shortTitle:"10-дәріс",title:"§ 10 Басқару іс-әрекетіндегі перцептивтік процестер",pdfFile:"./assets/docs/10sabak.pdf",numPages:6,textHtml:`<h3 class="chapter-subheading">§ 10 Басқару іс əрекетіндегі перцептивтік процестер Қатынасу, тілдесу – қатысушының екеуіне де ақпараттың түсініктілік шарты орындалған кезде бір қатысушыдан екінші қатысушыға ақпаратты жеткізудің екі жақты процесі; екі немесе одан да көп адамдардың əлеуметтік-психологиялық өзара əрекет ету процесі. Коммуникация (лат. Communication байланысамын, катынасамын) (катысым) – адамдардың танымдык-еңбек процесінде катынас жасау, пікір алысу, ой бөлісу – олардың бір-бірімен əрекет жасауының айрықша формасы болып табылады. Адамзаттық коммуникацияның хайуанаттар коммуникациянан басты ерекшелігі – оның тіл арқылы жүзеге асырылатындығында. Коммуникация типтері • интратұлғалық коммуникация – intrapersonala communication – дегеніміз тұлғаның жеке ойлауы, яғни, адамның өз-өзіне сөйлесуі; • тұлғааралық коммуникация – interpersonal communication – екі адам арасындағы əңгіме; • топтық коммуникация – group and team communication – шешім қабылдау барысында туындайтын, арасында өздерінің лидері бар шағын топ; • қоғамдық коммуникация – public communication – ресми түрде тұлғаның қоғам алдында тұрып сөйлеуі; • ұжымдық коммуникация – organizational communication – жұмыс бабына байланысты туындайтын əріптестер арасындағы коммуникация; • ақпараттық коммуникация – mass communication – ақпарат құралдары мəдени құндылықтарға қатты əсер етеді, мəселен, қыз балалардың киіну стильдері; • тұлғалық жəне əлеуметтік ақпараттық құралдар – personal and social media – техниканың дамуына байланысты ақпараттық құралдар адамдар арасындағы коммуникацияны одан əрі жақсарта түсті, мəселен, ғаламторда қоғамдық желілерді қолдану арқылы адамдар тез əрі тиіммді түрде коммуникацияға түсе алады; • мəдениетаралық коммункация – intercultural communication – екі түрлі мəдениет иесінің арасындағы қатысым. Лорета коммуникацияның үш түрлі үлгісін көрсетті: o Сызықты үлгі – linear model. 1948 ж. Харолд Ласвел коммуникацияның сызықты түрін анықтады: кім айтты – нені — қандай жолмен – кімге — қандай нəтижемен айтылды? Бірақ 1979 ж. Клаудио Шанон мен Варен Вивер бұл үлгіні өңдеп, дыбыстық коммуникацияны қосты, себебі адам сөйлегенде интонация арқылы адамның ойын түсінуге болатындығын дəлелдеді.</h3>
<p>o Өзара белсенді үлгі – interactive model. 1955 ж. Вилбур Шрам коммуникацияның екінші үлгісін бейнеледі, егер адам коммуникацияға түскенде ақпаратты алып қана қоймай, оған кері жауап қайтарады. o Транзакциялық үлгі – transactional model. Коммуникацияның екі үлгісінің болғандығына қарамастан, 1997 ж. Ж. Т. Вууд үшінші үлгіні ойлап тапты. Вуудтың айтуынша коммуникация алма кезек болуы мүмкін емес, яғни бірінші адам сұрап, екінші адам жауап қайтарумен шектелмейді. Сонымен қатар, адам коммуникацияға түскенде бірін бірі күтпей сойлесе береді. Сондай-ақ, мұнда сыртқы дыбыстық əсерлер коммуникацияның мазмұнының өзгеруіне əсер етеді. Демек, коммуникативтік актіде белгілі бір мазмұны бар информацияны тіл арқылы алып-беру əрекеті іске асады, демек, қараым -қатынас барысында информация А есімді коммуниканттан Б -ға көшіп, керісінше, Б А-ға жауап қайтару немесе лебізін айту кезінде ауысып отырады. Коммуникациялық кедергілердің түрлері: Ø Фонетикалық кедергі адамдар əр түрлі тіл де, диалектте, не сақауланып сөйлегенде пайда болады. Сөйлеушінің тілі реңкі жоқ, тез, жаңылтпаш, қажетсіз сөздерге толы болған кезде де, түсініспеушілік кедергісі туындайды. Ø Семантикалық кедергілер жаргон мəселесімен тығыз байланысты. Ортақтсуға қатысушылардың өзіндік шағын мəдениеттерінде ұғымдар мен құбылыстардың ерекше мəн-мағынасы болады. Ø Стильдік кедергі – коммуникатор мен реципиенттік тілдік стильдері бір-біріне не тілдің стилі ортақтасу жағдайына, реципиенттік көңіл- күйіне сəйкес келмеуі. Ø Логикалық кедергілер – сөйлеушілер мен тыңдаушының қабылдау логикасы, дəлелдеу жүйесі əртүрлі болғанда пайда болатын. Қоғамда логикалық жүйелер өте көп. Перцепция немесе қабылдау-бұл сезім мүшелеріне тікелей əсер ету кезінде объектілерді немесе құбылыстарды бейнелеу процестері. Перцептивті процестер басқару қызметі үшін кəсіби маңызды ақпаратты қабылдауды қамтамасыз етеді. Қабылдау түрлері қандай анализатор (сезім органы) жетекші рөл атқаратындығына байланысты болады — визуалды, есту, жанасу, мотор (кинестетикалық), иісті, дəмді. Материяның тіршілік ету формасына байланысты кеңістікті, бағытты, шаманы қабылдау (мұнда өз кезегінде форманы, қашықтықты, тереңдікті, перспективаны жəне т.б. қабылдау ерекшеленеді) жəне уақытты қабылдау ерекшеленеді. Қабылдау күрделілік өлшеміне, оның процесінің егжей — тегжейіне байланысты бөлінеді: бір мезгілде ("бір сəтте", лезде) жəне сабақтастық (микро кезеңдерге салыстырмалы түрде бөлінген), хабардарлық дəрежесі бойынша-ерікті жəне еріксіз қабылдау.</p>
<p>Қабылдау бірқатар негізгі қасиеттерге ие: • Объективтілік • Тұтастық • Құрылымдық • Мағыналық • Селективтілік • Тұрақтылық • адамның өткен тəжірибесіне тəуелділік (апперцептивтілік) • Шектеулі көлем. Қабылдау процесі бір-бірін алмастыратын бірқатар кезеңдерді (қабылдау кезеңдерін) қамтиды: анықтау, ажырату, сəйкестендіру, санаттау, тану, тану. Барлық осы түрлер, қасиеттер, фазалар, заңдылықтар сыртқы ақпараттың барабар жəне мағыналы, объективті жəне құ рылымдық көрінісін қамтамасыз ететін 2 басқару қызметінде сақталады. Олар көшбасшының сенсорлық тəжірибесін қалыптастыру механизмдерін құрайды. Мысалы, сыртқы жағдайдың маңызды ерекшеліктерін анықтауды қамтамасыз ететін қабылдаудың селективтілігі үлкен рөл атқарады. Құрылымдық қасиет бірдей маңызды, бұл сізге біртұтас (панорамалық) мүмкіндік береді, бірақ сонымен бірге жағдайларды ішкі тəртіппен қабылдауға мүмкіндік береді. Апперцептивтілік қасиеті қабылданған ақпаратты кəсіби жəне жеке тəжірибемен үнемі «байланыстыруды», сондай — ақ оны «декодтау» - декодтауды қамтамасыз етеді. Басқарушылық қызметте қабылдаудың жеке стильдік айырмашылықтары маңызды рөл атқарады. Екі негізгі стиль бар — Аналитикалық жəне синтетикалық жəне екі қосымша — аналитикалық- синтетикалық жəне эмоционалды. «Синтетика» құбылыстарды жалпылама бейнелеуге жəне олардың жалпы, негізгі мағынасын анықтауға бейімділікпен сипатталады. "Талдаушылар", керісінше, бөлшектерді, бөлшектерді, бөлшектерді бөлуге бейімділікпен сипатт алады. Аналитикалық жəне синтетикалық тип осы ерекшеліктердің үйлесімімен сипатталады, алайда екеуінің де ауырлығы аз. Эмоционалды тип жағдайға сезімтал реакцияның жоғарылауымен сипатталады, бұл, əдетте, оның тиісті қабылдауына кедергі келтіреді. Басқарушылық қызмет үшін ең жақсы нəрсе-бұл үшінші, аналитикалық жəне синтетикалық, қабылдау түрі; алғашқы екеуі аз тиімді; төртіншісі басшылыққа қарсы əрекет етеді Қабылдау стилі Сипаттамасы</p>
<p>Синтетикалық Құбылыстарды жалпылама бейнелеу жəнеолардың жалпы, негізгі мағынасын анықтау Аналитикалық Құбылыстарды қабылдау кезінде оқшаулау үрдісі Аналитикалық синтетикалық Ол осы ерекшеліктердің үйлесімімен сипатталады Эмоционалды Сезімталдықтың жоғарылауымен сипатталады Қорытындылай келе, қабылдаудың жалпы сипаттамаларының ішінде байқау сияқты маңызды жеке ерекшелікті атап өту керек. Бұл қабылдаудың жалпылама сипаттамасы, оның барлық басқа ерекшеліктерінен алынған. Ол таңдамалы, ерікті, мағыналы жəне жағдайдың маңызды ере кшеліктерін ескере отырып, өткен тəжірибе негізінде бағалаумен байланысты. Басқарушылық қызметке қатысты жай ғана байқау туралы емес, маңызды басшы ретінде «күрделі байқау» (Б.М. Теплов) туралы айту əдетке айналған. Басқарушылық қызметтегі перцептивті процестердің ерекшелігі екі негізгі жағдаймен анықталады. • Біріншіден, қабылдау барлық басқа танымдық процестермен (ең алдымен жадымен, ойлауымен) тығыз байланысты, бұл оның жоғары болуымен (кəсіби басқару тəжірибесіне байланысты) көрінеді. Ол, шын мəнінде, олармен біріктіріледі жəне тек ақпарат қабылдау ретінде ғана емес, сонымен бірге оны бағалау, түсіну, оған деген көзқарасты қалыптастыру ретінде əрекет етеді. Басқарушылық қызметтің кешенді сипаты оған барлық танымдық процестердің синтетикалық қатысуын барынша талап етеді. • Екіншіден, басшының қызметіндегі қабылдаудың" материалы " өте ерекше. Қабылдау туралы ақпарат - бұл сыртқы əлемнің объектілері емес (əрине, олар да), сонымен қатар субъектілер - олардың қасиеттері, белгілері, қасиеттері, ниеттерінің əртүрлілігі мен сəйкессіздігінде жеке тұлғалар. Осылайша, көшбасшының іс - əрекетіндегі қабылдау, ең алдымен, жеке, субъективті (дəлірек айтқанда, тұлғааралық) қабылдау болып табылады. Қабылдау объектісі-бұл күрделі жəне нақты объект, оның параметрлері бойынша қабылдау субъектісіне ұқсас, ол «басқа адам». Сондықтан басқарушылық қызметтегі перцептивті процестердің</p>
<p>ерекшелігі, мұнда олар өздерінің ерекше түрінде - тұлғааралық қабылдау, əлеуметтік қабылдау ретінде əрекет етеді. Американдық психолог Дж. Брунер 1947 жылы «Əлеуметтік қабылдау» терминін басқа адамдарды, əлеуметтік топтарды жəне тіпті «үлкен əлеуметтік қауымдастықтарды», «əлеуметтік нысандарды» қабылдауды білдіреді деп ұсынған болатын. Əлеуметтік қабылдау құбылыстардың кең ауқымын оның сорттары қамтиды. Бұл, біріншіден, жеке қабылдау (адамның адамның қабылдауы). Бұл адамның қабылдағышпен бірдей топқа жататындығына немесе басқа топқа жататындығына байланысты («біреудің» құбылысы). Екіншіден, жеке адамның кейбір топтарды тұтастай қабылдауы, ол өзінің жəне басқа адамдардың топтарына қатысты да ерекшеленеді. Үшіншіден, бұл топтардың бір-бірін топ аралық қабылдауы, сонымен қатар топтың өзін-өзі қабылдауы деп аталады. Əлеуметтік қабылдаудың барлық осы түрлері басқарушылық қызметтің мазмұнына еніп, оның коммуникативті функциясының негізін құрайды. Алайда, олар тағы бір маңызды фактормен толықтырылады, бұл - қабылдау ерекшелігі қай жазықтықта орналасқанына байланысты бағыну немесе үйлестіру. Тұтастай алғанда, жетекшісінің бағыныштыларды қабылдауының келесі негізгі ерекшеліктері бар: 1) бағыныштының жалпы əсерін оның жеке сипаттамаларын іскерлік жəне жеке сипаттамаларын бағалауға ауыстыру («жалпылау əсері»); 2) көшбасшыны қолдайтын бағыныштылардың бағаларын жоғарылату; 3) басшыға ұқсас пікірін білдіретін бағыныштылардың бағаларын көтеру; 4) басшыны қолдамайтын жəне оның пікіріне қайшы келетін пікірлерін білдіретін бағыныстылардың бағаларын төмендету; 5) басшы өз тарапынан теріс баға алған адамдардан өзіне келіп түсетін ақпаратты бұғаттайды. Осыған байланысты тағы бір маңызды мəселе туындайды: ол басқаратын топ жетекшісінің өзін қабылдаудың жеткіліктілігі туралы. Бұл əсіресе тиімді көшбасшылық үшін өте маңызды, өйткені бірлескен қызметтің тиімділігі топ (ұйым) жетекшісі нің қаншалықты "қабылданғанына" байланысты. Шетелдік зерттеулерде көшбасшыны оның қол астындағылар қалай қабылдауы керек екендігі туралы өзіндік норматив əзірленді, оның қызметі тиімді болды: біріншіден, «біздің біріміз»; екіншіден, «көпшілігімізге ұқсас»; үшінші, «ең жақсысы»; төртіншіден, ол топ мүшелерінің үмітін қанағаттандыруы керек. Бекіту сұрақтары: 1. Коммуникация жəне қатынасу ұғымдарының мағынасын ашыңыз. 2. Коммуникация типтерін жіктеңіз.</p>
<p>3. Перцепция немесе қабылдау ұғымының мəнін ашыңыз. 4. Басқарушылық қызметтегі перцептивті процестердің ерекшелігіне тоқталыңыз.</p>`,rawText:`§ 10 Басқару іс əрекетіндегі перцептивтік процестер 
 
Қатынасу, тілдесу – қатысушының екеуіне де ақпараттың түсініктілік 
шарты орындалған кезде бір қатысушыдан екінші қатысушыға ақпаратты 
жеткізудің екі жақты процесі; екі немесе одан да көп адамдардың 
əлеуметтік-психологиялық өзара əрекет ету процесі. 
Коммуникация (лат. Communication байланысамын, катынасамын) 
(катысым) – адамдардың танымдык-еңбек процесінде катынас жасау, пікір 
алысу, ой бөлісу – олардың бір-бірімен əрекет жасауының айрықша 
формасы болып табылады. Адамзаттық коммуникацияның хайуанаттар 
коммуникациянан басты ерекшелігі – оның тіл арқылы жүзеге 
асырылатындығында. 
Коммуникация типтері 
• интратұлғалық коммуникация – intrapersonala communication – 
дегеніміз тұлғаның жеке ойлауы, яғни, адамның өз-өзіне сөйлесуі; 
• тұлғааралық коммуникация – interpersonal communication – екі 
адам арасындағы əңгіме; 
• топтық коммуникация – group and team communication – шешім 
қабылдау барысында туындайтын, арасында өздерінің лидері бар 
шағын топ; 
• қоғамдық коммуникация – public communication – ресми түрде 
тұлғаның қоғам алдында тұрып сөйлеуі; 
• ұжымдық коммуникация – organizational communication – 
жұмыс бабына байланысты туындайтын əріптестер арасындағы 
коммуникация;  
• ақпараттық коммуникация – mass communication – ақпарат 
құралдары мəдени құндылықтарға қатты əсер етеді, мəселен, қыз 
балалардың киіну стильдері; 
• тұлғалық жəне əлеуметтік ақпараттық құралдар – personal and 
social media – техниканың дамуына байланысты ақпараттық құралдар 
адамдар арасындағы коммуникацияны одан əрі жақсарта түсті, 
мəселен, ғаламторда қоғамдық желілерді қолдану арқылы адамдар тез 
əрі тиіммді түрде коммуникацияға түсе алады; 
• мəдениетаралық коммункация – intercultural communication – 
екі түрлі мəдениет иесінің арасындағы қатысым. 
Лорета коммуникацияның үш түрлі үлгісін көрсетті: 
o Сызықты үлгі – linear model. 1948 ж. Харолд Ласвел 
коммуникацияның сызықты түрін анықтады: кім айтты – нені — қандай 
жолмен – кімге — қандай нəтижемен айтылды? Бірақ 1979 ж. Клаудио 
Шанон мен Варен Вивер бұл үлгіні өңдеп, дыбыстық коммуникацияны 
қосты, себебі адам сөйлегенде интонация арқылы адамның ойын 
түсінуге болатындығын дəлелдеді. 

o Өзара белсенді үлгі – interactive model. 1955 ж. Вилбур Шрам 
коммуникацияның екінші үлгісін бейнеледі, егер адам коммуникацияға 
түскенде ақпаратты алып қана қоймай, оған кері жауап қайтарады. 
o Транзакциялық үлгі – transactional model. Коммуникацияның 
екі үлгісінің болғандығына қарамастан, 1997 ж. Ж. Т. Вууд үшінші 
үлгіні ойлап тапты. Вуудтың айтуынша коммуникация алма кезек болуы 
мүмкін емес, яғни бірінші адам сұрап, екінші адам жауап қайтарумен 
шектелмейді. Сонымен қатар, адам коммуникацияға түскенде бірін бірі 
күтпей сойлесе береді. Сондай-ақ, мұнда сыртқы дыбыстық əсерлер 
коммуникацияның мазмұнының өзгеруіне əсер етеді. Демек, 
коммуникативтік актіде белгілі бір мазмұны бар информацияны тіл 
арқылы алып-беру əрекеті іске асады, демек, қараым -қатынас 
барысында информация А есімді коммуниканттан Б -ға көшіп, 
керісінше, Б А-ға жауап қайтару немесе лебізін айту кезінде ауысып 
отырады. 
Коммуникациялық кедергілердің түрлері: 
Ø Фонетикалық кедергі адамдар əр түрлі тіл де, диалектте, не 
сақауланып сөйлегенде пайда болады. Сөйлеушінің тілі реңкі жоқ, 
тез, жаңылтпаш, қажетсіз сөздерге толы болған кезде де, 
түсініспеушілік кедергісі туындайды. 
Ø Семантикалық кедергілер жаргон мəселесімен тығыз байланысты. 
Ортақтсуға қатысушылардың өзіндік шағын мəдениеттерінде 
ұғымдар мен құбылыстардың ерекше мəн-мағынасы болады. 
Ø Стильдік кедергі – коммуникатор мен реципиенттік тілдік стильдері 
бір-біріне не тілдің стилі ортақтасу жағдайына, реципиенттік көңіл- 
күйіне сəйкес келмеуі. 
Ø Логикалық кедергілер – сөйлеушілер мен тыңдаушының қабылдау 
логикасы, дəлелдеу жүйесі əртүрлі болғанда пайда болатын. Қоғамда 
логикалық жүйелер өте көп. 
Перцепция немесе қабылдау-бұл сезім мүшелеріне тікелей əсер ету 
кезінде объектілерді немесе құбылыстарды бейнелеу процестері. 
Перцептивті процестер басқару қызметі үшін кəсіби маңызды ақпаратты 
қабылдауды қамтамасыз етеді. 
 Қабылдау түрлері қандай анализатор (сезім органы) жетекші рөл 
атқаратындығына байланысты болады — визуалды, есту, жанасу, мотор 
(кинестетикалық), иісті, дəмді. Материяның тіршілік ету формасына 
байланысты кеңістікті, бағытты, шаманы қабылдау (мұнда өз кезегінде 
форманы, қашықтықты, тереңдікті, перспективаны жəне т.б. қабылдау 
ерекшеленеді) жəне уақытты қабылдау ерекшеленеді.  
Қабылдау күрделілік өлшеміне, оның процесінің егжей — тегжейіне 
байланысты бөлінеді: бір мезгілде ("бір сəтте", лезде) жəне сабақтастық 
(микро кезеңдерге салыстырмалы түрде бөлінген), хабардарлық дəрежесі 
бойынша-ерікті жəне еріксіз қабылдау.  

Қабылдау бірқатар негізгі қасиеттерге ие:  
• Объективтілік 
• Тұтастық  
• Құрылымдық 
• Мағыналық 
• Селективтілік 
• Тұрақтылық 
• адамның өткен тəжірибесіне тəуелділік (апперцептивтілік) 
• Шектеулі көлем.  
Қабылдау процесі бір-бірін алмастыратын бірқатар кезеңдерді 
(қабылдау кезеңдерін) қамтиды: анықтау, ажырату, сəйкестендіру, 
санаттау, тану, тану. 
Барлық осы түрлер, қасиеттер, фазалар, заңдылықтар сыртқы 
ақпараттың барабар жəне мағыналы, объективті жəне құ рылымдық 
көрінісін қамтамасыз ететін 2 басқару қызметінде сақталады. Олар 
көшбасшының сенсорлық тəжірибесін қалыптастыру механизмдерін 
құрайды. Мысалы, сыртқы жағдайдың маңызды ерекшеліктерін анықтауды 
қамтамасыз ететін қабылдаудың селективтілігі үлкен рөл  атқарады. 
Құрылымдық қасиет бірдей маңызды, бұл сізге біртұтас (панорамалық) 
мүмкіндік береді, бірақ сонымен бірге жағдайларды ішкі тəртіппен 
қабылдауға мүмкіндік береді. Апперцептивтілік қасиеті қабылданған 
ақпаратты кəсіби жəне жеке тəжірибемен үнемі «байланыстыруды», сондай 
— ақ оны «декодтау» - декодтауды қамтамасыз етеді. 
Басқарушылық қызметте қабылдаудың жеке стильдік 
айырмашылықтары маңызды рөл атқарады. Екі негізгі стиль бар — 
Аналитикалық жəне синтетикалық жəне екі қосымша — аналитикалық-
синтетикалық жəне эмоционалды.  «Синтетика» құбылыстарды 
жалпылама бейнелеуге жəне олардың жалпы, негізгі мағынасын анықтауға 
бейімділікпен сипатталады. "Талдаушылар", керісінше, бөлшектерді, 
бөлшектерді, бөлшектерді бөлуге бейімділікпен сипатт алады. 
Аналитикалық жəне синтетикалық тип осы ерекшеліктердің үйлесімімен 
сипатталады, алайда екеуінің де ауырлығы аз. Эмоционалды тип жағдайға 
сезімтал реакцияның жоғарылауымен сипатталады, бұл, əдетте, оның тиісті 
қабылдауына кедергі келтіреді. Басқарушылық қызмет үшін ең жақсы 
нəрсе-бұл үшінші, аналитикалық жəне синтетикалық, қабылдау түрі; 
алғашқы екеуі аз тиімді; төртіншісі басшылыққа қарсы əрекет етеді 
 
Қабылдау стилі 
 
Сипаттамасы 
 

Синтетикалық  Құбылыстарды жалпылама бейнелеу 
жəнеолардың жалпы, негізгі мағынасын 
анықтау 
Аналитикалық  Құбылыстарды қабылдау кезінде 
оқшаулау үрдісі 
Аналитикалық 
синтетикалық  
Ол осы ерекшеліктердің үйлесімімен 
сипатталады 
Эмоционалды  
 
Сезімталдықтың жоғарылауымен 
сипатталады 
 
Қорытындылай келе, қабылдаудың жалпы сипаттамаларының ішінде 
байқау сияқты маңызды жеке ерекшелікті атап өту керек. Бұл қабылдаудың 
жалпылама сипаттамасы, оның барлық басқа ерекшеліктерінен алынған. Ол 
таңдамалы, ерікті, мағыналы жəне жағдайдың маңызды ере кшеліктерін 
ескере отырып, өткен тəжірибе негізінде бағалаумен байланысты. 
Басқарушылық қызметке қатысты жай ғана байқау туралы емес, маңызды 
басшы ретінде «күрделі байқау» (Б.М. Теплов) туралы айту əдетке 
айналған. 
Басқарушылық қызметтегі перцептивті процестердің ерекшелігі 
екі негізгі жағдаймен анықталады. 
• Біріншіден, қабылдау барлық басқа танымдық процестермен (ең алдымен 
жадымен, ойлауымен) тығыз байланысты, бұл оның жоғары болуымен 
(кəсіби басқару тəжірибесіне байланысты) көрінеді. Ол, шын мəнінде, 
олармен біріктіріледі жəне тек ақпарат қабылдау ретінде ғана емес, 
сонымен бірге оны бағалау, түсіну, оған деген көзқарасты қалыптастыру 
ретінде əрекет етеді. Басқарушылық қызметтің кешенді сипаты оған 
барлық танымдық процестердің синтетикалық қатысуын барынша талап 
етеді.  
• Екіншіден, басшының қызметіндегі қабылдаудың" материалы " өте 
ерекше. Қабылдау туралы ақпарат - бұл сыртқы əлемнің объектілері емес 
(əрине, олар да), сонымен қатар субъектілер - олардың қасиеттері, 
белгілері, қасиеттері, ниеттерінің əртүрлілігі мен сəйкессіздігінде жеке 
тұлғалар.  
Осылайша, көшбасшының іс - əрекетіндегі қабылдау, ең алдымен, 
жеке, субъективті (дəлірек айтқанда, тұлғааралық) қабылдау болып 
табылады. Қабылдау объектісі-бұл күрделі жəне нақты объект, оның 
параметрлері бойынша қабылдау субъектісіне ұқсас, ол «басқа адам». 
Сондықтан басқарушылық қызметтегі перцептивті процестердің 

ерекшелігі, мұнда олар өздерінің ерекше түрінде - тұлғааралық қабылдау, 
əлеуметтік қабылдау ретінде əрекет етеді. 
Американдық психолог Дж. Брунер 1947 жылы «Əлеуметтік 
қабылдау» терминін басқа адамдарды, əлеуметтік топтарды жəне тіпті 
«үлкен əлеуметтік қауымдастықтарды», «əлеуметтік нысандарды» 
қабылдауды білдіреді деп ұсынған болатын. Əлеуметтік қабылдау 
құбылыстардың кең ауқымын оның сорттары қамтиды. Бұл, біріншіден, 
жеке қабылдау (адамның адамның қабылдауы). Бұл адамның 
қабылдағышпен бірдей топқа жататындығына немесе басқа топқа 
жататындығына байланысты («біреудің» құбылысы). Екіншіден, жеке 
адамның кейбір топтарды тұтастай қабылдауы, ол өзінің жəне басқа 
адамдардың топтарына қатысты да ерекшеленеді. Үшіншіден, бұл 
топтардың бір-бірін топ аралық қабылдауы, сонымен қатар топтың өзін-өзі 
қабылдауы деп аталады. Əлеуметтік қабылдаудың барлық осы түрлері 
басқарушылық қызметтің мазмұнына еніп, оның коммуникативті 
функциясының негізін құрайды. Алайда, олар тағы бір маңызды фактормен 
толықтырылады, бұл - қабылдау ерекшелігі қай жазықтықта орналасқанына 
байланысты бағыну немесе үйлестіру.  
Тұтастай алғанда, жетекшісінің бағыныштыларды қабылдауының 
келесі негізгі ерекшеліктері бар:  
1) бағыныштының жалпы əсерін оның жеке сипаттамаларын іскерлік 
жəне жеке сипаттамаларын бағалауға ауыстыру («жалпылау əсері»);  
2) көшбасшыны қолдайтын бағыныштылардың бағаларын 
жоғарылату; 
3) басшыға ұқсас пікірін білдіретін бағыныштылардың бағаларын 
көтеру;  
4) басшыны қолдамайтын жəне оның пікіріне қайшы келетін пікірлерін 
білдіретін бағыныстылардың бағаларын төмендету;  
5) басшы өз тарапынан теріс баға алған адамдардан өзіне келіп түсетін 
ақпаратты бұғаттайды.  
Осыған байланысты тағы бір маңызды мəселе туындайды: ол 
басқаратын топ жетекшісінің өзін қабылдаудың жеткіліктілігі туралы. Бұл 
əсіресе тиімді көшбасшылық үшін өте маңызды, өйткені бірлескен 
қызметтің тиімділігі топ (ұйым) жетекшісі нің қаншалықты 
"қабылданғанына" байланысты. Шетелдік зерттеулерде көшбасшыны оның 
қол астындағылар қалай қабылдауы керек екендігі туралы өзіндік норматив 
əзірленді, оның қызметі тиімді болды: біріншіден, «біздің біріміз»; 
екіншіден, «көпшілігімізге ұқсас»; үшінші, «ең жақсысы»; төртіншіден, ол 
топ мүшелерінің  үмітін қанағаттандыруы керек. 
Бекіту сұрақтары: 
1. Коммуникация жəне қатынасу ұғымдарының мағынасын ашыңыз. 
2. Коммуникация типтерін жіктеңіз. 

3. Перцепция немесе қабылдау ұғымының мəнін ашыңыз. 
4. Басқарушылық қызметтегі перцептивті процестердің ерекшелігіне 
тоқталыңыз. 
 

`}],u=[{id:"intro",category:"intro",shortTitle:"Кіріспе",title:"Кіріспе",numPages:1},{id:"lecture-1",category:"lecture",shortTitle:"1-дәріс",title:"І Бөлім. Басқару психологиясының теориялық-әдіснамалық негіздері. § 1 Басқару психологиясының пәні мен міндеттері",numPages:6},{id:"lecture-2",category:"lecture",shortTitle:"2-дәріс",title:"§ 2 Басқарудың психологиялық теориясы",numPages:22},{id:"lecture-3",category:"lecture",shortTitle:"3-дәріс",title:"§ 3 Басқару ғылымының даму тарихы",numPages:14},{id:"lecture-4",category:"lecture",shortTitle:"4-дәріс",title:"§ 4 Жеке тұлға басқарудың объектісі мен субъектісі",numPages:9},{id:"lecture-5",category:"lecture",shortTitle:"5-дәріс",title:"§ 5 Еңбек мотивациясы",numPages:3},{id:"lecture-6",category:"lecture",shortTitle:"6-дәріс",title:"ІІ Бөлім. Ұжымның әлеуметтік-психологиялық ахуалын басқару. § 6 Ұжым. Ұжымның даму деңгейлері",numPages:3},{id:"lecture-7",category:"lecture",shortTitle:"7-дәріс",title:"§ 7 Басқару стилі және ұжымның психологиялық ахуалына әсері",numPages:5},{id:"lecture-8",category:"lecture",shortTitle:"8-дәріс",title:"§ 8 Жетекшілік және көшбасшылық. Көшбасшы теориясының қағидалары",numPages:7},{id:"lecture-9",category:"lecture",shortTitle:"9-дәріс",title:"§ 9 Басқару шешімдерін қабылдау процесінің жалпы сипаттамасы",numPages:16},{id:"lecture-10",category:"lecture",shortTitle:"10-дәріс",title:"§ 10 Басқару іс-әрекетіндегі перцептивтік процестер",numPages:6}],w="Есенғұлова Мейрамгүл Нұралықызы",T="Педагогика ғылымдарының кандидаты, доцент",E="./assets/images/фотфото.jpeg",I="./assets/images/авторы.png",L=`Есенғұлова Мейрамгүл Нұралықызы — педагогика ғылымдарының кандидаты, доцент. Салыстырмалы Педагогика Кеңесінің мүшесі (Куәлік №0057). Қ.Жұбанов атындағы Ақтөбе өңірлік мемлекеттік университетінің «Психологиялық-педагогикалық және арнайы білім беру» кафедрасының доценті қызметін атқаруда.

2015 жылы ҚР заңының 23 бабына сәйкес ғылыми-техникалық істерге байланысты аккредитациядан өтті (куәлік № 004632) және Қазақстан Республикасының рухани және әлеуметтік дамуы жолында қол жеткен табыстары және өркендеуіне қосқан зор үлесі үшін Қ.Жұбанов атындағы Ақтөбе өңірлік мемлекеттік университетіне 50 жыл мерекелік (Куәлік №077) және Халықаралық педагогика және инновациялық технологиялар ғылым академиясы №8 хаттамасының шешіміне сәйкес «Асыл ұстаз» (Куәлік № УАҰ 007) Төс белгілерімен марапатталды.`,p={name:w,title:T,photo:E,badgeImage:I,bio:L},o={currentRoute:"cover",viewMode:localStorage.getItem("book2_view_mode")||"text",theme:localStorage.getItem("book2_theme")||"paper",fontSize:localStorage.getItem("book2_fontsize")||"md"},i={readingProgress:document.getElementById("readingProgress"),readingContainer:document.getElementById("readingContainer"),sidebar:document.getElementById("sidebar"),tocNav:document.getElementById("tocNav"),sidebarFilterInput:document.getElementById("sidebarFilterInput"),toggleSidebarBtn:document.getElementById("toggleSidebarBtn"),brandHomeBtn:document.getElementById("brandHomeBtn"),themeToggleBtn:document.getElementById("themeToggleBtn"),themeIcon:document.getElementById("themeIcon"),fontDecBtn:document.getElementById("fontDecBtn"),fontIncBtn:document.getElementById("fontIncBtn"),fullscreenBtn:document.getElementById("fullscreenBtn"),openSearchBtn:document.getElementById("openSearchBtn"),searchModal:document.getElementById("searchModal"),closeSearchModalBtn:document.getElementById("closeSearchModalBtn"),globalSearchInput:document.getElementById("globalSearchInput"),searchResults:document.getElementById("searchResults"),navTabs:document.querySelectorAll(".nav-tab-btn")};function m(){try{const n=new Audio("./assets/audio/Click1.ogg");n.volume=.4,n.play().catch(()=>{})}catch{}}function y(n){o.theme=n,document.documentElement.setAttribute("data-theme",n),localStorage.setItem("book2_theme",n);const e={paper:"☀️",sepia:"📜",dark:"🌙"};i.themeIcon&&(i.themeIcon.textContent=e[n]||"☀️")}function $(){const n=["paper","sepia","dark"],e=n[(n.indexOf(o.theme)+1)%n.length];y(e)}function x(n){o.fontSize=n,document.documentElement.setAttribute("data-size",n),localStorage.setItem("book2_fontsize",n)}function v(n){const e=["sm","md","lg","xl"];let c=e.indexOf(o.fontSize)+n;c>=0&&c<e.length&&x(e[c])}function k(n=""){i.tocNav.innerHTML="";const e=n.toLowerCase().trim();[{id:"cover",icon:"🏛",title:"Басты бет (Университет)"},{id:"menu",icon:"📋",title:"Дәрістер мәзірі"},{id:"intro",icon:"📖",title:"Кіріспе"}].forEach(s=>{if(!e||s.title.toLowerCase().includes(e)){const r=document.createElement("a");r.className=`toc-item-link ${o.currentRoute===s.id?"active":""}`,r.href=`#${s.id}`,r.innerHTML=`<span class="toc-item-badge">${s.icon}</span><span><strong>${s.title}</strong></span>`,i.tocNav.appendChild(r)}});const a=u.filter(s=>{const r=parseInt(s.shortTitle,10),d=r>=1&&r<=5,g=!e||s.title.toLowerCase().includes(e)||s.shortTitle.toLowerCase().includes(e);return d&&g});if(a.length>0){const s=document.createElement("div");s.className="toc-group",s.innerHTML='<div class="toc-group-title">І Бөлім. Теориялық-әдіснамалық негіздер</div>',a.forEach(r=>{const d=document.createElement("a");d.className=`toc-item-link ${o.currentRoute===r.id?"active":""}`,d.href=`#${r.id}`,d.innerHTML=`
        <span class="toc-item-badge">${r.shortTitle}</span>
        <span>${r.title.replace(/^[^§]+/,"").trim()||r.title}</span>
      `,s.appendChild(d)}),i.tocNav.appendChild(s)}const t=u.filter(s=>{const r=parseInt(s.shortTitle,10),d=r>=6&&r<=10,g=!e||s.title.toLowerCase().includes(e)||s.shortTitle.toLowerCase().includes(e);return d&&g});if(t.length>0){const s=document.createElement("div");s.className="toc-group",s.innerHTML='<div class="toc-group-title">ІІ Бөлім. Ұжымның ахуалын басқару</div>',t.forEach(r=>{const d=document.createElement("a");d.className=`toc-item-link ${o.currentRoute===r.id?"active":""}`,d.href=`#${r.id}`,d.innerHTML=`
        <span class="toc-item-badge">${r.shortTitle}</span>
        <span>${r.title.replace(/^[^§]+/,"").trim()||r.title}</span>
      `,s.appendChild(d)}),i.tocNav.appendChild(s)}[{id:"author",icon:"👤",title:"Кітап авторы туралы"},{id:"docs",icon:"📁",title:"Барлық PDF файлдар (11)"}].forEach(s=>{if(!e||s.title.toLowerCase().includes(e)){const r=document.createElement("a");r.className=`toc-item-link ${o.currentRoute===s.id?"active":""}`,r.href=`#${s.id}`,r.style.marginTop="0.4rem",r.innerHTML=`<span class="toc-item-badge">${s.icon}</span><span><strong>${s.title}</strong></span>`,i.tocNav.appendChild(r)}})}function B(){i.readingContainer.innerHTML=`
    <!-- Түпнұсқа Автоплей басты экраны -->
    <div class="classic-start-card">
      <div class="classic-university-title">
        Қ.Жұбанов атындағы Ақтөбе өңірлік мемлекеттік университеті
      </div>

      <div class="classic-start-body">
        <div class="classic-start-buttons">
          <a href="#menu" class="classic-btn-action primary" id="btnStartReading">
            ▶ БАСТАУ
          </a>
          <a href="#author" class="classic-btn-action" id="btnAuthorInfo">
            👤 КІТАП АВТОРЫ
          </a>
          <a href="#docs" class="classic-btn-action" id="btnPdfDocs">
            📚 БАРЛЫҚ PDF ҚҰЖАТТАР
          </a>
        </div>

        <div>
          <img src="./assets/images/logobook.png" alt="Басқару психологиясы" class="classic-brain-logo" />
        </div>
      </div>

      <div class="classic-book-title">
        Басқару психологиясы
      </div>
    </div>

    <!-- Заманауи шолу карточкалары -->
    <div class="cover-hero" style="margin-top: 1.5rem; padding: 2rem;">
      <span class="cover-badge">Электрондық оқу құралы</span>
      <p class="cover-subtitle" style="margin: 0;">
        Басқару қызметінің психологиялық заңдылықтары, жеке тұлға мен ұжымның өзара әрекеттесуі, 
        еңбек мотивациясы, көшбасшылық қағидалары мен басқарушылық шешімдер қабылдау жүйесі.
      </p>

      <div style="font-size: 0.95rem; color: var(--text-secondary);">
        Автор: <strong>${p.name}</strong> (${p.title})
      </div>

      <div class="cover-meta" style="margin-top: 0.5rem; padding-top: 1rem;">
        <div>📑 <strong>10</strong> Кешенді дәріс</div>
        <div>📄 <strong>11</strong> Түпнұсқа PDF құжат</div>
        <div>👥 <strong>2</strong> Негізгі бөлім</div>
        <div>🎓 Университет стандарты</div>
      </div>
    </div>

    <!-- Бөлімдер карточкалары -->
    <div style="display: grid; grid-template-columns: repeat(auto-fit, minmax(280px, 1fr)); gap: 1.25rem;">
      <div class="nav-card" style="max-width: 100%; padding: 1.5rem;">
        <span class="nav-card-label">І БӨЛІМ</span>
        <h3 style="margin: 0.5rem 0; font-size: 1.15rem; color: var(--text-main);">Теориялық-әдіснамалық негіздер</h3>
        <p style="font-size: 0.88rem; color: var(--text-secondary); line-height: 1.5; margin-bottom: 1rem;">
          Басқару психологиясының пәні, тарихы, басқару объектісі мен субъектісі, еңбек мотивациясы (1-5 дәрістер).
        </p>
        <a href="#lecture-1" class="btn-secondary" style="align-self: flex-start; font-size: 0.85rem; padding: 0.4rem 0.85rem;">
          1-дәріске өту →
        </a>
      </div>

      <div class="nav-card" style="max-width: 100%; padding: 1.5rem;">
        <span class="nav-card-label">ІІ БӨЛІМ</span>
        <h3 style="margin: 0.5rem 0; font-size: 1.15rem; color: var(--text-main);">Ұжымның ахуалын басқару</h3>
        <p style="font-size: 0.88rem; color: var(--text-secondary); line-height: 1.5; margin-bottom: 1rem;">
          Ұжым дамуы, басқару стилі, көшбасшылық және жетекшілік, шешім қабылдау және перцептивтік процестер (6-10 дәрістер).
        </p>
        <a href="#lecture-6" class="btn-secondary" style="align-self: flex-start; font-size: 0.85rem; padding: 0.4rem 0.85rem;">
          6-дәріске өту →
        </a>
      </div>
    </div>
  `,document.querySelectorAll(".classic-btn-action").forEach(n=>n.addEventListener("click",m)),window.scrollTo({top:0,behavior:"smooth"})}function M(){i.readingContainer.innerHTML=`
    <div class="classic-lectures-board">
      <div class="classic-board-backdrop"></div>
      <div class="classic-board-content">
        <!-- Кіріспе түймесі -->
        <div class="classic-intro-btn-wrap">
          <a href="#intro" class="classic-green-btn sound-click" style="min-width: 200px; font-size: 1.1rem; padding: 0.85rem 2rem;">
            КІРІСПЕ
          </a>
        </div>

        <!-- 10 Дәріс батырмалары екі бағанда -->
        <div class="classic-grid-columns">
          <div class="classic-grid-col">
            <a href="#lecture-1" class="classic-green-btn sound-click">1 ЛЕКЦИЯ</a>
            <a href="#lecture-2" class="classic-green-btn sound-click">2 ЛЕКЦИЯ</a>
            <a href="#lecture-3" class="classic-green-btn sound-click">3 ЛЕКЦИЯ</a>
            <a href="#lecture-4" class="classic-green-btn sound-click">4 ЛЕКЦИЯ</a>
            <a href="#lecture-5" class="classic-green-btn sound-click">5 ЛЕКЦИЯ</a>
          </div>

          <div class="classic-grid-col">
            <a href="#lecture-6" class="classic-green-btn sound-click">6 ЛЕКЦИЯ</a>
            <a href="#lecture-7" class="classic-green-btn sound-click">7 ЛЕКЦИЯ</a>
            <a href="#lecture-8" class="classic-green-btn sound-click">8 ЛЕКЦИЯ</a>
            <a href="#lecture-9" class="classic-green-btn sound-click">9 ЛЕКЦИЯ</a>
            <a href="#lecture-10" class="classic-green-btn sound-click">10 ЛЕКЦИЯ</a>
          </div>
        </div>

        <!-- Үйге оралу түймесі (HOME.png) -->
        <div class="classic-home-btn-wrap">
          <a href="#cover" class="classic-home-btn sound-click" title="Басты бетке оралу">
            <img src="./assets/images/HOME.png" alt="Басты бет" />
          </a>
          <span style="margin-left: 1rem; font-weight: 600; font-size: 0.95rem; color: #1e293b; background: rgba(255,255,255,0.85); padding: 0.3rem 0.8rem; border-radius: 6px;">
            Басты бетке оралу
          </span>
        </div>
      </div>
    </div>
  `,document.querySelectorAll(".sound-click").forEach(n=>n.addEventListener("click",m)),window.scrollTo({top:0,behavior:"smooth"})}function P(){i.readingContainer.innerHTML=`
    <div class="author-card">
      <div style="display: flex; justify-content: space-between; align-items: center;">
        <span class="cover-badge">Ресми ақпарат</span>
        <a href="#cover" class="classic-home-btn sound-click" title="Басты бетке">
          <img src="./assets/images/HOME.png" alt="Басты бет" />
        </a>
      </div>

      <h1 style="font-family: var(--font-body); font-size: 2rem; font-weight: 700; color: var(--text-main); margin: 0;">
        Кітап авторы
      </h1>

      <div class="author-header" style="border: none; padding-bottom: 0;">
        <img src="${p.photo}" alt="${p.name}" class="author-photo-img" style="width: 220px; height: 260px; border-radius: 12px; object-fit: cover;" />
        <div class="author-info-wrap" style="flex: 1;">
          <h2 class="author-name" style="font-size: 1.5rem; margin-bottom: 0.5rem;">${p.name}</h2>
          <div class="author-title" style="margin-bottom: 1rem;">${p.title}</div>
          <div class="author-bio-text" style="font-size: 0.98rem; text-align: justify; line-height: 1.75;">
            ${p.bio.split(`

`).map(n=>`<p style="margin-bottom: 0.85rem;">${n}</p>`).join("")}
          </div>
        </div>
      </div>

      <div class="author-badge-card">
        <h3 style="font-size: 0.95rem; color: var(--text-secondary); margin-bottom: 0.75rem; text-transform: uppercase; letter-spacing: 0.05em;">
          Төс белгі куәлігі мен марапаттау құжаты:
        </h3>
        <img src="${p.badgeImage}" alt="Автор марапаты" class="author-badge-img" style="max-height: 280px; object-fit: contain;" />
      </div>

      <div style="display: flex; justify-content: space-between; align-items: center; margin-top: 1rem; border-top: 1px solid var(--border); padding-top: 1.25rem;">
        <a href="#menu" class="btn-secondary sound-click">
          ← Дәрістер мәзірі
        </a>
        <a href="#lecture-1" class="btn-primary sound-click">
          1-дәрісті оқуға көшу →
        </a>
      </div>
    </div>
  `,document.querySelectorAll(".sound-click").forEach(n=>n.addEventListener("click",m)),window.scrollTo({top:0,behavior:"smooth"})}function X(){i.readingContainer.innerHTML=`
    <div class="author-card">
      <div style="display: flex; justify-content: space-between; align-items: center;">
        <div>
          <span class="cover-badge">Түпнұсқа материалдар</span>
          <h1 style="font-family: var(--font-body); font-size: 1.85rem; font-weight: 700; color: var(--text-main); margin-top: 0.25rem;">
            Барлық 11 PDF оқулық құжаттары
          </h1>
        </div>
        <a href="#cover" class="classic-home-btn sound-click" title="Басты бетке">
          <img src="./assets/images/HOME.png" alt="Басты бет" />
        </a>
      </div>

      <p style="color: var(--text-secondary); line-height: 1.6;">
        Оқулықтың барлық дәрістері түпнұсқа PDF форматында сақталған. 
        Кез келген файлды онлайн қарауға немесе құрылғыңызға жүктеп алуға болады.
      </p>

      <div class="docs-list-grid">
        ${f.map(n=>`
          <div class="doc-file-card">
            <div class="doc-file-header">
              <span class="doc-file-icon">📄</span>
              <div class="doc-file-info">
                <span class="doc-file-name">${n.shortTitle}</span>
                <span class="doc-file-meta">${n.title}</span>
                <span class="doc-file-meta" style="color: var(--accent); font-weight: 600;">Бет саны: ${n.numPages}</span>
              </div>
            </div>
            <div class="doc-file-actions">
              <a href="#${n.id}" class="btn-primary" style="font-size: 0.85rem; padding: 0.45rem 0.9rem;">
                Оқулықта ашу
              </a>
              <a href="${n.pdfFile}" target="_blank" class="btn-secondary" style="font-size: 0.85rem; padding: 0.45rem 0.9rem;">
                ↗️ Жеке ашу
              </a>
              <a href="${n.pdfFile}" download class="btn-secondary" style="font-size: 0.85rem; padding: 0.45rem 0.9rem;">
                ⬇️ Жүктеу
              </a>
            </div>
          </div>
        `).join("")}
      </div>

      <div style="border-top: 1px solid var(--border); padding-top: 1.25rem; display: flex; justify-content: space-between;">
        <a href="#menu" class="btn-secondary sound-click">← Дәрістер мәзіріне өту</a>
        <a href="#cover" class="btn-primary sound-click">Басты бетке өту</a>
      </div>
    </div>
  `,document.querySelectorAll(".sound-click").forEach(n=>n.addEventListener("click",m)),window.scrollTo({top:0,behavior:"smooth"})}function h(n){const e=f.find(r=>r.id===n);if(!e){i.readingContainer.innerHTML='<div class="cover-hero"><h2>Дәріс табылмады</h2><a href="#cover" class="btn-primary">Басты бетке оралу</a></div>';return}const c=u.findIndex(r=>r.id===n),a=c>0?u[c-1]:null,t=c<u.length-1?u[c+1]:null;i.readingContainer.innerHTML=`
    <article class="article-container">
      <!-- Жоғарғы басқару тақтасы -->
      <div class="view-mode-bar">
        <div style="display: flex; align-items: center; gap: 0.75rem;">
          <a href="#menu" class="btn-secondary sound-click" style="padding: 0.35rem 0.75rem; font-size: 0.85rem;" title="Дәрістер мәзіріне қайту">
            ← Мәзір
          </a>
          <span style="font-size: 0.88rem; color: var(--text-main); font-weight: 600;">
            ${e.shortTitle} (${e.numPages} бет)
          </span>
        </div>

        <div class="mode-segmented-control">
          <button id="viewTextModeBtn" class="mode-btn ${o.viewMode==="text"?"active":""}">
            📝 Веб-мәтін
          </button>
          <button id="viewPdfModeBtn" class="mode-btn ${o.viewMode==="pdf"?"active":""}">
            📄 Түпнұсқа PDF
          </button>
        </div>

        <div style="display: flex; gap: 0.5rem;">
          <a href="${e.pdfFile}" target="_blank" class="control-btn" title="PDF-ті жеке терезеде ашу">
            <svg width="14" height="14" viewBox="0 0 24 24" fill="none" stroke="currentColor" stroke-width="2">
              <path d="M18 13v6a2 2 0 0 1-2 2H5a2 2 0 0 1-2-2V8a2 2 0 0 1 2-2h6"></path>
              <polyline points="15 3 21 3 21 9"></polyline>
              <line x1="10" y1="14" x2="21" y2="3"></line>
            </svg>
            <span style="margin-left: 4px;">Ашу</span>
          </a>
          <a href="${e.pdfFile}" download class="control-btn" title="PDF-ті жүктеп алу">
            <svg width="14" height="14" viewBox="0 0 24 24" fill="none" stroke="currentColor" stroke-width="2">
              <path d="M21 15v4a2 2 0 0 1-2 2H5a2 2 0 0 1-2-2v-4"></path>
              <polyline points="7 10 12 15 17 10"></polyline>
              <line x1="12" y1="15" x2="12" y2="3"></line>
            </svg>
            <span style="margin-left: 4px;">Жүктеу</span>
          </a>
        </div>
      </div>

      <!-- Контент блогы -->
      ${o.viewMode==="text"?`
        <header class="article-header" style="margin-top: 1.5rem;">
          <span class="article-category-badge">Дәріс кешені</span>
          <h1 class="article-title">${e.title}</h1>
          <div class="article-meta">
            <span>📖 ${e.shortTitle}</span>
            <span>⏱ ~${Math.max(3,e.numPages*2)} минуттық оқу</span>
            <span>📄 ${e.numPages} беттік түпнұсқа</span>
          </div>
        </header>

        <div class="article-body">
          ${e.textHtml}
        </div>
      `:`
        <div style="margin-top: 1.5rem;">
          <div style="background: var(--bg-hover); padding: 0.75rem 1rem; border-radius: var(--radius-sm); margin-bottom: 0.75rem; display: flex; justify-content: space-between; align-items: center; font-size: 0.85rem;">
            <span>📄 Түпнұсқа құжат: <strong>${e.shortTitle} (${e.pdfFile.split("/").pop()})</strong></span>
            <a href="${e.pdfFile}" target="_blank" class="btn-primary" style="font-size: 0.8rem; padding: 0.35rem 0.75rem;">
              ↗️ Жаңа қойындыда ашу
            </a>
          </div>
          <iframe src="${e.pdfFile}" class="pdf-viewer-frame" title="${e.title}">
            <p>Браузеріңіз PDF қарауды қолдамайды. 
              <a href="${e.pdfFile}" target="_blank">PDF құжатты мына жерден ашыңыз</a>.
            </p>
          </iframe>
        </div>
      `}

      <!-- Навигация -->
      <nav class="chapter-navigation" aria-label="Бөлімдер бойынша шарлау">
        ${a?`
          <a href="#${a.id}" class="nav-card sound-click">
            <span class="nav-card-label">← Алдыңғы дәріс</span>
            <span class="nav-card-title">${a.shortTitle}: ${a.title}</span>
          </a>
        `:`
          <a href="#menu" class="nav-card sound-click">
            <span class="nav-card-label">← Мәзір</span>
            <span class="nav-card-title">📋 Барлық дәрістер тізімі</span>
          </a>
        `}

        ${t?`
          <a href="#${t.id}" class="nav-card sound-click" style="text-align: right; align-items: flex-end;">
            <span class="nav-card-label">Келесі дәріс →</span>
            <span class="nav-card-title">${t.shortTitle}: ${t.title}</span>
          </a>
        `:`
          <a href="#author" class="nav-card sound-click" style="text-align: right; align-items: flex-end;">
            <span class="nav-card-label">Қорытынды →</span>
            <span class="nav-card-title">👤 Кітап авторы туралы</span>
          </a>
        `}
      </nav>
    </article>
  `;const l=document.getElementById("viewTextModeBtn"),s=document.getElementById("viewPdfModeBtn");l&&s&&(l.addEventListener("click",()=>{m(),o.viewMode="text",localStorage.setItem("book2_view_mode","text"),h(n)}),s.addEventListener("click",()=>{m(),o.viewMode="pdf",localStorage.setItem("book2_view_mode","pdf"),h(n)})),document.querySelectorAll(".sound-click").forEach(r=>r.addEventListener("click",m)),window.scrollTo({top:0,behavior:"smooth"})}function S(n){if(o.currentRoute=n,i.navTabs.forEach(e=>{const c=e.dataset.route;let a=!1;(c==="cover"&&o.currentRoute==="cover"||c==="menu"&&o.currentRoute==="menu"||c==="intro"&&o.currentRoute==="intro"||c==="lecture-1"&&o.currentRoute.startsWith("lecture-")&&parseInt(o.currentRoute.replace("lecture-",""),10)<=5||c==="lecture-6"&&o.currentRoute.startsWith("lecture-")&&parseInt(o.currentRoute.replace("lecture-",""),10)>=6||c==="author"&&o.currentRoute==="author"||c==="docs"&&o.currentRoute==="docs")&&(a=!0),e.classList.toggle("active",a)}),k(i.sidebarFilterInput?i.sidebarFilterInput.value:""),o.currentRoute==="cover"?B():o.currentRoute==="menu"?M():o.currentRoute==="author"?P():o.currentRoute==="docs"?X():h(o.currentRoute),window.innerWidth<=860){i.sidebar&&i.sidebar.classList.add("collapsed");const e=document.getElementById("sidebarBackdrop");e&&e.classList.remove("active")}}function b(){const n=window.location.hash.replace("#","").trim();S(n||"cover")}function H(n){const e=n.toLowerCase().trim();if(e.length<2){i.searchResults.innerHTML='<p style="color: var(--text-muted); text-align: center; padding: 2rem 0;">Іздеу үшін кемінде 2 әріп енгізіңіз</p>';return}const c=[];if(f.forEach(a=>{if(a.title.toLowerCase().includes(e)){c.push({id:a.id,title:a.title,snippet:a.title});return}const t=a.rawText.toLowerCase().indexOf(e);if(t!==-1){const l=Math.max(0,t-60),s=Math.min(a.rawText.length,t+100),r=a.rawText.substring(l,s).replace(new RegExp(`(${e})`,"gi"),"<mark>$1</mark>");c.push({id:a.id,title:F(a),snippet:`...${r}...`})}}),c.length===0){i.searchResults.innerHTML=`<p style="color: var(--text-muted); text-align: center; padding: 2rem 0;">«${n}» бойынша ештеңе табылмады</p>`;return}i.searchResults.innerHTML=`
    <div style="font-size: 0.85rem; color: var(--text-muted); margin-bottom: 0.75rem;">Табылды: ${c.length} дәріс</div>
    <div style="display: flex; flex-direction: column; gap: 0.5rem;">
      ${c.map(a=>`
        <a href="#${a.id}" class="search-result-item" style="padding: 0.75rem; border: 1px solid var(--border); border-radius: var(--radius-sm); display: flex; flex-direction: column; gap: 0.25rem;">
          <div style="font-weight: 600; color: var(--text-main);">${a.title}</div>
          <div style="font-size: 0.85rem; color: var(--text-secondary); line-height: 1.4;">${a.snippet}</div>
        </a>
      `).join("")}
    </div>
  `,i.searchResults.querySelectorAll("a").forEach(a=>{a.addEventListener("click",()=>i.searchModal.classList.remove("open"))})}function F(n){return`${n.shortTitle}: ${n.title}`}window.addEventListener("scroll",()=>{const n=document.documentElement,e=document.body,c="scrollTop",a="scrollHeight",t=(n[c]||e[c])/((n[a]||e[a])-n.clientHeight)*100;i.readingProgress&&(i.readingProgress.style.width=`${Math.min(100,Math.max(0,t))}%`)});function C(){y(o.theme),x(o.fontSize);const n=document.getElementById("sidebarBackdrop"),e=document.getElementById("closeSidebarBtn");function c(){i.sidebar.classList.remove("collapsed"),n&&n.classList.add("active")}function a(){i.sidebar.classList.add("collapsed"),n&&n.classList.remove("active")}i.toggleSidebarBtn.addEventListener("click",()=>{i.sidebar.classList.contains("collapsed")?c():a()}),n&&n.addEventListener("click",a),e&&e.addEventListener("click",a),i.brandHomeBtn.addEventListener("click",()=>window.location.hash="#cover"),i.navTabs.forEach(t=>t.addEventListener("click",()=>window.location.hash=`#${t.dataset.route}`)),i.themeToggleBtn.addEventListener("click",$),i.fontDecBtn.addEventListener("click",()=>v(-1)),i.fontIncBtn.addEventListener("click",()=>v(1)),i.fullscreenBtn.addEventListener("click",()=>{document.fullscreenElement?document.exitFullscreen().catch(()=>{}):document.documentElement.requestFullscreen().catch(()=>{})}),i.sidebarFilterInput.addEventListener("input",t=>k(t.target.value)),i.openSearchBtn.addEventListener("click",()=>{i.searchModal.classList.add("open"),i.globalSearchInput.focus()}),i.closeSearchModalBtn.addEventListener("click",()=>i.searchModal.classList.remove("open")),i.searchModal.addEventListener("click",t=>{t.target===i.searchModal&&i.searchModal.classList.remove("open")}),i.globalSearchInput.addEventListener("input",t=>H(t.target.value)),window.addEventListener("keydown",t=>{(t.ctrlKey||t.metaKey)&&t.key==="k"&&(t.preventDefault(),i.searchModal.classList.add("open"),i.globalSearchInput.focus()),t.key==="Escape"&&i.searchModal.classList.remove("open")}),window.addEventListener("hashchange",b),b()}C();
